{
  "id": "did-disney-abandon-andor-before-release",
  "slug": "did-disney-abandon-andor-before-release",
  "title": "Did Disney Abandon Andor Before Release?",
  "author": "Ozzie Gooen",
  "publishedDate": "2025-06-18",
  "url": "https://ozziegooen.substack.com/p/did-disney-abandon-andor-before-release",
  "platforms": [
    "Substack"
  ],
  "intendedAgents": [
    "clarity-coach",
    "research-scholar",
    "quantitative-forecaster",
    "ea-impact-evaluator",
    "bias-detector"
  ],
  "content": "_(Writing very much out of personal interest, not for research)_\n\nI really enjoyed [Andor S2](https://en.wikipedia.org/wiki/Andor_(TV_series)), similar to S1, but its place in Disney's strategy seemed mysterious.\n\n![Andor' Finale: Creator Tony Gilroy Breaks Down the 'Star Wars' Spy Saga's Gut-Wrenching Ending | Vanity Fair](https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F7034f2d3-f334-417f-a44c-81c9e08e3583_2000x1125.jpeg)\n\nAndor cost over $300M per season - about as much as a flagship Star Wars movie. Yet it seemed to have very little advertising.\n\nMost Hollywood movies spend at least as much on marketing as production. Apparently streaming is different, with simple research by Claude suggesting that Netflix spends roughly 20% of show budgets on marketing. But marketing for Andor seemed even smaller.\n\nDigging deeper, I think Disney might have realized they made a mistake after green-lighting S2. They've been scaling back heavily on streaming, but started this after approving the season. This would explain the huge production budget but minimal marketing support.\n\nSo now certain fans love the show, and Disney probably suffers of a net loss of say, $100M.[1]\n\nRelated note - while expensive (~$30M per episode), I found the sets well-done but limiting. The constraints were evident. I'm surprised by just how insanely expensive and difficult these productions are. If AI can eventually bring cost down, I'd expect the economics to shift substantially.\n\nClaude discussion link: https://claude.ai/share/6d0ac08b-c9ce-4a0e-9946-20f9ed486cef\n\n[1] I'm very unsure. But if Disney does regard it as a mistake, I assume the expected value is considered negative. I'm ballparking this as one third the production cost, but it's of course difficult to really say.",
  "reviews": []
}