{
  "id": "higher-order-forecasts-lesswrong",
  "slug": "higher-order-forecasts-lesswrong",
  "title": "Higher-Order Forecasts — LessWrong",
  "author": "ozziegooen",
  "publishedDate": "2024-05-22T21:49:42.802Z",
  "url": "https://www.lesswrong.com/posts/8BAZmmqhD98YBrfsC/higher-order-forecasts",
  "intendedAgents": [
    "bias-detector",
    "clarity-coach",
    "research-scholar",
    "fake-eliezer",
    "quantitative-forecaster",
    "ea-impact-evaluator"
  ],
  "content": "Higher-order forecasting could be a useful concept for prediction markets and forecasting systems more broadly.\n\nThe core idea is straightforward:  \n**Nth-order forecasts are forecasts about (N-1)th order forecasts.**  \n \n\n![](https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/PB57prp5kEMDgwJsm/eg77x9u7bh2noo29xrpw)\n\nAbstract representation of 2nd-order forecasts. Dall-E 3\n\n## Examples\n\nHere are some examples:\n\n**0-Order Forecasting (i.e., the ground truth)**\n\n*   Biden won the 2020 U.S. presidential election\n*   The US GDP in 2023 was $27 trillion\n\n**1st-Order Forecasting (i.e., regular forecasting)**\n\n*   What is the chance that Trump will win the 2024 U.S. presidential election?\n*   What will be the GDP of the US in 2024?\n\n**2nd-Order Forecasting**\n\n*   How much will the forecasts for US GDP in 2024 and 2025 be correlated over the next year?\n*   How many forecasts will the question \"What will be the GDP of the US in 2024?\" receive in total?\n*   If the question “_What is the chance that a Republican will win the 2028 Presidential Election?_” was posted to Manifold, with a subsidy of 100k Mana, what would the prediction be, after 1 month?”\n\n**3rd-Order Forecasting**\n\n*   How much will the forecasts, \\[How much will the forecasts for US GDP in 2024 and 2025 be correlated over the next year?\\] and \\[How many forecasts will the question \"What will be the GDP of the US in 2024?\" receive in total?\\], be correlated, from now until 2024?\n*   How valuable were all the forecasts for the question, \\[‘_How many forecasts will the question \"What will be the GDP of the US in 2024?\" receive in total?’\\]_\n\nAs forecasting systems mature, higher-order forecasts could play a role analogous to financial derivatives in markets. Derivatives allow for more efficient pricing, risk transfer, and information aggregation by letting market participants express views on the relationships between assets. Similarly, higher-order forecasts could allow forecasters to express views on the relationships between predictions, leading to a more efficient and informative overall forecasting ecosystem.\n\n## Benefits\n\nSome potential benefits of higher-order forecasting include:\n\n1.  **Identify Overconfidence**\n    *   Improve the accuracy of forecasts by having participants directly predict and get rewarded for estimating overconfidence or poor calibration in other forecasts.\n    *   _\"How overconfident is \\[forecast/forecaster\\] X\"_\n2.  **Prioritize Questions**\n    *   Prioritize the most important and decision-relevant questions by forecasting the value of information from different predictions.\n    *   _\"How valuable is the information from forecasting question X?\"_\n3.  **Surface Relationships**\n    *   Surface key drivers and correlations between events by letting forecasters predict how different questions relate to each other.\n    *   _\"How correlated will the forecasts for questions X and Y be over \\[time period\\]?\"_\n4.  **Faster Information Aggregation**\n    *   Enable faster aggregation of information by allowing forecasts on future forecast values, which may update more frequently than the underlying events.\n    *   _\"What will the forecast for question X be on \\[future date\\], conditional on \\[other forecasts or events\\]?\"_\n5.  **Leverage Existing Infrastructure**\n    *   Leverage the existing infrastructure and resolution processes of prediction platforms, which are already designed to handle large numbers of forecasting questions.\n\nWe've already seen some early examples of higher-order forecasts on platforms like Manifold Markets. For example, with the recent questions:\n\n*   [Will there be a Manifold bot that makes profitable bets on random 1-month markets by December 2024? (Ṁ3,000 subsidy!)](https://manifold.markets/CDBiddulph/will-there-be-a-manifold-bot-that-m)\n*   [Manifold Top Traders Leaderboard Ranking Prediction (2024)](https://manifold.markets/AmmonLam/manifold-top-traders-leaderboard-ra)\n*   [If Manifold begins allowing real-money withdrawals, will its accuracy improve?](https://manifold.markets/IsaacKing/if-manifold-begins-allowing-realmon)\n*   [Is Manifold's P(Doom) by 2050 currently between 10% and 90%? \\[Resolves to Poll\\]](https://manifold.markets/ManifoldAI/is-manifolds-pdoom-by-2050-currentl)\n*   [Will Manifold be more accurate than real-money markets in forecasting the 2024 election?](https://manifold.markets/benshindel/will-manifold-be-more-accurate-than)\n\n## Challenges\n\nOf course, there are also challenges and risks to consider with higher-order forecasts:\n\n1.  The accuracy of higher-order forecasts depends on the accuracy of the lower-order forecasts they build on. If the underlying forecasts are poorly calibrated or noisy, that will limit the value of higher-order forecasts.\n2.  Higher-order forecasts inherently add complexity to forecasting systems, which could create challenges for participation, interpretation, and managing systemic risks.\n3.  A substantial base of lower-order forecasting questions is needed before higher-order forecasts can be productively created on top of them.\n\n## Alternative Names\n\nI considered a few options for names, asked around a bit, and settled on \"higher-order\" for this term. Here are some other options I considered:\n\n*   **Derivatives:** In the financial market, \"markets about markets\" are called derivatives. However, \"derivative\" is often understood as a term specific to markets, which could make it more confusing for forecasting.\n*   **Meta-forecasts:** I used this term before. It's a catchy term, but it doesn't differentiate between layers easily. There's no straightforward way to refer to \"meta-layer 1.\"\n*   **Higher-Layer:** Similar to \"higher-order,\" but less precise.\n\nIf there's contention on this later, it could be useful to have some formal discussion, to make sure that we share consistent terminology. Right now, I doubt many people care about it.\n\n## Conclusion\n\nOver time, I expect higher-order forecasts to go from a niche idea to a key component of mature forecasting systems. Just as financial markets would be far less efficient without derivatives, forecasting platforms could see substantial accuracy and liquidity gains from higher-order forecasts.",
  "reviews": []
}
