{
  "id": "policy-advocacy-for-eradicating-screwworm-looks-remarkably-cost-effective-ea-forum",
  "slug": "policy-advocacy-for-eradicating-screwworm-looks-remarkably-cost-effective-ea-forum",
  "title": "Policy advocacy for eradicating screwworm looks remarkably cost-effective — EA Forum",
  "author": "Unknown Author",
  "publishedDate": "2025-04-15",
  "intendedAgents": [
    "bias-detector",
    "clarity-coach",
    "research-scholar"
  ],
  "content": "The New World Screwworm causes tremendous suffering to wild and domestic animals on the South American continent. Gene drives make it possible to eradicate the screwworm and improve the wellbeing of hundreds of millions to billions of wild animals.\n\nI believe political advocacy to coordinate South American countries to use gene drives to eradicate the screwworm looks very tractable and highly impactful in expectation.\n\nIn this post I will go over:\n\n1.  Why I believe this to be the case\n2.  What the intervention would look like\n3.  Beg and plead for someone to go do this\n\n# Holy shit, Gene drives\n\nLike many on this forum, I listened to 80k’s podcast episode with Kevin Esvelt, where they discussed using gene drives to eradicate diseases and thought to myself: “holy shit that’s incredible, we should do something” to promptly forget all about it and move on with my life.\n\nHalf a year later, when [Works In Progress](https://worksinprogress.co/) asked me if there was anything I wanted to write about, gene drives popped into my mind. As I started researching for the article, I became increasingly obsessed. Those misfortunate enough to have been around me during this period, have had to endure many long monologues about gene drives.\n\nThroughout my frenzy, I met with Professors, PhDs, and representatives from organisations working on gene drives to eradicate malaria. I’ve now come to the following two conclusions:\n\n1.  Society, at large, should be using gene drives for vector control of endemic diseases such as Malaria. The risks are minute, and the benefits are huge.\n2.  **Political advocacy for using gene drives to eradicate screwworm in South America, looks incredibly impactful and very tractable.**\n\nMy article for the magazine (out soon!) is focused on the first point. This forum post is focused on the second.\n\n# What is the New World Screwworm?\n\nThe  C. hominivorax, or New World Screwworm, is a blowfly, which lays its eggs in the wounds (and other openings, such as the nostrils or ears) of mammals. After hatching, the larvae dig in and begin eating the host alive. The stench left off by the infested wound attracts yet more screwworm flies to lay their eggs. Untreated, 20-80% of animals infected die from the infestation or infections that follow.[\\[1\\]](#fn4i58gv52zfm)\n\nHumans, being mammals, are at risk too. Uruguay alone records hundreds of human cases every year.[\\[2\\]](#fno0tyi89nngh)\n\nAs one can imagine, being eaten alive by parasites is not much fun. As the scientific literature puts it: “Animals with myiasis may display signs of discomfort, lethargy, weight loss and depression”[\\[3\\]](#fnqv00j82g0wb)\n\nTo put it as politely: Based on the pictures I have seen, I too would display signs of discomfort if it were me who was infected.\n\nIn addition to infecting hundreds of millions of wild mammals, the New World screwworm costs the livestock industry hundreds of millions of dollars every year. To prevent the loss of livestock, North America eradicated the screwworm already in 1960 using the more primitive sterile insect technique.\n\nTo prevent the screwworm from migrating back into North America, they additionally worked with Middle American governments to eradicate it there as well, and to this very day they maintain a wall of sterile screwworm in Panama to prevent screwworm from migrating back north.\n\nSince then eradication progress has stalled as the sterile insect technique has proven difficult and expensive to use on the South American continent, where the screwworm is endemic on the majority of the continent.\n\nA survey found that 76% of Uruguayan farmers go as far as to plan yearly animal management around avoiding the screwworm season, to avoid loss of livestock.\n\nIn Uruguay alone, farmers lose between 40 to 150 million USD annually[\\[4\\]](#fnxzwh6v6axdn) (0.14% of the country’s GDP) to screwworm. There is enormous economic interest in seeing it eradicated.\n\nIn 2024 Uruguay’s National Institute for Agricultural Research received a $450,000 grant to develop a gene drive for screwworm. Even without the gene drive, Uruguay is interested in using the sterile insect technique to eradicate it within Uruguay, which will require continuously keeping up a costly artificial border of sterile flies insects surrounding the entire country.\n\n# What is a gene drive?\n\nIn short, the CRISPR/Cas9 Gene drive makes it possible to make a gene edit to an animal that is passed on to every one of its descendants, who in turn pass it on to everyone of theirs. By installing a gene drive into a single animal, over the next generations the gene edit will spread until the entire species has it.\n\nThis makes it a rather powerful technology. One way the technology can be used for good, is by driving a gene into an undesirable species which makes the females infertile, causing the population to collapse.\n\nBy using gene drives it becomes feasible to eradicate screwworm in South America.\n\nThe primary risk[\\[5\\]](#fnjki379rojt) from releasing any gene drive for population suppression is how the elimination of the subspecies will affect the surrounding ecology, for example by reducing the food available to predators.\n\nFortunately that experiment has already been run in North and Central America when they eradicated screwworm decades ago. The environmental impacts were minimal to none. With the reduced need for pesticides, one could even argue the environmental impact was positive.\n\nThis hasn’t prevented environmental organisations such as Greenpeace, who are against gene editing of any kind, from lobbying for a global moratorium (ban) on the use of gene drives. The UN voted down this proposal, and gene drives currently exist in somewhat of a legal grey area, where the decision to release any gene drive ultimately rests on individual countries rather than international agreements[\\[6\\]](#fn4kp3tuf0w4n).\n\n# The intervention: Political advocacy for governments to release a gene drive\n\nThe campaign will likely consist of the following steps:\n\n*   Putting together the coalition supporting a gene drive release.\n*   Doing the necessary advocacy to get buy-in from key countries across South America.\n*   Playing a coordinating role to connect agencies and get the eradication effort started.\n\nThe livestock industry makes up a large part of the economy of many South American countries. As a result, the agricultural lobby is incredibly influential and well connected.\n\nWhy is a country such as Uruguay looking to spend so much money on the sterile insect technique to eradicate screwworm in the first place? Hint, it’s not out of concern for the wellbeing of wild animals.\n\nSmall scale farmers and industrial factory farmers alike stand to save millions of dollars from the eradication of screwworm.\n\nAn effective campaign should put together a coalition of agricultural interest groups and utilise their existing networks and connections to key decision makers. Agricultural departments across countries have a shared interest in seeing it eradicated. Rather than a gene drive release being a national Uruguayan effort, the campaign would work to get other countries to join in and support the effort.\n\nExecuted well, I can envision the announcement of a joint programme to eradicate screwworm between several South American countries (perhaps with funding and help from the USDA) by 2030.\n\n# The cost-effectiveness of eradicating screwworm\n\nThe following sections describe the intuitions behind my cost-effectiveness analysis, feel free to just [view it directly](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) and plug in your own numbers.\n\n## How many wild animals would it help, and how much?\n\nEradicating screwworm would save the South American livestock industry hundreds of millions, but between you and me, helping this industry is not what excites me.\n\nThe real benefit is to the hundreds of millions of wild mammals in South America, of which I estimate 0.1-4% are infected with screwworm every year.[\\[7\\]](#fn8au87eajce4) A [back of the envelope](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests there are around 89.2 billion wild mammals (plus minus one order of magnitude) on the South American continent. This suggests hundreds of millions or even a few billion animals are infected every year.\n\nSaving them from a painful infection or even death is very motivating to me!\n\nCalculating the welfare improvement for any wild animal welfare intervention is notoriously difficult. If the animals whose lives we save were to later die from something even more painful, we might have done more harm than good. What will be the mammal’s cause of death, if not screwworm?\n\nEyeballing the [estimates from Wild Animal Initiative](https://www.wildanimalinitiative.org/blog/cause-of-death-3), I would very roughly say that ~45% of wild mammals die from predation, ~10% from disease, starvation and injuries, ~30% from humans, and 15% from other sources.\n\nMany sources describe screwworm infection as extremely painful, but tracing back the sources I wasn’t able to find any clear root claims. The medical case reports of humans I found did not use many adjectives to describe patients' pain, nor was I able to find any mentions of morphine or other similar strong painkillers being administered for the pain. I imagine a doctor who treats patients with myiasis would have a good sense, but I didn’t have one in my network to ask.\n\nMy best guess is that for lethal infections the pain is as bad as that of a severely infected wound, seeing as the causal mechanism of death often is a severe infection following the infestation.\n\nIntuitively it seems worse. If you google: “Screwworm infestation human” you will find upsetting images **(please don’t do this unless you’re sure you can stomach it)**, which gives some idea.\n\nI would personally prefer to be predated, run over by a car, or die from malaria, than I would want to die from a screwworm infection. Having not experienced any of these things, I accept my intuitions may be off, but I don’t know what else to go by. Good chance I’m over indexing on the ‘yuck’ factor of it all.\n\nUsing what I think are conservative assumptions, [my CEA](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests that eradicating screwworm would constitute a significant improvement to wild animal welfare, with each dollar spent averting suffering equivalent to that of 101 animals dying from screwworm.\n\nThe 'gold standard' in animal welfare Corporate Campaigns are estimated to halve the suffering for 66 years of chicken life per dollar spent. These numbers are not directly comparable, but to me screwworm advocacy looks to be in a similar ballpark as the very best animal welfare interventions.\n\n## Are gene drives an effective solution?\n\nUnlike the sterile insect technique, which will require weekly releases of millions of screwworms to work, a dozen gene driven screwworms can spread a gene edit far and wide.\n\nReleasing a gene drive in Uruguay would likely result in a temporary substantial reduction in the screwworm population of Uruguay and its neighbours, until screwworms which by chance develop immunity repopulate back. At this point a second gene drive release will be necessary. Rinse and repeat, until the population is extinct.\n\nWhile the new world screwworm is a single species, it has high genetic diversity across regions. Across the South American continent one can structure the fly into four regional groups of populations, with significant genetic variance. A gene drive released in one region might not spread to the other regions. For lasting and continent wide eradication, I suspect it will be necessary to release gene drives for screwworms in each of these regions.\n\nThis is well within what a team of motivated scientists can pull off. Gene drives are likely to be much cheaper, much more effective, and much better for the environment than any other population suppression technique.\n\n## What are the costs?\n\nCreating and releasing gene driven screwworms is not by itself too expensive. The R&D costs of developing working gene drives for screwworm will be within the single digit millions at the very highest.\n\nAdding in expenses relating to the test and release, such as environmental reviews and monitoring we get into the tens of millions at most. Most of these costs will be incurred by governments whose counterfactual looks different from that of the EA donor.\n\nThe political advocacy itself will perhaps cost a few million dollars, it might even be possible to get the livestock industry to pay for some of it.\n\nThe total costs will be in the tens of millions, and only a fraction of that has to come from high counterfactual philanthropic sources. Even without counting welfare benefits, the ROI for governments is positive.\n\n## How likely is political advocacy to succeed?\n\nThe existing financial interests in seeing screwworm eradicated makes me believe a campaign is much more likely to succeed than it otherwise would be. When you come across an animal welfare intervention that factory farmers are as excited about as you, you should act!\n\nThere are few arguments more persuasive to a policy maker than your country’s largest industry saying it would have a high ROI. The harrowing stories of people who have lost friends or relatives to the screwworm can make for effective messaging too.\n\nThe timing is also right. In 2024 Uruguay started considering using gene drives, so there is already momentum to latch onto.\n\nI’ve observed that successful EA policy campaigns often fight inertia rather than active and organised opponents. This is unfortunately not the case for this intervention. Environmentalist groups will push back to stop the use of gene drives. I suspect the livestock lobby is the more powerful voice, but who knows.\n\nI believe the most likely outcome is that South America will eventually use gene drives or sterile insect releases to eradicate screwworm anyway, but a coordinated campaign can speed this up by several years.\n\nThe ideal founders to pull off this campaign would have familiarity with South American policy and politics. Fluency in Spanish and Portuguese is likely necessary as well.\n\n# A call to action\n\nI am not a wild animal welfare researcher and I hope it’s abundantly clear this intervention would benefit from further investigation by someone with domain expertise.\n\nMy own estimates suggests policy advocacy to eradicate screwworm to be competitive with the most cost-effective animal welfare interventions.\n\nI am not from South America, I am not well-positioned to work on this, **but somebody really should do something**. There’s lots to do. One could reach out to the Uruguayan researchers to better understand their bottlenecks. Is it funding? If so, how much? One could speak with the livestock industry to gauge their interest. Would they join a coalition and/or pay for the campaign?\n\nI believe a  group of motivated volunteers could get quite far. **If you are interested in continuing work on any of this do reach out.** The best person to work on this was someone more qualified five years ago, the second best is you today.\n\n_Cochliomyia hominivorax delenda est_\n\n1.  **[^](#fnref4i58gv52zfm)**\n    \n     https://www.iaea.org/sites/default/files/32406483541.pdf\n    \n2.  **[^](#fnrefo0tyi89nngh)**\n    \n     https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7789611/\n    \n3.  **[^](#fnrefqv00j82g0wb)**\n    \n     https://www.aphis.usda.gov/sites/default/files/screwworm-environmental-assessment.pdf\n    \n4.  **[^](#fnrefxzwh6v6axdn)**\n    \n     http://www.scielo.edu.uy/scielo.php?script=sci\\_arttext&pid=S2730-50662021000301401\n    \n5.  **[^](#fnrefjki379rojt)**\n    \n    Some also worry about the gene drive spreading to other Cochliomyia species, which is a genuine concern but not something that worries me that much.\n    \n    In theory it could happen through one of two ways:\n    \n    \\- Hybridization (successful cross-breeding between the species)  \n    \\- Horizontal spread (gene drive transferred without reproduction, for example through a virus)\n    \n    For screwworm I haven't been able to find any source claiming screwworm species can hybridize (unlike between subspecies of eg. anopheles gambiae mosquitoes where it regularly happens). This is in line with what I would expect, as hybridization between species is the exception not the rule. But one could cheaply run a lab experiment to verify they don't hybridize. If nobody has done this already, that would be wise to do.\n    \n    Horizontal gene flow is impossible to rule out completely, but the likelihood of this occurring is pretty much zero. The risk of the gene spreading can also be addressed by building the gene drive to target a section of the genome unique to C. hominivorax.\n    \n    Additionally one can run a no-payload daisy chain drive test first (more on that in my magazine article) to verify the drive works as intended and doesn't spread, before releasing a full suppression drive.\n    \n6.  **[^](#fnref4kp3tuf0w4n)**\n    \n     Countries which have signed the cartagena protocol have some obligations to their neighbour countries.\n    \n7.  **[^](#fnref8au87eajce4)**\n    \n     Before the eradication in north America an estimated 2-3% of wild animals in endemic regions were infested: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7789611/#:~:text=Prior%20to%20eradication%20the%20USA,eradication%20%5B17%2C%2018%5D.",
  "reviews": [
    {
      "agentId": "bias-detector",
      "costInCents": 9094,
      "createdAt": "2025-04-15T22:14:35.599Z",
      "runDetails": "{\"model\":\"anthropic/claude-3.7-sonnet\",\"promptTokens\":6063,\"completionTokens\":3031,\"totalTokens\":9094,\"temperature\":0.7,\"runtimeMs\":58891}",
      "summary": "This document advocates for using gene drives to eradicate the New World Screwworm in South America, presenting a case that combines economic benefits with significant wild animal welfare improvements. The analysis shows strong bias toward intervention, with several forms of bias evident throughout. The author demonstrates confirmation bias by selectively emphasizing benefits while minimizing potential ecological risks. There's also emotional appeal bias through vivid descriptions of animal suffering and enthusiastic language (\"holy shit that's incredible\"). The document contains availability bias in relying heavily on Uruguayan data and extrapolating continent-wide, and status quo bias in assuming current ecological conditions would remain stable post-eradication. The quantitative estimates contain optimism bias, with wide uncertainty ranges narrowed toward favorable outcomes. While the economic case is well-supported, the ecological impact assessment lacks sufficient counterarguments and expert perspectives from environmental science and ecology. Overall, the document presents a compelling but imbalanced case that would benefit from more rigorous exploration of potential downsides, ecological complexity, and diverse stakeholder perspectives.",
      "comments": [
        {
          "title": "Confirmation Bias in Risk Assessment",
          "description": "The document shows confirmation bias by downplaying potential ecological risks while emphasizing benefits. The author dismisses environmental concerns by stating impacts in North/Central America were \"minimal to none\" without providing supporting evidence or considering potential differences in South American ecosystems. A more balanced assessment would include detailed ecological analysis and acknowledge the possibility of unforeseen consequences in different ecosystems.",
          "highlight": {
            "startOffset": 4980,
            "endOffset": 5369,
            "quotedText": "elimination of the subspecies will affect the surrounding ecology, for example by reducing the food available to predators.\n\nFortunately that experiment has already been run in North and Central America when they eradicated screwworm decades ago. The environmental impacts were minimal to none. With the reduced need for pesticides, one could even argue the environmental impact was positive.",
            "prefix": "The primary risk[\\[5\\]](#fnjki379rojt) from releasing any gene drive for population suppression is how the "
          }
        },
        {
          "title": "Optimism Bias in Quantitative Estimates",
          "description": "The document demonstrates optimism bias in its quantitative estimates. The author acknowledges uncertainty with wide ranges (\"89.2 billion wild mammals (plus minus one order of magnitude)\") but then narrows to favorable outcomes when calculating cost-effectiveness. The claim that \"each dollar spent averting suffering equivalent to that of 101 animals dying from screwworm\" presents a specific number despite enormous underlying uncertainty in the estimates.",
          "highlight": {
            "startOffset": 7909,
            "endOffset": 8093,
            "quotedText": "89.2 billion wild mammals (plus minus one order of magnitude) on the South American continent. This suggests hundreds of millions or even a few billion animals are infected every year.",
            "prefix": "The real benefit is to the hundreds of millions of wild mammals in South America, of which I estimate 0.1-4% are infected with screwworm every year.[\\[7\\]](#fn8au87eajce4) A [back of the envelope](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests there are around "
          }
        }
      ]
    },
    {
      "agentId": "clarity-coach",
      "costInCents": 9185,
      "createdAt": "2025-04-15T22:15:25.810Z",
      "runDetails": "{\"model\":\"anthropic/claude-3.7-sonnet\",\"promptTokens\":6693,\"completionTokens\":2492,\"totalTokens\":9185,\"temperature\":0.7,\"runtimeMs\":50170}",
      "summary": "This document presents a compelling case for using gene drives to eradicate the New World Screwworm in South America. The author argues this intervention would alleviate tremendous suffering for hundreds of millions to billions of wild mammals while also benefiting livestock industries. The writing effectively balances technical information with accessible explanations, providing clear structure through section headings and logical progression of ideas. The content demonstrates strong coherence by methodically addressing what screwworm is, how gene drives work, the proposed intervention, cost-effectiveness analysis, and implementation considerations. The author effectively uses data points and references to support claims while maintaining an engaging tone. Areas for improvement include reducing some sentence complexity, providing clearer transitions between certain sections, and further unpacking technical terminology for non-specialist readers. The document successfully conveys urgency and actionability while maintaining scientific credibility, making a persuasive case for this wild animal welfare intervention that aligns economic interests with ethical considerations.",
      "comments": [
        {
          "title": "Effective Use of Narrative Hook",
          "description": "The opening paragraph effectively captures attention by presenting the problem (animal suffering), the solution (gene drives), and the potential impact (helping billions of animals). This clear framing immediately establishes the stakes and significance of the topic, drawing readers in with a concise and compelling introduction.",
          "highlight": {
            "startOffset": 0,
            "endOffset": 247,
            "quotedText": "The New World Screwworm causes tremendous suffering to wild and domestic animals on the South American continent. Gene drives make it possible to eradicate the screwworm and improve the wellbeing of hundreds of millions to billions of wild animals.",
            "prefix": ""
          }
        },
        {
          "title": "Clear Technical Explanation",
          "description": "This explanation of gene drives effectively distills a complex scientific concept into accessible language without oversimplification. The author uses straightforward sentences and builds logically from the mechanism to the application, making the technical content approachable for non-specialists while maintaining accuracy.",
          "highlight": {
            "startOffset": 4288,
            "endOffset": 4582,
            "quotedText": "Gene drive makes it possible to make a gene edit to an animal that is passed on to every one of its descendants, who in turn pass it on to everyone of theirs. By installing a gene drive into a single animal, over the next generations the gene edit will spread until the entire species has it.",
            "prefix": "# What is a gene drive?\n\nIn short, the CRISPR/Cas9 "
          }
        },
        {
          "title": "Excessive Sentence Length",
          "description": "This sentence contains multiple ideas and clauses that could be separated for improved readability. Breaking it into 2-3 shorter sentences would help readers process each component more easily. Consider: \"An effective campaign should put together a coalition of agricultural interest groups. It would then utilize their existing networks and connections to key decision makers. Agricultural departments across countries share an interest in seeing screwworm eradicated.\"",
          "highlight": {
            "startOffset": 6623,
            "endOffset": 6932,
            "quotedText": "ave millions of dollars from the eradication of screwworm.\n\nAn effective campaign should put together a coalition of agricultural interest groups and utilise their existing networks and connections to key decision makers. Agricultural departments across countries have a shared interest in seeing it eradicated.",
            "prefix": "Small scale farmers and industrial factory farmers alike stand to s"
          }
        },
        {
          "title": "Effective Use of Subheadings",
          "description": "The document employs clear, informative subheadings that effectively organize content and guide readers through the logical progression of the argument. These subheadings function as signposts that help readers anticipate what's coming next and understand how each section contributes to the overall case. This structural clarity significantly enhances readability, particularly for a complex topic with multiple aspects to consider.",
          "highlight": {
            "startOffset": 7388,
            "endOffset": 7523,
            "quotedText": "ctiveness analysis, feel free to just [view it directly](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) and plug in your own numbers.\n\n## How many wild animals would it help, and how much?",
            "prefix": "The following sections describe the intuitions behind my cost-effe"
          }
        },
        {
          "title": "Memorable Conclusion with Call to Action",
          "description": "The conclusion effectively combines urgency, actionability, and memorability. The Latin phrase adds a distinctive flourish while the direct call for volunteers creates a clear next step for engaged readers. This ending transforms what could have remained an academic analysis into a catalyst for real-world change by explicitly inviting participation and emphasizing that imperfect action now is better than waiting for perfect conditions.",
          "highlight": {
            "startOffset": 14621,
            "endOffset": 14835,
            "quotedText": "If you are interested in continuing work on any of this do reach out.** The best person to work on this was someone more qualified five years ago, the second best is you today.\n\n_Cochliomyia hominivorax delenda est_",
            "prefix": "I believe a  group of motivated volunteers could get quite far. **"
          }
        },
        {
          "title": "Jargon Requiring Further Explanation",
          "description": "The term \"daisy chain drive\" is introduced without sufficient explanation. For readers unfamiliar with gene drive technology, this technical term creates a comprehension barrier. Consider adding a brief parenthetical definition (e.g., \"a self-limiting gene drive design that prevents indefinite spread\") to maintain clarity for non-specialist readers while keeping the document accessible.",
          "highlight": {
            "startOffset": 16220,
            "endOffset": 16386,
            "quotedText": "daisy chain drive test first (more on that in my magazine article) to verify the drive works as intended and doesn't spread, before releasing a full suppression drive.",
            "prefix": "Additionally one can run a no-payload "
          }
        }
      ]
    },
    {
      "agentId": "research-scholar",
      "costInCents": 10196,
      "createdAt": "2025-04-15T22:16:42.403Z",
      "runDetails": "{\"model\":\"anthropic/claude-3.7-sonnet\",\"promptTokens\":6864,\"completionTokens\":3332,\"totalTokens\":10196,\"temperature\":0.7,\"runtimeMs\":71301}",
      "summary": "This post explores the potential of gene drives to eradicate the New World Screwworm (Cochliomyia hominivorax) in South America as a high-impact animal welfare intervention. The screwworm causes immense suffering to wild and domestic mammals by laying eggs in wounds, where hatched larvae literally eat the host alive, affecting hundreds of millions to billions of wild animals annually. The author argues that political advocacy to coordinate South American countries for a gene drive eradication program is both highly tractable and impactful, with several factors in its favor: 1) the economic incentive is strong (Uruguay alone loses 0.14% of GDP to screwworm), 2) the technology is feasible (unlike traditional sterile insect techniques), 3) environmental risks are low (based on previous North American eradication), and 4) cost-effectiveness analysis suggests each dollar spent could avert suffering equivalent to 101 animals dying from screwworm—comparable to the best animal welfare interventions. The post concludes with a call to action for individuals with South American policy expertise and language skills to advance this intervention, which could significantly improve wild animal welfare across the continent.",
      "comments": [
        {
          "title": "Gene Drives Technology Explanation",
          "description": "The author provides a concise explanation of CRISPR/Cas9 gene drives, which represents a significant advancement over previous population control technologies. This technology allows genetic modifications to spread through an entire population over generations, eventually affecting the entire species. For context, traditional sterile insect technique (SIT) requires continuous releases of millions of sterilized insects, while gene drives could theoretically achieve population suppression with just a few modified organisms. The efficiency difference is orders of magnitude. This relates to Kevin Esvelt's work at MIT, who pioneered CRISPR gene drives and has advocated for their careful application to disease vectors. The technology's power comes with responsibility concerns, which is why Esvelt has also been a leading voice in governance frameworks for gene drive research and deployment.",
          "highlight": {
            "startOffset": 4294,
            "endOffset": 4577,
            "quotedText": "makes it possible to make a gene edit to an animal that is passed on to every one of its descendants, who in turn pass it on to everyone of theirs. By installing a gene drive into a single animal, over the next generations the gene edit will spread until the entire species has it.",
            "prefix": "# What is a gene drive?\n\nIn short, the CRISPR/Cas9 Gene drive "
          }
        },
        {
          "title": "Ecological Risk Assessment",
          "description": "The author addresses a critical concern with gene drives—ecological consequences of species elimination—by referencing the natural experiment that occurred when screwworm was eradicated from North and Central America. This is an important point in the risk assessment framework for gene drives. The Target Malaria project and other gene drive initiatives have identified ecological impact as one of the primary concerns requiring thorough evaluation before deployment. The fact that screwworm eradication has already been tested at scale provides valuable empirical evidence that reduces uncertainty about ecosystem effects. This aligns with the concept of \"differential technological development\" in EA literature, where technologies with more evidence and lower risk profiles should be prioritized for development and deployment.",
          "highlight": {
            "startOffset": 4967,
            "endOffset": 5364,
            "quotedText": "how the elimination of the subspecies will affect the surrounding ecology, for example by reducing the food available to predators.\n\nFortunately that experiment has already been run in North and Central America when they eradicated screwworm decades ago. The environmental impacts were minimal to none. With the reduced need for pesticides, one could even argue the environmental impact was positive.",
            "prefix": " be used for good, is by driving a gene into an undesirable species which makes the females infertile, causing the population to collapse.\n\nBy using gene drives it becomes feasible to eradicate screwworm in South America.\n\nThe primary risk[\\[5\\]](#fnjki379rojt) from releasing any gene drive for population suppression is "
          }
        },
        {
          "title": "International Governance Challenges",
          "description": "The author highlights the complex international governance landscape for gene drive technologies, noting opposition from environmental organizations like Greenpeace and the current regulatory gray area. This reflects broader tensions in global governance of emerging biotechnologies. The UN Convention on Biological Diversity (CBD) has been the primary forum for international discussions on gene drives, with some nations and NGOs advocating for strict precautionary approaches while others favor innovation-friendly frameworks. The absence of clear international consensus means that regional coordination becomes critical for deployment, making the political advocacy approach suggested by the author particularly relevant. This governance challenge connects to broader EA discussions about differential technological development and international coordination for emerging technologies with global implications.",
          "highlight": {
            "startOffset": 5494,
            "endOffset": 5791,
            "quotedText": "a global moratorium (ban) on the use of gene drives. The UN voted down this proposal, and gene drives currently exist in somewhat of a legal grey area, where the decision to release any gene drive ultimately rests on individual countries rather than international agreements[\\[6\\]](#fn4kp3tuf0w4n).",
            "prefix": "one could even argue the environmental impact was positive.\n\nThis hasn't prevented environmental organisations such as Greenpeace, who are against gene editing of any kind, from lobbying for "
          }
        },
        {
          "title": "Alignment of Economic and Welfare Interests",
          "description": "The author identifies a rare opportunity where economic interests (livestock industry) align with animal welfare outcomes. This alignment of incentives is particularly valuable in policy advocacy, as it creates natural allies with significant political influence. In EA terms, this represents a form of moral trade where different value systems can cooperate toward a shared goal despite different motivations. This type of intervention avoids the common challenge in animal welfare where economic interests typically oppose welfare improvements. The livestock industry's substantial political influence in South America provides leverage that pure animal welfare advocates would struggle to achieve independently. This exemplifies the concept of \"value alignment\" discussed in EA literature, where finding interventions that serve multiple value systems can dramatically increase tractability.",
          "highlight": {
            "startOffset": 6547,
            "endOffset": 6674,
            "quotedText": "Small scale farmers and industrial factory farmers alike stand to save millions of dollars from the eradication of screwworm.",
            "prefix": "The livestock industry makes up a large part of the economy of many South American countries. As a result, the agricultural lobby is incredibly influential and well connected.\n\nWhy is a country such as Uruguay looking to spend so much money on the sterile insect technique to eradicate screwworm in the first place? Hint, it's not out of concern for the wellbeing of wild animals.\n\n"
          }
        },
        {
          "title": "Wild Animal Welfare Scale",
          "description": "The author provides a rough quantification of the wild animal welfare impact, estimating hundreds of millions to billions of wild mammals affected annually. This scale calculation is crucial for prioritization within the wild animal welfare cause area. The uncertainty in these estimates (0.1-4% infection rate, 89.2 billion mammals ±1 order of magnitude) reflects the general challenge of quantifying wild animal welfare interventions. This relates to the broader EA discussion about moral weight of different animals and the challenge of comparing welfare across species. The author's attempt to quantify suffering averted per dollar places this intervention in the context of other animal welfare interventions, facilitating cross-cause comparisons despite acknowledged uncertainty. This connects to Brian Tomasik and Wild Animal Initiative's work on wild animal welfare quantification.",
          "highlight": {
            "startOffset": 7884,
            "endOffset": 8086,
            "quotedText": "there are around 89.2 billion wild mammals (plus minus one order of magnitude) on the South American continent. This suggests hundreds of millions or even a few billion animals are infected every year.",
            "prefix": "The real benefit is to the hundreds of millions of wild mammals in South America, of which I estimate 0.1-4% are infected with screwworm every year.[\\[7\\]](#fn8au87eajce4) A [back of the envelope](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests "
          }
        },
        {
          "title": "Welfare Improvement Uncertainty",
          "description": "The author acknowledges the fundamental challenge in wild animal welfare interventions: determining whether preventing one cause of death actually improves welfare when alternative causes of death may be equally or more painful. This reflects the complex welfare calculus required in wild animal interventions. The comparison to Wild Animal Initiative's cause of death estimates demonstrates an attempt to contextualize the intervention within broader population dynamics. The author's candid admission about the difficulty of assessing pain levels and potential bias from the \"yuck factor\" shows appropriate epistemic humility. This connects to philosophical discussions in EA about welfare biology, comparative suffering, and the challenge of welfare accounting across different types of experiences. This type of analysis is central to Brian Tomasik's work on wild animal suffering and Oscar Horta's research on r-selection species.",
          "highlight": {
            "startOffset": 8269,
            "endOffset": 8452,
            "quotedText": "If the animals whose lives we save were to later die from something even more painful, we might have done more harm than good. What will be the mammal's cause of death, if not screwworm?",
            "prefix": "Saving them from a painful infection or even death is very motivating to me!\n\nCalculating the welfare improvement for any wild animal welfare intervention is notoriously difficult. "
          }
        },
        {
          "title": "Cost-Effectiveness Analysis Methodology",
          "description": "The author presents a cost-effectiveness analysis that attempts to quantify the intervention's impact in terms of suffering averted per dollar. This analysis framework is characteristic of EA prioritization methodology. The comparison to established animal welfare interventions (corporate campaigns for chickens) provides a reference point for cross-intervention comparison. The author's transparency about assumptions and uncertainty allows others to adjust estimates based on different values or information. The calculation of \"suffering equivalent to 101 animals dying from screwworm\" per dollar demonstrates an attempt to create a common metric for comparison across different types of interventions. This connects to GiveWell's approach to cost-effectiveness analysis and the broader EA discussion about quantifying moral value across different types of experiences and beneficiaries.",
          "highlight": {
            "startOffset": 10017,
            "endOffset": 10389,
            "quotedText": "averting suffering equivalent to that of 101 animals dying from screwworm.\n\nThe 'gold standard' in animal welfare Corporate Campaigns are estimated to halve the suffering for 66 years of chicken life per dollar spent. These numbers are not directly comparable, but to me screwworm advocacy looks to be in a similar ballpark as the very best animal welfare interventions.",
            "prefix": "Using what I think are conservative assumptions, [my CEA](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests that eradicating screwworm would constitute a significant improvement to wild animal welfare, with each dollar spent "
          }
        },
        {
          "title": "Genetic Diversity Challenge",
          "description": "The author identifies a key technical challenge: the genetic diversity of screwworm populations across South America may require multiple gene drive releases targeting different regional populations. This reflects the biological complexity of species eradication at continental scale. The identification of four regional genetic groups demonstrates the author's research depth into the biological aspects of the intervention. This challenge connects to broader discussions in conservation genetics and population biology about genetic diversity and gene flow between populations. Understanding these dynamics is crucial for effective gene drive deployment. This relates to Kevin Esvelt's work on gene drive design and the importance of accounting for genetic diversity and resistance evolution in target populations. The author's acknowledgment of this complexity shows appropriate technical nuance in the proposal.",
          "highlight": {
            "startOffset": 10934,
            "endOffset": 11382,
            "quotedText": "While the new world screwworm is a single species, it has high genetic diversity across regions. Across the South American continent one can structure the fly into four regional groups of populations, with significant genetic variance. A gene drive released in one region might not spread to the other regions. For lasting and continent wide eradication, I suspect it will be necessary to release gene drives for screwworms in each of these regions.",
            "prefix": "Releasing a gene drive in Uruguay would likely result in a temporary substantial reduction in the screwworm population of Uruguay and its neighbours, until screwworms which by chance develop immunity repopulate back. At this point a second gene drive release will be necessary. Rinse and repeat, until the population is extinct.\n\n"
          }
        },
        {
          "title": "Opposition from Environmental Groups",
          "description": "The author identifies a key political challenge: opposition from environmental organizations that categorically oppose gene editing technologies. This represents a common pattern in biotechnology governance where precautionary principles clash with consequentialist frameworks. Environmental NGOs like Greenpeace have historically opposed genetic modification technologies broadly, often based on deontological rather than consequentialist reasoning. This opposition creates a political hurdle that must be factored into advocacy strategy. The author's assessment that agricultural interests likely outweigh environmental opposition in South America represents a strategic calculation about political power dynamics. This connects to broader EA discussions about values pluralism in policy advocacy and navigating ideological opposition to technological solutions. Understanding these dynamics is crucial for developing effective advocacy strategies in contested policy domains.",
          "highlight": {
            "startOffset": 13312,
            "endOffset": 13453,
            "quotedText": "Environmentalist groups will push back to stop the use of gene drives. I suspect the livestock lobby is the more powerful voice, but who knows.",
            "prefix": "The timing is also right. In 2024 Uruguay started considering using gene drives, so there is already momentum to latch onto.\n\nI've observed that successful EA policy campaigns often fight inertia rather than active and organised opponents. This is unfortunately not the case for this intervention. "
          }
        }
      ]
    }
  ]
}