{
  "id": "policy-advocacy-for-eradicating-screwworm-looks-remarkably-cost-effective-ea-forum",
  "slug": "policy-advocacy-for-eradicating-screwworm-looks-remarkably-cost-effective-ea-forum",
  "title": "Policy advocacy for eradicating screwworm looks remarkably cost-effective",
  "author": "Ozzie Gooen",
  "publishedDate": "2025-04-17",
  "url": "https://forum.effectivealtruism.org/posts/policy-advocacy-for-eradicating-screwworm-looks-remarkably-cost-effective",
  "platforms": ["EA Forum"],
  "intendedAgents": [
    "clarity-coach",
    "research-scholar",
    "quantitative-forecaster",
    "ea-impact-evaluator",
    "bias-detector"
  ],
  "content": "The New World Screwworm causes tremendous suffering to wild and domestic animals on the South American continent. Gene drives make it possible to eradicate the screwworm and improve the wellbeing of hundreds of millions to billions of wild animals.\n\nI believe political advocacy to coordinate South American countries to use gene drives to eradicate the screwworm looks very tractable and highly impactful in expectation.\n\nIn this post I will go over:\n\n1.  Why I believe this to be the case\n2.  What the intervention would look like\n3.  Beg and plead for someone to go do this\n\n# Holy shit, Gene drives\n\nLike many on this forum, I listened to 80k’s podcast episode with Kevin Esvelt, where they discussed using gene drives to eradicate diseases and thought to myself: “holy shit that’s incredible, we should do something” to promptly forget all about it and move on with my life.\n\nHalf a year later, when [Works In Progress](https://worksinprogress.co/) asked me if there was anything I wanted to write about, gene drives popped into my mind. As I started researching for the article, I became increasingly obsessed. Those misfortunate enough to have been around me during this period, have had to endure many long monologues about gene drives.\n\nThroughout my frenzy, I met with Professors, PhDs, and representatives from organisations working on gene drives to eradicate malaria. I’ve now come to the following two conclusions:\n\n1.  Society, at large, should be using gene drives for vector control of endemic diseases such as Malaria. The risks are minute, and the benefits are huge.\n2.  **Political advocacy for using gene drives to eradicate screwworm in South America, looks incredibly impactful and very tractable.**\n\nMy article for the magazine (out soon!) is focused on the first point. This forum post is focused on the second.\n\n# What is the New World Screwworm?\n\nThe  C. hominivorax, or New World Screwworm, is a blowfly, which lays its eggs in the wounds (and other openings, such as the nostrils or ears) of mammals. After hatching, the larvae dig in and begin eating the host alive. The stench left off by the infested wound attracts yet more screwworm flies to lay their eggs. Untreated, 20-80% of animals infected die from the infestation or infections that follow.[\\[1\\]](#fn4i58gv52zfm)\n\nHumans, being mammals, are at risk too. Uruguay alone records hundreds of human cases every year.[\\[2\\]](#fno0tyi89nngh)\n\nAs one can imagine, being eaten alive by parasites is not much fun. As the scientific literature puts it: “Animals with myiasis may display signs of discomfort, lethargy, weight loss and depression”[\\[3\\]](#fnqv00j82g0wb)\n\nTo put it as politely: Based on the pictures I have seen, I too would display signs of discomfort if it were me who was infected.\n\nIn addition to infecting hundreds of millions of wild mammals, the New World screwworm costs the livestock industry hundreds of millions of dollars every year. To prevent the loss of livestock, North America eradicated the screwworm already in 1960 using the more primitive sterile insect technique.\n\nTo prevent the screwworm from migrating back into North America, they additionally worked with Middle American governments to eradicate it there as well, and to this very day they maintain a wall of sterile screwworm in Panama to prevent screwworm from migrating back north.\n\nSince then eradication progress has stalled as the sterile insect technique has proven difficult and expensive to use on the South American continent, where the screwworm is endemic on the majority of the continent.\n\nA survey found that 76% of Uruguayan farmers go as far as to plan yearly animal management around avoiding the screwworm season, to avoid loss of livestock.\n\nIn Uruguay alone, farmers lose between 40 to 150 million USD annually[\\[4\\]](#fnxzwh6v6axdn) (0.14% of the country’s GDP) to screwworm. There is enormous economic interest in seeing it eradicated.\n\nIn 2024 Uruguay’s National Institute for Agricultural Research received a $450,000 grant to develop a gene drive for screwworm. Even without the gene drive, Uruguay is interested in using the sterile insect technique to eradicate it within Uruguay, which will require continuously keeping up a costly artificial border of sterile flies insects surrounding the entire country.\n\n# What is a gene drive?\n\nIn short, the CRISPR/Cas9 Gene drive makes it possible to make a gene edit to an animal that is passed on to every one of its descendants, who in turn pass it on to everyone of theirs. By installing a gene drive into a single animal, over the next generations the gene edit will spread until the entire species has it.\n\nThis makes it a rather powerful technology. One way the technology can be used for good, is by driving a gene into an undesirable species which makes the females infertile, causing the population to collapse.\n\nBy using gene drives it becomes feasible to eradicate screwworm in South America.\n\nThe primary risk[\\[5\\]](#fnjki379rojt) from releasing any gene drive for population suppression is how the elimination of the subspecies will affect the surrounding ecology, for example by reducing the food available to predators.\n\nFortunately that experiment has already been run in North and Central America when they eradicated screwworm decades ago. The environmental impacts were minimal to none. With the reduced need for pesticides, one could even argue the environmental impact was positive.\n\nThis hasn’t prevented environmental organisations such as Greenpeace, who are against gene editing of any kind, from lobbying for a global moratorium (ban) on the use of gene drives. The UN voted down this proposal, and gene drives currently exist in somewhat of a legal grey area, where the decision to release any gene drive ultimately rests on individual countries rather than international agreements[\\[6\\]](#fn4kp3tuf0w4n).\n\n# The intervention: Political advocacy for governments to release a gene drive\n\nThe campaign will likely consist of the following steps:\n\n*   Putting together the coalition supporting a gene drive release.\n*   Doing the necessary advocacy to get buy-in from key countries across South America.\n*   Playing a coordinating role to connect agencies and get the eradication effort started.\n\nThe livestock industry makes up a large part of the economy of many South American countries. As a result, the agricultural lobby is incredibly influential and well connected.\n\nWhy is a country such as Uruguay looking to spend so much money on the sterile insect technique to eradicate screwworm in the first place? Hint, it’s not out of concern for the wellbeing of wild animals.\n\nSmall scale farmers and industrial factory farmers alike stand to save millions of dollars from the eradication of screwworm.\n\nAn effective campaign should put together a coalition of agricultural interest groups and utilise their existing networks and connections to key decision makers. Agricultural departments across countries have a shared interest in seeing it eradicated. Rather than a gene drive release being a national Uruguayan effort, the campaign would work to get other countries to join in and support the effort.\n\nExecuted well, I can envision the announcement of a joint programme to eradicate screwworm between several South American countries (perhaps with funding and help from the USDA) by 2030.\n\n# The cost-effectiveness of eradicating screwworm\n\nThe following sections describe the intuitions behind my cost-effectiveness analysis, feel free to just [view it directly](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) and plug in your own numbers.\n\n## How many wild animals would it help, and how much?\n\nEradicating screwworm would save the South American livestock industry hundreds of millions, but between you and me, helping this industry is not what excites me.\n\nThe real benefit is to the hundreds of millions of wild mammals in South America, of which I estimate 0.1-4% are infected with screwworm every year.[\\[7\\]](#fn8au87eajce4) A [back of the envelope](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests there are around 89.2 billion wild mammals (plus minus one order of magnitude) on the South American continent. This suggests hundreds of millions or even a few billion animals are infected every year.\n\nSaving them from a painful infection or even death is very motivating to me!\n\nCalculating the welfare improvement for any wild animal welfare intervention is notoriously difficult. If the animals whose lives we save were to later die from something even more painful, we might have done more harm than good. What will be the mammal’s cause of death, if not screwworm?\n\nEyeballing the [estimates from Wild Animal Initiative](https://www.wildanimalinitiative.org/blog/cause-of-death-3), I would very roughly say that ~45% of wild mammals die from predation, ~10% from disease, starvation and injuries, ~30% from humans, and 15% from other sources.\n\nMany sources describe screwworm infection as extremely painful, but tracing back the sources I wasn’t able to find any clear root claims. The medical case reports of humans I found did not use many adjectives to describe patients' pain, nor was I able to find any mentions of morphine or other similar strong painkillers being administered for the pain. I imagine a doctor who treats patients with myiasis would have a good sense, but I didn’t have one in my network to ask.\n\nMy best guess is that for lethal infections the pain is as bad as that of a severely infected wound, seeing as the causal mechanism of death often is a severe infection following the infestation.\n\nIntuitively it seems worse. If you google: “Screwworm infestation human” you will find upsetting images **(please don’t do this unless you’re sure you can stomach it)**, which gives some idea.\n\nI would personally prefer to be predated, run over by a car, or die from malaria, than I would want to die from a screwworm infection. Having not experienced any of these things, I accept my intuitions may be off, but I don’t know what else to go by. Good chance I’m over indexing on the ‘yuck’ factor of it all.\n\nUsing what I think are conservative assumptions, [my CEA](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests that eradicating screwworm would constitute a significant improvement to wild animal welfare, with each dollar spent averting suffering equivalent to that of 101 animals dying from screwworm.\n\nThe 'gold standard' in animal welfare Corporate Campaigns are estimated to halve the suffering for 66 years of chicken life per dollar spent. These numbers are not directly comparable, but to me screwworm advocacy looks to be in a similar ballpark as the very best animal welfare interventions.\n\n## Are gene drives an effective solution?\n\nUnlike the sterile insect technique, which will require weekly releases of millions of screwworms to work, a dozen gene driven screwworms can spread a gene edit far and wide.\n\nReleasing a gene drive in Uruguay would likely result in a temporary substantial reduction in the screwworm population of Uruguay and its neighbours, until screwworms which by chance develop immunity repopulate back. At this point a second gene drive release will be necessary. Rinse and repeat, until the population is extinct.\n\nWhile the new world screwworm is a single species, it has high genetic diversity across regions. Across the South American continent one can structure the fly into four regional groups of populations, with significant genetic variance. A gene drive released in one region might not spread to the other regions. For lasting and continent wide eradication, I suspect it will be necessary to release gene drives for screwworms in each of these regions.\n\nThis is well within what a team of motivated scientists can pull off. Gene drives are likely to be much cheaper, much more effective, and much better for the environment than any other population suppression technique.\n\n## What are the costs?\n\nCreating and releasing gene driven screwworms is not by itself too expensive. The R&D costs of developing working gene drives for screwworm will be within the single digit millions at the very highest.\n\nAdding in expenses relating to the test and release, such as environmental reviews and monitoring we get into the tens of millions at most. Most of these costs will be incurred by governments whose counterfactual looks different from that of the EA donor.\n\nThe political advocacy itself will perhaps cost a few million dollars, it might even be possible to get the livestock industry to pay for some of it.\n\nThe total costs will be in the tens of millions, and only a fraction of that has to come from high counterfactual philanthropic sources. Even without counting welfare benefits, the ROI for governments is positive.\n\n## How likely is political advocacy to succeed?\n\nThe existing financial interests in seeing screwworm eradicated makes me believe a campaign is much more likely to succeed than it otherwise would be. When you come across an animal welfare intervention that factory farmers are as excited about as you, you should act!\n\nThere are few arguments more persuasive to a policy maker than your country’s largest industry saying it would have a high ROI. The harrowing stories of people who have lost friends or relatives to the screwworm can make for effective messaging too.\n\nThe timing is also right. In 2024 Uruguay started considering using gene drives, so there is already momentum to latch onto.\n\nI’ve observed that successful EA policy campaigns often fight inertia rather than active and organised opponents. This is unfortunately not the case for this intervention. Environmentalist groups will push back to stop the use of gene drives. I suspect the livestock lobby is the more powerful voice, but who knows.\n\nI believe the most likely outcome is that South America will eventually use gene drives or sterile insect releases to eradicate screwworm anyway, but a coordinated campaign can speed this up by several years.\n\nThe ideal founders to pull off this campaign would have familiarity with South American policy and politics. Fluency in Spanish and Portuguese is likely necessary as well.\n\n# A call to action\n\nI am not a wild animal welfare researcher and I hope it’s abundantly clear this intervention would benefit from further investigation by someone with domain expertise.\n\nMy own estimates suggests policy advocacy to eradicate screwworm to be competitive with the most cost-effective animal welfare interventions.\n\nI am not from South America, I am not well-positioned to work on this, **but somebody really should do something**. There’s lots to do. One could reach out to the Uruguayan researchers to better understand their bottlenecks. Is it funding? If so, how much? One could speak with the livestock industry to gauge their interest. Would they join a coalition and/or pay for the campaign?\n\nI believe a  group of motivated volunteers could get quite far. **If you are interested in continuing work on any of this do reach out.** The best person to work on this was someone more qualified five years ago, the second best is you today.\n\n_Cochliomyia hominivorax delenda est_\n\n1.  **[^](#fnref4i58gv52zfm)**\n    \n     https://www.iaea.org/sites/default/files/32406483541.pdf\n    \n2.  **[^](#fnrefo0tyi89nngh)**\n    \n     https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7789611/\n    \n3.  **[^](#fnrefqv00j82g0wb)**\n    \n     https://www.aphis.usda.gov/sites/default/files/screwworm-environmental-assessment.pdf\n    \n4.  **[^](#fnrefxzwh6v6axdn)**\n    \n     http://www.scielo.edu.uy/scielo.php?script=sci\\_arttext&pid=S2730-50662021000301401\n    \n5.  **[^](#fnrefjki379rojt)**\n    \n    Some also worry about the gene drive spreading to other Cochliomyia species, which is a genuine concern but not something that worries me that much.\n    \n    In theory it could happen through one of two ways:\n    \n    \\- Hybridization (successful cross-breeding between the species)  \n    \\- Horizontal spread (gene drive transferred without reproduction, for example through a virus)\n    \n    For screwworm I haven't been able to find any source claiming screwworm species can hybridize (unlike between subspecies of eg. anopheles gambiae mosquitoes where it regularly happens). This is in line with what I would expect, as hybridization between species is the exception not the rule. But one could cheaply run a lab experiment to verify they don't hybridize. If nobody has done this already, that would be wise to do.\n    \n    Horizontal gene flow is impossible to rule out completely, but the likelihood of this occurring is pretty much zero. The risk of the gene spreading can also be addressed by building the gene drive to target a section of the genome unique to C. hominivorax.\n    \n    Additionally one can run a no-payload daisy chain drive test first (more on that in my magazine article) to verify the drive works as intended and doesn't spread, before releasing a full suppression drive.\n    \n6.  **[^](#fnref4kp3tuf0w4n)**\n    \n     Countries which have signed the cartagena protocol have some obligations to their neighbour countries.\n    \n7.  **[^](#fnref8au87eajce4)**\n    \n     Before the eradication in north America an estimated 2-3% of wild animals in endemic regions were infested: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7789611/#:~:text=Prior%20to%20eradication%20the%20USA,eradication%20%5B17%2C%2018%5D.",
  "reviews": [
    {
      "agentId": "research-scholar",
      "costInCents": 7158,
      "createdAt": "2025-04-16T07:06:40.738Z",
      "runDetails": "{\"model\":\"anthropic/claude-3.7-sonnet\",\"promptTokens\":4999,\"completionTokens\":2159,\"totalTokens\":7158,\"temperature\":0.1,\"runtimeMs\":42347}",
      "summary": "This document presents a compelling case for using gene drives to eradicate the New World Screwworm in South America as a highly cost-effective wild animal welfare intervention. The screwworm causes immense suffering to hundreds of millions of wild mammals annually by laying eggs in wounds, with larvae that literally eat the host alive. The author argues that political advocacy to coordinate South American countries to implement gene drives would be both tractable and impactful.\n\nKey strengths of this proposal include: 1) The rare alignment between economic interests (livestock industry saving hundreds of millions of dollars) and wild animal welfare goals; 2) Proven safety from prior successful eradication in North America; 3) Existing momentum with Uruguay already exploring gene drives; and 4) The massive scale of wild suffering that could be prevented.\n\nThe author acknowledges challenges including opposition from environmental groups like Greenpeace and uncertainty in calculating welfare improvements. They provide a cost-effectiveness analysis suggesting the intervention could be competitive with the best animal welfare interventions, while calling for further expert investigation. The document concludes with a call to action for individuals with relevant expertise to advance this promising opportunity.",
      "comments": [
        {
          "title": "Timing and existing momentum",
          "description": "The author identifies a timely opportunity with Uruguay already beginning to explore gene drives for screwworm eradication in 2024. This existing momentum provides a foundation to build upon, potentially accelerating the timeline for a broader South American initiative.",
          "highlight": {
            "startOffset": 3932,
            "endOffset": 13658,
            "quotedText": "In 2024 Uruguay’s National Institute for Agricultural Research received a $450,000 grant to develop a gene drive for screwworm. Even without the gene drive, Uruguay is interested in using the sterile insect technique to eradicate it within Uruguay, which will require continuously keeping up a costly artificial border of sterile flies insects surrounding the entire country.\n\n# What is a gene drive?\n\nIn short, the CRISPR/Cas9 Gene drive makes it possible to make a gene edit to an animal that is passed on to every one of its descendants, who in turn pass it on to everyone of theirs. By installing a gene drive into a single animal, over the next generations the gene edit will spread until the entire species has it.\n\nThis makes it a rather powerful technology. One way the technology can be used for good, is by driving a gene into an undesirable species which makes the females infertile, causing the population to collapse.\n\nBy using gene drives it becomes feasible to eradicate screwworm in South America.\n\nThe primary risk[\\[5\\]](#fnjki379rojt) from releasing any gene drive for population suppression is how the elimination of the subspecies will affect the surrounding ecology, for example by reducing the food available to predators.\n\nFortunately that experiment has already been run in North and Central America when they eradicated screwworm decades ago. The environmental impacts were minimal to none. With the reduced need for pesticides, one could even argue the environmental impact was positive.\n\nThis hasn’t prevented environmental organisations such as Greenpeace, who are against gene editing of any kind, from lobbying for a global moratorium (ban) on the use of gene drives. The UN voted down this proposal, and gene drives currently exist in somewhat of a legal grey area, where the decision to release any gene drive ultimately rests on individual countries rather than international agreements[\\[6\\]](#fn4kp3tuf0w4n).\n\n# The intervention: Political advocacy for governments to release a gene drive\n\nThe campaign will likely consist of the following steps:\n\n*   Putting together the coalition supporting a gene drive release.\n*   Doing the necessary advocacy to get buy-in from key countries across South America.\n*   Playing a coordinating role to connect agencies and get the eradication effort started.\n\nThe livestock industry makes up a large part of the economy of many South American countries. As a result, the agricultural lobby is incredibly influential and well connected.\n\nWhy is a country such as Uruguay looking to spend so much money on the sterile insect technique to eradicate screwworm in the first place? Hint, it’s not out of concern for the wellbeing of wild animals.\n\nSmall scale farmers and industrial factory farmers alike stand to save millions of dollars from the eradication of screwworm.\n\nAn effective campaign should put together a coalition of agricultural interest groups and utilise their existing networks and connections to key decision makers. Agricultural departments across countries have a shared interest in seeing it eradicated. Rather than a gene drive release being a national Uruguayan effort, the campaign would work to get other countries to join in and support the effort.\n\nExecuted well, I can envision the announcement of a joint programme to eradicate screwworm between several South American countries (perhaps with funding and help from the USDA) by 2030.\n\n# The cost-effectiveness of eradicating screwworm\n\nThe following sections describe the intuitions behind my cost-effectiveness analysis, feel free to just [view it directly](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) and plug in your own numbers.\n\n## How many wild animals would it help, and how much?\n\nEradicating screwworm would save the South American livestock industry hundreds of millions, but between you and me, helping this industry is not what excites me.\n\nThe real benefit is to the hundreds of millions of wild mammals in South America, of which I estimate 0.1-4% are infected with screwworm every year.[\\[7\\]](#fn8au87eajce4) A [back of the envelope](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests there are around 89.2 billion wild mammals (plus minus one order of magnitude) on the South American continent. This suggests hundreds of millions or even a few billion animals are infected every year.\n\nSaving them from a painful infection or even death is very motivating to me!\n\nCalculating the welfare improvement for any wild animal welfare intervention is notoriously difficult. If the animals whose lives we save were to later die from something even more painful, we might have done more harm than good. What will be the mammal’s cause of death, if not screwworm?\n\nEyeballing the [estimates from Wild Animal Initiative](https://www.wildanimalinitiative.org/blog/cause-of-death-3), I would very roughly say that ~45% of wild mammals die from predation, ~10% from disease, starvation and injuries, ~30% from humans, and 15% from other sources.\n\nMany sources describe screwworm infection as extremely painful, but tracing back the sources I wasn’t able to find any clear root claims. The medical case reports of humans I found did not use many adjectives to describe patients' pain, nor was I able to find any mentions of morphine or other similar strong painkillers being administered for the pain. I imagine a doctor who treats patients with myiasis would have a good sense, but I didn’t have one in my network to ask.\n\nMy best guess is that for lethal infections the pain is as bad as that of a severely infected wound, seeing as the causal mechanism of death often is a severe infection following the infestation.\n\nIntuitively it seems worse. If you google: “Screwworm infestation human” you will find upsetting images **(please don’t do this unless you’re sure you can stomach it)**, which gives some idea.\n\nI would personally prefer to be predated, run over by a car, or die from malaria, than I would want to die from a screwworm infection. Having not experienced any of these things, I accept my intuitions may be off, but I don’t know what else to go by. Good chance I’m over indexing on the ‘yuck’ factor of it all.\n\nUsing what I think are conservative assumptions, [my CEA](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests that eradicating screwworm would constitute a significant improvement to wild animal welfare, with each dollar spent averting suffering equivalent to that of 101 animals dying from screwworm.\n\nThe 'gold standard' in animal welfare Corporate Campaigns are estimated to halve the suffering for 66 years of chicken life per dollar spent. These numbers are not directly comparable, but to me screwworm advocacy looks to be in a similar ballpark as the very best animal welfare interventions.\n\n## Are gene drives an effective solution?\n\nUnlike the sterile insect technique, which will require weekly releases of millions of screwworms to work, a dozen gene driven screwworms can spread a gene edit far and wide.\n\nReleasing a gene drive in Uruguay would likely result in a temporary substantial reduction in the screwworm population of Uruguay and its neighbours, until screwworms which by chance develop immunity repopulate back. At this point a second gene drive release will be necessary. Rinse and repeat, until the population is extinct.\n\nWhile the new world screwworm is a single species, it has high genetic diversity across regions. Across the South American continent one can structure the fly into four regional groups of populations, with significant genetic variance. A gene drive released in one region might not spread to the other regions. For lasting and continent wide eradication, I suspect it will be necessary to release gene drives for screwworms in each of these regions.\n\nThis is well within what a team of motivated scientists can pull off. Gene drives are likely to be much cheaper, much more effective, and much better for the environment than any other population suppression technique.\n\n## What are the costs?\n\nCreating and releasing gene driven screwworms is not by itself too expensive. The R&D costs of developing working gene drives for screwworm will be within the single digit millions at the very highest.\n\nAdding in expenses relating to the test and release, such as environmental reviews and monitoring we get into the tens of millions at most. Most of these costs will be incurred by governments whose counterfactual looks different from that of the EA donor.\n\nThe political advocacy itself will perhaps cost a few million dollars, it might even be possible to get the livestock industry to pay for some of it.\n\nThe total costs will be in the tens of millions, and only a fraction of that has to come from high counterfactual philanthropic sources. Even without counting welfare benefits, the ROI for governments is positive.\n\n## How likely is political advocacy to succeed?\n\nThe existing financial interests in seeing screwworm eradicated makes me believe a campaign is much more likely to succeed than it otherwise would be. When you come across an animal welfare intervention that factory farmers are as excited about as you, you should act!\n\nThere are few arguments more persuasive to a policy maker than your country’s largest industry saying it would have a high ROI. The harrowing stories of people who have lost friends or relatives to the screwworm can make for effective messaging too.\n\nThe timing is also right. In 2024 Uruguay started considering using gene drives, so there is already momentum to latch onto."
          },
          "importance": "70",
          "isValid": true
        },
        {
          "title": "Proven safety from prior eradication",
          "description": "The intervention has a significant advantage in that the ecological impact of screwworm eradication has already been tested in North and Central America, with minimal to no negative environmental consequences. This addresses one of the primary concerns with gene drives and species eradication.",
          "highlight": {
            "startOffset": 4947,
            "endOffset": 5348,
            "quotedText": "The primary risk[\\[5\\]](#fnjki379rojt) from releasing any gene drive for population suppression is how the elimination of the subspecies will affect the surrounding ecology, for example by reducing the food available to predators.\n\nFortunately that experiment has already been run in North and Central America when they eradicated screwworm decades ago. The environmental impacts were minimal to none."
          },
          "importance": "75",
          "isValid": true
        },
        {
          "title": "Potential opposition from environmental groups",
          "description": "The author acknowledges that unlike many successful EA policy campaigns, this intervention faces active opposition from environmental organizations like Greenpeace that oppose gene editing. This opposition represents a significant challenge that would need to be addressed in any advocacy campaign.",
          "highlight": {
            "startOffset": 5448,
            "endOffset": 13902,
            "quotedText": "This hasn’t prevented environmental organisations such as Greenpeace, who are against gene editing of any kind, from lobbying for a global moratorium (ban) on the use of gene drives. The UN voted down this proposal, and gene drives currently exist in somewhat of a legal grey area, where the decision to release any gene drive ultimately rests on individual countries rather than international agreements[\\[6\\]](#fn4kp3tuf0w4n).\n\n# The intervention: Political advocacy for governments to release a gene drive\n\nThe campaign will likely consist of the following steps:\n\n*   Putting together the coalition supporting a gene drive release.\n*   Doing the necessary advocacy to get buy-in from key countries across South America.\n*   Playing a coordinating role to connect agencies and get the eradication effort started.\n\nThe livestock industry makes up a large part of the economy of many South American countries. As a result, the agricultural lobby is incredibly influential and well connected.\n\nWhy is a country such as Uruguay looking to spend so much money on the sterile insect technique to eradicate screwworm in the first place? Hint, it’s not out of concern for the wellbeing of wild animals.\n\nSmall scale farmers and industrial factory farmers alike stand to save millions of dollars from the eradication of screwworm.\n\nAn effective campaign should put together a coalition of agricultural interest groups and utilise their existing networks and connections to key decision makers. Agricultural departments across countries have a shared interest in seeing it eradicated. Rather than a gene drive release being a national Uruguayan effort, the campaign would work to get other countries to join in and support the effort.\n\nExecuted well, I can envision the announcement of a joint programme to eradicate screwworm between several South American countries (perhaps with funding and help from the USDA) by 2030.\n\n# The cost-effectiveness of eradicating screwworm\n\nThe following sections describe the intuitions behind my cost-effectiveness analysis, feel free to just [view it directly](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) and plug in your own numbers.\n\n## How many wild animals would it help, and how much?\n\nEradicating screwworm would save the South American livestock industry hundreds of millions, but between you and me, helping this industry is not what excites me.\n\nThe real benefit is to the hundreds of millions of wild mammals in South America, of which I estimate 0.1-4% are infected with screwworm every year.[\\[7\\]](#fn8au87eajce4) A [back of the envelope](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests there are around 89.2 billion wild mammals (plus minus one order of magnitude) on the South American continent. This suggests hundreds of millions or even a few billion animals are infected every year.\n\nSaving them from a painful infection or even death is very motivating to me!\n\nCalculating the welfare improvement for any wild animal welfare intervention is notoriously difficult. If the animals whose lives we save were to later die from something even more painful, we might have done more harm than good. What will be the mammal’s cause of death, if not screwworm?\n\nEyeballing the [estimates from Wild Animal Initiative](https://www.wildanimalinitiative.org/blog/cause-of-death-3), I would very roughly say that ~45% of wild mammals die from predation, ~10% from disease, starvation and injuries, ~30% from humans, and 15% from other sources.\n\nMany sources describe screwworm infection as extremely painful, but tracing back the sources I wasn’t able to find any clear root claims. The medical case reports of humans I found did not use many adjectives to describe patients' pain, nor was I able to find any mentions of morphine or other similar strong painkillers being administered for the pain. I imagine a doctor who treats patients with myiasis would have a good sense, but I didn’t have one in my network to ask.\n\nMy best guess is that for lethal infections the pain is as bad as that of a severely infected wound, seeing as the causal mechanism of death often is a severe infection following the infestation.\n\nIntuitively it seems worse. If you google: “Screwworm infestation human” you will find upsetting images **(please don’t do this unless you’re sure you can stomach it)**, which gives some idea.\n\nI would personally prefer to be predated, run over by a car, or die from malaria, than I would want to die from a screwworm infection. Having not experienced any of these things, I accept my intuitions may be off, but I don’t know what else to go by. Good chance I’m over indexing on the ‘yuck’ factor of it all.\n\nUsing what I think are conservative assumptions, [my CEA](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests that eradicating screwworm would constitute a significant improvement to wild animal welfare, with each dollar spent averting suffering equivalent to that of 101 animals dying from screwworm.\n\nThe 'gold standard' in animal welfare Corporate Campaigns are estimated to halve the suffering for 66 years of chicken life per dollar spent. These numbers are not directly comparable, but to me screwworm advocacy looks to be in a similar ballpark as the very best animal welfare interventions.\n\n## Are gene drives an effective solution?\n\nUnlike the sterile insect technique, which will require weekly releases of millions of screwworms to work, a dozen gene driven screwworms can spread a gene edit far and wide.\n\nReleasing a gene drive in Uruguay would likely result in a temporary substantial reduction in the screwworm population of Uruguay and its neighbours, until screwworms which by chance develop immunity repopulate back. At this point a second gene drive release will be necessary. Rinse and repeat, until the population is extinct.\n\nWhile the new world screwworm is a single species, it has high genetic diversity across regions. Across the South American continent one can structure the fly into four regional groups of populations, with significant genetic variance. A gene drive released in one region might not spread to the other regions. For lasting and continent wide eradication, I suspect it will be necessary to release gene drives for screwworms in each of these regions.\n\nThis is well within what a team of motivated scientists can pull off. Gene drives are likely to be much cheaper, much more effective, and much better for the environment than any other population suppression technique.\n\n## What are the costs?\n\nCreating and releasing gene driven screwworms is not by itself too expensive. The R&D costs of developing working gene drives for screwworm will be within the single digit millions at the very highest.\n\nAdding in expenses relating to the test and release, such as environmental reviews and monitoring we get into the tens of millions at most. Most of these costs will be incurred by governments whose counterfactual looks different from that of the EA donor.\n\nThe political advocacy itself will perhaps cost a few million dollars, it might even be possible to get the livestock industry to pay for some of it.\n\nThe total costs will be in the tens of millions, and only a fraction of that has to come from high counterfactual philanthropic sources. Even without counting welfare benefits, the ROI for governments is positive.\n\n## How likely is political advocacy to succeed?\n\nThe existing financial interests in seeing screwworm eradicated makes me believe a campaign is much more likely to succeed than it otherwise would be. When you come across an animal welfare intervention that factory farmers are as excited about as you, you should act!\n\nThere are few arguments more persuasive to a policy maker than your country’s largest industry saying it would have a high ROI. The harrowing stories of people who have lost friends or relatives to the screwworm can make for effective messaging too.\n\nThe timing is also right. In 2024 Uruguay started considering using gene drives, so there is already momentum to latch onto.\n\nI’ve observed that successful EA policy campaigns often fight inertia rather than active and organised opponents. This is unfortunately not the case for this intervention. Environmentalist groups will push back to stop the use of gene drives."
          },
          "importance": "65",
          "isValid": false,
          "error": "Highlight overlaps with a previous highlight"
        },
        {
          "title": "Alignment of economic and welfare interests",
          "description": "The author identifies a rare opportunity where economic interests (livestock industry saving hundreds of millions of dollars) align perfectly with wild animal welfare goals. This alignment significantly increases the tractability of the intervention, as powerful agricultural lobbies can be leveraged to support the campaign.",
          "highlight": {
            "startOffset": 6647,
            "endOffset": 13281,
            "quotedText": "Small scale farmers and industrial factory farmers alike stand to save millions of dollars from the eradication of screwworm.\n\nAn effective campaign should put together a coalition of agricultural interest groups and utilise their existing networks and connections to key decision makers. Agricultural departments across countries have a shared interest in seeing it eradicated. Rather than a gene drive release being a national Uruguayan effort, the campaign would work to get other countries to join in and support the effort.\n\nExecuted well, I can envision the announcement of a joint programme to eradicate screwworm between several South American countries (perhaps with funding and help from the USDA) by 2030.\n\n# The cost-effectiveness of eradicating screwworm\n\nThe following sections describe the intuitions behind my cost-effectiveness analysis, feel free to just [view it directly](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) and plug in your own numbers.\n\n## How many wild animals would it help, and how much?\n\nEradicating screwworm would save the South American livestock industry hundreds of millions, but between you and me, helping this industry is not what excites me.\n\nThe real benefit is to the hundreds of millions of wild mammals in South America, of which I estimate 0.1-4% are infected with screwworm every year.[\\[7\\]](#fn8au87eajce4) A [back of the envelope](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests there are around 89.2 billion wild mammals (plus minus one order of magnitude) on the South American continent. This suggests hundreds of millions or even a few billion animals are infected every year.\n\nSaving them from a painful infection or even death is very motivating to me!\n\nCalculating the welfare improvement for any wild animal welfare intervention is notoriously difficult. If the animals whose lives we save were to later die from something even more painful, we might have done more harm than good. What will be the mammal’s cause of death, if not screwworm?\n\nEyeballing the [estimates from Wild Animal Initiative](https://www.wildanimalinitiative.org/blog/cause-of-death-3), I would very roughly say that ~45% of wild mammals die from predation, ~10% from disease, starvation and injuries, ~30% from humans, and 15% from other sources.\n\nMany sources describe screwworm infection as extremely painful, but tracing back the sources I wasn’t able to find any clear root claims. The medical case reports of humans I found did not use many adjectives to describe patients' pain, nor was I able to find any mentions of morphine or other similar strong painkillers being administered for the pain. I imagine a doctor who treats patients with myiasis would have a good sense, but I didn’t have one in my network to ask.\n\nMy best guess is that for lethal infections the pain is as bad as that of a severely infected wound, seeing as the causal mechanism of death often is a severe infection following the infestation.\n\nIntuitively it seems worse. If you google: “Screwworm infestation human” you will find upsetting images **(please don’t do this unless you’re sure you can stomach it)**, which gives some idea.\n\nI would personally prefer to be predated, run over by a car, or die from malaria, than I would want to die from a screwworm infection. Having not experienced any of these things, I accept my intuitions may be off, but I don’t know what else to go by. Good chance I’m over indexing on the ‘yuck’ factor of it all.\n\nUsing what I think are conservative assumptions, [my CEA](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests that eradicating screwworm would constitute a significant improvement to wild animal welfare, with each dollar spent averting suffering equivalent to that of 101 animals dying from screwworm.\n\nThe 'gold standard' in animal welfare Corporate Campaigns are estimated to halve the suffering for 66 years of chicken life per dollar spent. These numbers are not directly comparable, but to me screwworm advocacy looks to be in a similar ballpark as the very best animal welfare interventions.\n\n## Are gene drives an effective solution?\n\nUnlike the sterile insect technique, which will require weekly releases of millions of screwworms to work, a dozen gene driven screwworms can spread a gene edit far and wide.\n\nReleasing a gene drive in Uruguay would likely result in a temporary substantial reduction in the screwworm population of Uruguay and its neighbours, until screwworms which by chance develop immunity repopulate back. At this point a second gene drive release will be necessary. Rinse and repeat, until the population is extinct.\n\nWhile the new world screwworm is a single species, it has high genetic diversity across regions. Across the South American continent one can structure the fly into four regional groups of populations, with significant genetic variance. A gene drive released in one region might not spread to the other regions. For lasting and continent wide eradication, I suspect it will be necessary to release gene drives for screwworms in each of these regions.\n\nThis is well within what a team of motivated scientists can pull off. Gene drives are likely to be much cheaper, much more effective, and much better for the environment than any other population suppression technique.\n\n## What are the costs?\n\nCreating and releasing gene driven screwworms is not by itself too expensive. The R&D costs of developing working gene drives for screwworm will be within the single digit millions at the very highest.\n\nAdding in expenses relating to the test and release, such as environmental reviews and monitoring we get into the tens of millions at most. Most of these costs will be incurred by governments whose counterfactual looks different from that of the EA donor.\n\nThe political advocacy itself will perhaps cost a few million dollars, it might even be possible to get the livestock industry to pay for some of it.\n\nThe total costs will be in the tens of millions, and only a fraction of that has to come from high counterfactual philanthropic sources. Even without counting welfare benefits, the ROI for governments is positive.\n\n## How likely is political advocacy to succeed?\n\nThe existing financial interests in seeing screwworm eradicated makes me believe a campaign is much more likely to succeed than it otherwise would be. When you come across an animal welfare intervention that factory farmers are as excited about as you, you should act!"
          },
          "importance": "85",
          "isValid": true
        },
        {
          "title": "Scale of wild animal suffering",
          "description": "The document presents compelling evidence that screwworm causes immense suffering to hundreds of millions or potentially billions of wild mammals annually in South America. This scale makes the intervention particularly promising from a utilitarian perspective focused on reducing the most suffering.",
          "highlight": {
            "startOffset": 7893,
            "endOffset": 8404,
            "quotedText": "The real benefit is to the hundreds of millions of wild mammals in South America, of which I estimate 0.1-4% are infected with screwworm every year.[\\[7\\]](#fn8au87eajce4) A [back of the envelope](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests there are around 89.2 billion wild mammals (plus minus one order of magnitude) on the South American continent. This suggests hundreds of millions or even a few billion animals are infected every year."
          },
          "importance": "80",
          "isValid": false,
          "error": "Highlight overlaps with a previous highlight"
        },
        {
          "title": "Uncertainty in welfare improvement calculations",
          "description": "The author transparently acknowledges the difficulty in calculating welfare improvements for wild animals, particularly the challenge of determining whether preventing death by screwworm leads to better or worse alternative causes of death. This uncertainty affects the confidence in the cost-effectiveness estimates.",
          "highlight": {
            "startOffset": 8484,
            "endOffset": 10232,
            "quotedText": "Calculating the welfare improvement for any wild animal welfare intervention is notoriously difficult. If the animals whose lives we save were to later die from something even more painful, we might have done more harm than good. What will be the mammal’s cause of death, if not screwworm?\n\nEyeballing the [estimates from Wild Animal Initiative](https://www.wildanimalinitiative.org/blog/cause-of-death-3), I would very roughly say that ~45% of wild mammals die from predation, ~10% from disease, starvation and injuries, ~30% from humans, and 15% from other sources.\n\nMany sources describe screwworm infection as extremely painful, but tracing back the sources I wasn’t able to find any clear root claims. The medical case reports of humans I found did not use many adjectives to describe patients' pain, nor was I able to find any mentions of morphine or other similar strong painkillers being administered for the pain. I imagine a doctor who treats patients with myiasis would have a good sense, but I didn’t have one in my network to ask.\n\nMy best guess is that for lethal infections the pain is as bad as that of a severely infected wound, seeing as the causal mechanism of death often is a severe infection following the infestation.\n\nIntuitively it seems worse. If you google: “Screwworm infestation human” you will find upsetting images **(please don’t do this unless you’re sure you can stomach it)**, which gives some idea.\n\nI would personally prefer to be predated, run over by a car, or die from malaria, than I would want to die from a screwworm infection. Having not experienced any of these things, I accept my intuitions may be off, but I don’t know what else to go by. Good chance I’m over indexing on the ‘yuck’ factor of it all."
          },
          "importance": "60",
          "isValid": false,
          "error": "Highlight overlaps with a previous highlight"
        },
        {
          "title": "Technical feasibility of gene drives for screwworm",
          "description": "The document explains why gene drives are particularly well-suited for screwworm eradication compared to alternatives like the sterile insect technique, though it notes the challenge of genetic diversity across regions requiring multiple releases. This technical assessment strengthens the case for the intervention.",
          "highlight": {
            "startOffset": 10937,
            "endOffset": 12112,
            "quotedText": "Unlike the sterile insect technique, which will require weekly releases of millions of screwworms to work, a dozen gene driven screwworms can spread a gene edit far and wide.\n\nReleasing a gene drive in Uruguay would likely result in a temporary substantial reduction in the screwworm population of Uruguay and its neighbours, until screwworms which by chance develop immunity repopulate back. At this point a second gene drive release will be necessary. Rinse and repeat, until the population is extinct.\n\nWhile the new world screwworm is a single species, it has high genetic diversity across regions. Across the South American continent one can structure the fly into four regional groups of populations, with significant genetic variance. A gene drive released in one region might not spread to the other regions. For lasting and continent wide eradication, I suspect it will be necessary to release gene drives for screwworms in each of these regions.\n\nThis is well within what a team of motivated scientists can pull off. Gene drives are likely to be much cheaper, much more effective, and much better for the environment than any other population suppression technique."
          },
          "importance": "65",
          "isValid": false,
          "error": "Highlight overlaps with a previous highlight"
        },
        {
          "title": "Call for further expert investigation",
          "description": "The author acknowledges limitations in their expertise and calls for further investigation by domain experts, demonstrating epistemic humility and a commitment to ensuring the intervention is truly as promising as it appears. This approach increases confidence in the overall analysis.",
          "highlight": {
            "startOffset": 14380,
            "endOffset": 14690,
            "quotedText": "I am not a wild animal welfare researcher and I hope it’s abundantly clear this intervention would benefit from further investigation by someone with domain expertise.\n\nMy own estimates suggests policy advocacy to eradicate screwworm to be competitive with the most cost-effective animal welfare interventions."
          },
          "importance": "55",
          "isValid": true
        }
      ]
    },
    {
      "agentId": "bias-detector",
      "costInCents": 7605,
      "createdAt": "2025-04-16T07:18:24.568Z",
      "runDetails": "{\"model\":\"anthropic/claude-3.7-sonnet\",\"promptTokens\":5152,\"completionTokens\":2453,\"totalTokens\":7605,\"temperature\":0.1,\"runtimeMs\":49748}",
      "thinking": "I'm analyzing a document about using gene drives to eradicate the New World Screwworm in South America. This is a proposal for a specific intervention that combines biotechnology with political advocacy to address both animal welfare and economic concerns.\n\nFirst, let me understand the key components:\n\n1. The New World Screwworm (C. hominivorax) is a parasitic fly that lays eggs in wounds of mammals. The larvae eat the host alive, causing extreme suffering and often death.\n2. It affects both wild animals and livestock across South America, causing economic damage and animal suffering.\n3. The screwworm was successfully eradicated from North and Central America using the sterile insect technique.\n4. Gene drives are a newer, potentially more efficient technology that could spread genetic modifications through an entire population, making females infertile and causing population collapse.\n5. The author proposes political advocacy to coordinate South American countries to use gene drives for screwworm eradication.\n\nThe document makes several key arguments:\n- This intervention would prevent suffering for hundreds of millions to billions of wild animals\n- It aligns with economic interests (livestock industry would save money)\n- The technology is feasible and the risks are manageable\n- The timing is good as Uruguay is already exploring gene drives\n- The cost-effectiveness appears competitive with other animal welfare interventions\n\nFrom my perspective as an analyst, this proposal is interesting because it:\n\n1. Addresses wild animal welfare, which is often neglected but potentially very high-impact\n2. Leverages existing economic incentives rather than fighting against them\n3. Uses a relatively new technology (gene drives) that could be more effective than previous methods\n4. Has already been partially proven through the North American eradication\n5. Provides a detailed theory of change and cost-effectiveness analysis\n\nI should evaluate several aspects:\n- The scientific validity of the claims about gene drives and screwworm\n- The ethical considerations of species eradication\n- The political feasibility of the proposed advocacy\n- The robustness of the cost-effectiveness analysis\n- The potential risks and unintended consequences\n- The overall quality of the argument and evidence presented\n\nI notice the author acknowledges limitations in their expertise and calls for others with more relevant experience to take up this cause. This shows appropriate epistemic humility.\n\nThe document includes footnotes and references to scientific literature, which strengthens its credibility. The author has also consulted with experts in the field.\n\nThe cost-effectiveness analysis appears to be done in good faith, though with acknowledged uncertainty in some of the parameters.\n\nThe author addresses potential environmental concerns by noting that the experiment has already been run in North America with minimal ecological impact.\n\nOverall, this appears to be a well-researched proposal for a potentially high-impact intervention that combines biotechnology with policy advocacy to address both animal welfare and economic concerns in South America.",
      "summary": "This proposal for using gene drives to eradicate the New World Screwworm in South America represents a potentially transformative wild animal welfare intervention with strong economic co-benefits. The screwworm causes immense suffering to hundreds of millions of wild mammals annually while also inflicting significant economic damage to the livestock industry. \n\nThe intervention's key strengths include: 1) alignment with powerful economic interests that create natural allies for advocacy, 2) leveraging cutting-edge gene drive technology that offers significant advantages over previous methods, 3) a proven safety record from successful North American eradication efforts, and 4) existing momentum with Uruguay already exploring gene drives for this purpose.\n\nThe cost-effectiveness analysis suggests this intervention could be competitive with the most effective animal welfare interventions, potentially averting suffering for 101 animals per dollar spent. Technical challenges include addressing the genetic diversity of screwworm populations across regions and navigating potential opposition from environmental organizations.\n\nThis represents a rare opportunity where wild animal welfare aligns with economic interests, creating favorable conditions for successful advocacy that could prevent enormous suffering across the South American continent.",
      "comments": [
        {
          "title": "Leveraging existing momentum and interests",
          "description": "The proposal identifies a strategic opportunity by building on Uruguay's existing interest in gene drives for screwworm control. This timing advantage, combined with strong economic incentives from the livestock industry, creates favorable conditions for successful advocacy.",
          "highlight": {
            "startOffset": 3932,
            "endOffset": 13658,
            "quotedText": "In 2024 Uruguay’s National Institute for Agricultural Research received a $450,000 grant to develop a gene drive for screwworm. Even without the gene drive, Uruguay is interested in using the sterile insect technique to eradicate it within Uruguay, which will require continuously keeping up a costly artificial border of sterile flies insects surrounding the entire country.\n\n# What is a gene drive?\n\nIn short, the CRISPR/Cas9 Gene drive makes it possible to make a gene edit to an animal that is passed on to every one of its descendants, who in turn pass it on to everyone of theirs. By installing a gene drive into a single animal, over the next generations the gene edit will spread until the entire species has it.\n\nThis makes it a rather powerful technology. One way the technology can be used for good, is by driving a gene into an undesirable species which makes the females infertile, causing the population to collapse.\n\nBy using gene drives it becomes feasible to eradicate screwworm in South America.\n\nThe primary risk[\\[5\\]](#fnjki379rojt) from releasing any gene drive for population suppression is how the elimination of the subspecies will affect the surrounding ecology, for example by reducing the food available to predators.\n\nFortunately that experiment has already been run in North and Central America when they eradicated screwworm decades ago. The environmental impacts were minimal to none. With the reduced need for pesticides, one could even argue the environmental impact was positive.\n\nThis hasn’t prevented environmental organisations such as Greenpeace, who are against gene editing of any kind, from lobbying for a global moratorium (ban) on the use of gene drives. The UN voted down this proposal, and gene drives currently exist in somewhat of a legal grey area, where the decision to release any gene drive ultimately rests on individual countries rather than international agreements[\\[6\\]](#fn4kp3tuf0w4n).\n\n# The intervention: Political advocacy for governments to release a gene drive\n\nThe campaign will likely consist of the following steps:\n\n*   Putting together the coalition supporting a gene drive release.\n*   Doing the necessary advocacy to get buy-in from key countries across South America.\n*   Playing a coordinating role to connect agencies and get the eradication effort started.\n\nThe livestock industry makes up a large part of the economy of many South American countries. As a result, the agricultural lobby is incredibly influential and well connected.\n\nWhy is a country such as Uruguay looking to spend so much money on the sterile insect technique to eradicate screwworm in the first place? Hint, it’s not out of concern for the wellbeing of wild animals.\n\nSmall scale farmers and industrial factory farmers alike stand to save millions of dollars from the eradication of screwworm.\n\nAn effective campaign should put together a coalition of agricultural interest groups and utilise their existing networks and connections to key decision makers. Agricultural departments across countries have a shared interest in seeing it eradicated. Rather than a gene drive release being a national Uruguayan effort, the campaign would work to get other countries to join in and support the effort.\n\nExecuted well, I can envision the announcement of a joint programme to eradicate screwworm between several South American countries (perhaps with funding and help from the USDA) by 2030.\n\n# The cost-effectiveness of eradicating screwworm\n\nThe following sections describe the intuitions behind my cost-effectiveness analysis, feel free to just [view it directly](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) and plug in your own numbers.\n\n## How many wild animals would it help, and how much?\n\nEradicating screwworm would save the South American livestock industry hundreds of millions, but between you and me, helping this industry is not what excites me.\n\nThe real benefit is to the hundreds of millions of wild mammals in South America, of which I estimate 0.1-4% are infected with screwworm every year.[\\[7\\]](#fn8au87eajce4) A [back of the envelope](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests there are around 89.2 billion wild mammals (plus minus one order of magnitude) on the South American continent. This suggests hundreds of millions or even a few billion animals are infected every year.\n\nSaving them from a painful infection or even death is very motivating to me!\n\nCalculating the welfare improvement for any wild animal welfare intervention is notoriously difficult. If the animals whose lives we save were to later die from something even more painful, we might have done more harm than good. What will be the mammal’s cause of death, if not screwworm?\n\nEyeballing the [estimates from Wild Animal Initiative](https://www.wildanimalinitiative.org/blog/cause-of-death-3), I would very roughly say that ~45% of wild mammals die from predation, ~10% from disease, starvation and injuries, ~30% from humans, and 15% from other sources.\n\nMany sources describe screwworm infection as extremely painful, but tracing back the sources I wasn’t able to find any clear root claims. The medical case reports of humans I found did not use many adjectives to describe patients' pain, nor was I able to find any mentions of morphine or other similar strong painkillers being administered for the pain. I imagine a doctor who treats patients with myiasis would have a good sense, but I didn’t have one in my network to ask.\n\nMy best guess is that for lethal infections the pain is as bad as that of a severely infected wound, seeing as the causal mechanism of death often is a severe infection following the infestation.\n\nIntuitively it seems worse. If you google: “Screwworm infestation human” you will find upsetting images **(please don’t do this unless you’re sure you can stomach it)**, which gives some idea.\n\nI would personally prefer to be predated, run over by a car, or die from malaria, than I would want to die from a screwworm infection. Having not experienced any of these things, I accept my intuitions may be off, but I don’t know what else to go by. Good chance I’m over indexing on the ‘yuck’ factor of it all.\n\nUsing what I think are conservative assumptions, [my CEA](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests that eradicating screwworm would constitute a significant improvement to wild animal welfare, with each dollar spent averting suffering equivalent to that of 101 animals dying from screwworm.\n\nThe 'gold standard' in animal welfare Corporate Campaigns are estimated to halve the suffering for 66 years of chicken life per dollar spent. These numbers are not directly comparable, but to me screwworm advocacy looks to be in a similar ballpark as the very best animal welfare interventions.\n\n## Are gene drives an effective solution?\n\nUnlike the sterile insect technique, which will require weekly releases of millions of screwworms to work, a dozen gene driven screwworms can spread a gene edit far and wide.\n\nReleasing a gene drive in Uruguay would likely result in a temporary substantial reduction in the screwworm population of Uruguay and its neighbours, until screwworms which by chance develop immunity repopulate back. At this point a second gene drive release will be necessary. Rinse and repeat, until the population is extinct.\n\nWhile the new world screwworm is a single species, it has high genetic diversity across regions. Across the South American continent one can structure the fly into four regional groups of populations, with significant genetic variance. A gene drive released in one region might not spread to the other regions. For lasting and continent wide eradication, I suspect it will be necessary to release gene drives for screwworms in each of these regions.\n\nThis is well within what a team of motivated scientists can pull off. Gene drives are likely to be much cheaper, much more effective, and much better for the environment than any other population suppression technique.\n\n## What are the costs?\n\nCreating and releasing gene driven screwworms is not by itself too expensive. The R&D costs of developing working gene drives for screwworm will be within the single digit millions at the very highest.\n\nAdding in expenses relating to the test and release, such as environmental reviews and monitoring we get into the tens of millions at most. Most of these costs will be incurred by governments whose counterfactual looks different from that of the EA donor.\n\nThe political advocacy itself will perhaps cost a few million dollars, it might even be possible to get the livestock industry to pay for some of it.\n\nThe total costs will be in the tens of millions, and only a fraction of that has to come from high counterfactual philanthropic sources. Even without counting welfare benefits, the ROI for governments is positive.\n\n## How likely is political advocacy to succeed?\n\nThe existing financial interests in seeing screwworm eradicated makes me believe a campaign is much more likely to succeed than it otherwise would be. When you come across an animal welfare intervention that factory farmers are as excited about as you, you should act!\n\nThere are few arguments more persuasive to a policy maker than your country’s largest industry saying it would have a high ROI. The harrowing stories of people who have lost friends or relatives to the screwworm can make for effective messaging too.\n\nThe timing is also right. In 2024 Uruguay started considering using gene drives, so there is already momentum to latch onto."
          },
          "importance": "70",
          "grade": "85",
          "isValid": true
        },
        {
          "title": "Proven safety through North American precedent",
          "description": "The document notes that screwworm eradication has already been successfully implemented in North and Central America with minimal ecological impact, providing real-world evidence for the safety of this intervention. This addresses a key concern about ecological consequences.",
          "highlight": {
            "startOffset": 5179,
            "endOffset": 5446,
            "quotedText": "Fortunately that experiment has already been run in North and Central America when they eradicated screwworm decades ago. The environmental impacts were minimal to none. With the reduced need for pesticides, one could even argue the environmental impact was positive."
          },
          "importance": "75",
          "grade": "90",
          "isValid": false,
          "error": "Highlight overlaps with a previous highlight"
        },
        {
          "title": "Potential opposition from environmental groups",
          "description": "The document acknowledges that environmental organizations like Greenpeace oppose gene editing technologies and may actively work against this intervention. This represents a significant challenge that would need to be addressed in any advocacy campaign.",
          "highlight": {
            "startOffset": 5448,
            "endOffset": 13975,
            "quotedText": "This hasn’t prevented environmental organisations such as Greenpeace, who are against gene editing of any kind, from lobbying for a global moratorium (ban) on the use of gene drives. The UN voted down this proposal, and gene drives currently exist in somewhat of a legal grey area, where the decision to release any gene drive ultimately rests on individual countries rather than international agreements[\\[6\\]](#fn4kp3tuf0w4n).\n\n# The intervention: Political advocacy for governments to release a gene drive\n\nThe campaign will likely consist of the following steps:\n\n*   Putting together the coalition supporting a gene drive release.\n*   Doing the necessary advocacy to get buy-in from key countries across South America.\n*   Playing a coordinating role to connect agencies and get the eradication effort started.\n\nThe livestock industry makes up a large part of the economy of many South American countries. As a result, the agricultural lobby is incredibly influential and well connected.\n\nWhy is a country such as Uruguay looking to spend so much money on the sterile insect technique to eradicate screwworm in the first place? Hint, it’s not out of concern for the wellbeing of wild animals.\n\nSmall scale farmers and industrial factory farmers alike stand to save millions of dollars from the eradication of screwworm.\n\nAn effective campaign should put together a coalition of agricultural interest groups and utilise their existing networks and connections to key decision makers. Agricultural departments across countries have a shared interest in seeing it eradicated. Rather than a gene drive release being a national Uruguayan effort, the campaign would work to get other countries to join in and support the effort.\n\nExecuted well, I can envision the announcement of a joint programme to eradicate screwworm between several South American countries (perhaps with funding and help from the USDA) by 2030.\n\n# The cost-effectiveness of eradicating screwworm\n\nThe following sections describe the intuitions behind my cost-effectiveness analysis, feel free to just [view it directly](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) and plug in your own numbers.\n\n## How many wild animals would it help, and how much?\n\nEradicating screwworm would save the South American livestock industry hundreds of millions, but between you and me, helping this industry is not what excites me.\n\nThe real benefit is to the hundreds of millions of wild mammals in South America, of which I estimate 0.1-4% are infected with screwworm every year.[\\[7\\]](#fn8au87eajce4) A [back of the envelope](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests there are around 89.2 billion wild mammals (plus minus one order of magnitude) on the South American continent. This suggests hundreds of millions or even a few billion animals are infected every year.\n\nSaving them from a painful infection or even death is very motivating to me!\n\nCalculating the welfare improvement for any wild animal welfare intervention is notoriously difficult. If the animals whose lives we save were to later die from something even more painful, we might have done more harm than good. What will be the mammal’s cause of death, if not screwworm?\n\nEyeballing the [estimates from Wild Animal Initiative](https://www.wildanimalinitiative.org/blog/cause-of-death-3), I would very roughly say that ~45% of wild mammals die from predation, ~10% from disease, starvation and injuries, ~30% from humans, and 15% from other sources.\n\nMany sources describe screwworm infection as extremely painful, but tracing back the sources I wasn’t able to find any clear root claims. The medical case reports of humans I found did not use many adjectives to describe patients' pain, nor was I able to find any mentions of morphine or other similar strong painkillers being administered for the pain. I imagine a doctor who treats patients with myiasis would have a good sense, but I didn’t have one in my network to ask.\n\nMy best guess is that for lethal infections the pain is as bad as that of a severely infected wound, seeing as the causal mechanism of death often is a severe infection following the infestation.\n\nIntuitively it seems worse. If you google: “Screwworm infestation human” you will find upsetting images **(please don’t do this unless you’re sure you can stomach it)**, which gives some idea.\n\nI would personally prefer to be predated, run over by a car, or die from malaria, than I would want to die from a screwworm infection. Having not experienced any of these things, I accept my intuitions may be off, but I don’t know what else to go by. Good chance I’m over indexing on the ‘yuck’ factor of it all.\n\nUsing what I think are conservative assumptions, [my CEA](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests that eradicating screwworm would constitute a significant improvement to wild animal welfare, with each dollar spent averting suffering equivalent to that of 101 animals dying from screwworm.\n\nThe 'gold standard' in animal welfare Corporate Campaigns are estimated to halve the suffering for 66 years of chicken life per dollar spent. These numbers are not directly comparable, but to me screwworm advocacy looks to be in a similar ballpark as the very best animal welfare interventions.\n\n## Are gene drives an effective solution?\n\nUnlike the sterile insect technique, which will require weekly releases of millions of screwworms to work, a dozen gene driven screwworms can spread a gene edit far and wide.\n\nReleasing a gene drive in Uruguay would likely result in a temporary substantial reduction in the screwworm population of Uruguay and its neighbours, until screwworms which by chance develop immunity repopulate back. At this point a second gene drive release will be necessary. Rinse and repeat, until the population is extinct.\n\nWhile the new world screwworm is a single species, it has high genetic diversity across regions. Across the South American continent one can structure the fly into four regional groups of populations, with significant genetic variance. A gene drive released in one region might not spread to the other regions. For lasting and continent wide eradication, I suspect it will be necessary to release gene drives for screwworms in each of these regions.\n\nThis is well within what a team of motivated scientists can pull off. Gene drives are likely to be much cheaper, much more effective, and much better for the environment than any other population suppression technique.\n\n## What are the costs?\n\nCreating and releasing gene driven screwworms is not by itself too expensive. The R&D costs of developing working gene drives for screwworm will be within the single digit millions at the very highest.\n\nAdding in expenses relating to the test and release, such as environmental reviews and monitoring we get into the tens of millions at most. Most of these costs will be incurred by governments whose counterfactual looks different from that of the EA donor.\n\nThe political advocacy itself will perhaps cost a few million dollars, it might even be possible to get the livestock industry to pay for some of it.\n\nThe total costs will be in the tens of millions, and only a fraction of that has to come from high counterfactual philanthropic sources. Even without counting welfare benefits, the ROI for governments is positive.\n\n## How likely is political advocacy to succeed?\n\nThe existing financial interests in seeing screwworm eradicated makes me believe a campaign is much more likely to succeed than it otherwise would be. When you come across an animal welfare intervention that factory farmers are as excited about as you, you should act!\n\nThere are few arguments more persuasive to a policy maker than your country’s largest industry saying it would have a high ROI. The harrowing stories of people who have lost friends or relatives to the screwworm can make for effective messaging too.\n\nThe timing is also right. In 2024 Uruguay started considering using gene drives, so there is already momentum to latch onto.\n\nI’ve observed that successful EA policy campaigns often fight inertia rather than active and organised opponents. This is unfortunately not the case for this intervention. Environmentalist groups will push back to stop the use of gene drives. I suspect the livestock lobby is the more powerful voice, but who knows."
          },
          "importance": "65",
          "grade": "40",
          "isValid": false,
          "error": "Highlight overlaps with a previous highlight"
        },
        {
          "title": "Novel wild animal welfare intervention with economic co-benefits",
          "description": "The proposal identifies a unique intervention that simultaneously addresses wild animal suffering and economic interests. By targeting screwworm eradication, it aligns the welfare of hundreds of millions of wild animals with the economic interests of the livestock industry, creating powerful incentives for implementation.",
          "highlight": {
            "startOffset": 7893,
            "endOffset": 8482,
            "quotedText": "The real benefit is to the hundreds of millions of wild mammals in South America, of which I estimate 0.1-4% are infected with screwworm every year.[\\[7\\]](#fn8au87eajce4) A [back of the envelope](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests there are around 89.2 billion wild mammals (plus minus one order of magnitude) on the South American continent. This suggests hundreds of millions or even a few billion animals are infected every year.\n\nSaving them from a painful infection or even death is very motivating to me!"
          },
          "importance": "85",
          "grade": "90",
          "isValid": true
        },
        {
          "title": "Scale of suffering from screwworm",
          "description": "The document provides estimates suggesting hundreds of millions to billions of wild mammals suffer from screwworm infections annually in South America. The painful nature of these infections (being eaten alive by parasites) represents a significant source of wild animal suffering that could be eliminated.",
          "highlight": {
            "startOffset": 8065,
            "endOffset": 8482,
            "quotedText": "A [back of the envelope](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests there are around 89.2 billion wild mammals (plus minus one order of magnitude) on the South American continent. This suggests hundreds of millions or even a few billion animals are infected every year.\n\nSaving them from a painful infection or even death is very motivating to me!"
          },
          "importance": "80",
          "grade": "30",
          "isValid": false,
          "error": "Highlight overlaps with a previous highlight"
        },
        {
          "title": "Competitive cost-effectiveness for animal welfare",
          "description": "The author's cost-effectiveness analysis suggests this intervention could be comparable to the most effective animal welfare interventions, potentially averting suffering equivalent to that of 101 animals dying from screwworm per dollar spent.",
          "highlight": {
            "startOffset": 10234,
            "endOffset": 10892,
            "quotedText": "Using what I think are conservative assumptions, [my CEA](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests that eradicating screwworm would constitute a significant improvement to wild animal welfare, with each dollar spent averting suffering equivalent to that of 101 animals dying from screwworm.\n\nThe 'gold standard' in animal welfare Corporate Campaigns are estimated to halve the suffering for 66 years of chicken life per dollar spent. These numbers are not directly comparable, but to me screwworm advocacy looks to be in a similar ballpark as the very best animal welfare interventions."
          },
          "importance": "70",
          "grade": "80",
          "isValid": false,
          "error": "Highlight overlaps with a previous highlight"
        },
        {
          "title": "Gene drives as transformative technology",
          "description": "The document highlights how gene drive technology represents a significant advancement over previous methods like the sterile insect technique. This technology could make previously infeasible eradication efforts possible and cost-effective, with broader implications for disease vector control beyond this specific application.",
          "highlight": {
            "startOffset": 10937,
            "endOffset": 12112,
            "quotedText": "Unlike the sterile insect technique, which will require weekly releases of millions of screwworms to work, a dozen gene driven screwworms can spread a gene edit far and wide.\n\nReleasing a gene drive in Uruguay would likely result in a temporary substantial reduction in the screwworm population of Uruguay and its neighbours, until screwworms which by chance develop immunity repopulate back. At this point a second gene drive release will be necessary. Rinse and repeat, until the population is extinct.\n\nWhile the new world screwworm is a single species, it has high genetic diversity across regions. Across the South American continent one can structure the fly into four regional groups of populations, with significant genetic variance. A gene drive released in one region might not spread to the other regions. For lasting and continent wide eradication, I suspect it will be necessary to release gene drives for screwworms in each of these regions.\n\nThis is well within what a team of motivated scientists can pull off. Gene drives are likely to be much cheaper, much more effective, and much better for the environment than any other population suppression technique."
          },
          "importance": "75",
          "grade": "85",
          "isValid": true
        },
        {
          "title": "Genetic diversity challenge for complete eradication",
          "description": "The document identifies a technical challenge: the genetic diversity of screwworm populations across South America means that multiple gene drive releases targeting different genetic variants would be necessary for continent-wide eradication.",
          "highlight": {
            "startOffset": 11443,
            "endOffset": 11892,
            "quotedText": "While the new world screwworm is a single species, it has high genetic diversity across regions. Across the South American continent one can structure the fly into four regional groups of populations, with significant genetic variance. A gene drive released in one region might not spread to the other regions. For lasting and continent wide eradication, I suspect it will be necessary to release gene drives for screwworms in each of these regions."
          },
          "importance": "60",
          "grade": "50",
          "isValid": false,
          "error": "Highlight overlaps with a previous highlight"
        },
        {
          "title": "Epistemic humility and call for expertise",
          "description": "The author acknowledges limitations in their expertise and explicitly calls for those with more relevant experience to further investigate and potentially implement this intervention. This demonstrates appropriate caution and recognition of the need for specialized knowledge.",
          "highlight": {
            "startOffset": 14380,
            "endOffset": 15318,
            "quotedText": "I am not a wild animal welfare researcher and I hope it’s abundantly clear this intervention would benefit from further investigation by someone with domain expertise.\n\nMy own estimates suggests policy advocacy to eradicate screwworm to be competitive with the most cost-effective animal welfare interventions.\n\nI am not from South America, I am not well-positioned to work on this, **but somebody really should do something**. There’s lots to do. One could reach out to the Uruguayan researchers to better understand their bottlenecks. Is it funding? If so, how much? One could speak with the livestock industry to gauge their interest. Would they join a coalition and/or pay for the campaign?\n\nI believe a  group of motivated volunteers could get quite far. **If you are interested in continuing work on any of this do reach out.** The best person to work on this was someone more qualified five years ago, the second best is you today."
          },
          "importance": "55",
          "grade": "75",
          "isValid": true
        }
      ],
      "grade": "90"
    },
    {
      "agentId": "clarity-coach",
      "costInCents": 7882,
      "createdAt": "2025-04-16T07:19:26.697Z",
      "runDetails": "{\"model\":\"anthropic/claude-3.7-sonnet\",\"promptTokens\":5152,\"completionTokens\":2730,\"totalTokens\":7882,\"temperature\":0.1,\"runtimeMs\":55948}",
      "thinking": "I'm analyzing a document about using gene drives to eradicate the New World Screwworm in South America. This is a fascinating intersection of technology, animal welfare, and policy advocacy.\n\nFirst, let me understand the key elements:\n\n1. The New World Screwworm (C. hominivorax) is a parasitic fly that lays eggs in wounds of mammals. The larvae eat the host alive, causing extreme suffering and often death.\n2. The screwworm affects both livestock and wild mammals across South America, with economic costs in the hundreds of millions of dollars.\n3. The author proposes using gene drives (CRISPR/Cas9 technology that can spread genetic modifications through an entire population) to eradicate the screwworm.\n4. The intervention would involve political advocacy to coordinate South American countries to implement this solution.\n5. The author argues this is highly tractable because there are strong economic incentives (livestock industry) aligned with the welfare benefits.\n\nThe document presents a compelling case for why this intervention could be extremely cost-effective for improving wild animal welfare. The author estimates hundreds of millions to billions of wild mammals could be spared painful infections or death.\n\nSome key considerations for my analysis:\n\n1. Scientific validity: The author has consulted experts and the technology seems feasible, with precedent from North America's successful eradication using an older technique.\n\n2. Ethical considerations: This appears to be a rare case where economic interests, human health, and wild animal welfare align. The ecological impact seems minimal based on previous eradication efforts.\n\n3. Tractability: The political landscape seems favorable with Uruguay already investing in this direction. The agricultural lobby provides a powerful ally.\n\n4. Cost-effectiveness: The author's calculations suggest this could be competitive with the most effective animal welfare interventions.\n\n5. Potential risks: There's opposition from environmental groups, and some technical challenges with genetic diversity across regions.\n\nThe author is making a call to action for someone with the right background to take this forward, suggesting it could be one of the most impactful animal welfare interventions available.\n\nI find this proposal particularly interesting because it represents a convergence of interests that could make implementation realistic, while potentially having enormous positive impact on wild animal suffering - an area that's typically very difficult to address effectively. The author has done solid preliminary research and presents a balanced view of both the potential and challenges.\n\nI'll structure my comments to highlight the key strengths, potential concerns, and unique aspects of this proposal.",
      "summary": "This proposal for using gene drives to eradicate the New World Screwworm in South America represents an exceptionally promising wild animal welfare intervention. It stands out for the rare alignment between economic interests, human health, and animal welfare - creating political tractability that's unusual in the wild animal welfare space.\n\nThe scale of impact is enormous: potentially preventing suffering for hundreds of millions to billions of wild mammals annually. With North America's successful eradication as precedent, we have strong evidence for both feasibility and minimal ecological disruption.\n\nThe cost-effectiveness appears competitive with the best animal welfare interventions, with each dollar potentially averting suffering equivalent to 101 animals dying from screwworm. The timing is opportune, with Uruguay already exploring gene drives in 2024.\n\nKey challenges include opposition from environmental groups, the need for multiple releases to address regional genetic diversity, and finding implementers with South American policy expertise and language skills. Despite these challenges, this intervention represents a rare opportunity to make substantial progress on wild animal welfare through a politically feasible pathway with strong economic incentives.",
      "comments": [
        {
          "title": "Proven feasibility through historical precedent",
          "description": "North America has already successfully eradicated screwworm using the less efficient sterile insect technique, providing strong evidence that eradication is possible and that ecological impacts would be minimal. This reduces uncertainty about both feasibility and potential unintended consequences.",
          "highlight": {
            "startOffset": 2782,
            "endOffset": 5446,
            "quotedText": "In addition to infecting hundreds of millions of wild mammals, the New World screwworm costs the livestock industry hundreds of millions of dollars every year. To prevent the loss of livestock, North America eradicated the screwworm already in 1960 using the more primitive sterile insect technique.\n\nTo prevent the screwworm from migrating back into North America, they additionally worked with Middle American governments to eradicate it there as well, and to this very day they maintain a wall of sterile screwworm in Panama to prevent screwworm from migrating back north.\n\nSince then eradication progress has stalled as the sterile insect technique has proven difficult and expensive to use on the South American continent, where the screwworm is endemic on the majority of the continent.\n\nA survey found that 76% of Uruguayan farmers go as far as to plan yearly animal management around avoiding the screwworm season, to avoid loss of livestock.\n\nIn Uruguay alone, farmers lose between 40 to 150 million USD annually[\\[4\\]](#fnxzwh6v6axdn) (0.14% of the country’s GDP) to screwworm. There is enormous economic interest in seeing it eradicated.\n\nIn 2024 Uruguay’s National Institute for Agricultural Research received a $450,000 grant to develop a gene drive for screwworm. Even without the gene drive, Uruguay is interested in using the sterile insect technique to eradicate it within Uruguay, which will require continuously keeping up a costly artificial border of sterile flies insects surrounding the entire country.\n\n# What is a gene drive?\n\nIn short, the CRISPR/Cas9 Gene drive makes it possible to make a gene edit to an animal that is passed on to every one of its descendants, who in turn pass it on to everyone of theirs. By installing a gene drive into a single animal, over the next generations the gene edit will spread until the entire species has it.\n\nThis makes it a rather powerful technology. One way the technology can be used for good, is by driving a gene into an undesirable species which makes the females infertile, causing the population to collapse.\n\nBy using gene drives it becomes feasible to eradicate screwworm in South America.\n\nThe primary risk[\\[5\\]](#fnjki379rojt) from releasing any gene drive for population suppression is how the elimination of the subspecies will affect the surrounding ecology, for example by reducing the food available to predators.\n\nFortunately that experiment has already been run in North and Central America when they eradicated screwworm decades ago. The environmental impacts were minimal to none. With the reduced need for pesticides, one could even argue the environmental impact was positive."
          },
          "importance": "75",
          "grade": "90",
          "isValid": true
        },
        {
          "title": "Potential opposition from environmental groups",
          "description": "Unlike many policy campaigns that only face inertia, this intervention would likely face active opposition from environmental organizations like Greenpeace that oppose gene editing. This opposition could significantly complicate implementation despite the economic incentives.",
          "highlight": {
            "startOffset": 5448,
            "endOffset": 13902,
            "quotedText": "This hasn’t prevented environmental organisations such as Greenpeace, who are against gene editing of any kind, from lobbying for a global moratorium (ban) on the use of gene drives. The UN voted down this proposal, and gene drives currently exist in somewhat of a legal grey area, where the decision to release any gene drive ultimately rests on individual countries rather than international agreements[\\[6\\]](#fn4kp3tuf0w4n).\n\n# The intervention: Political advocacy for governments to release a gene drive\n\nThe campaign will likely consist of the following steps:\n\n*   Putting together the coalition supporting a gene drive release.\n*   Doing the necessary advocacy to get buy-in from key countries across South America.\n*   Playing a coordinating role to connect agencies and get the eradication effort started.\n\nThe livestock industry makes up a large part of the economy of many South American countries. As a result, the agricultural lobby is incredibly influential and well connected.\n\nWhy is a country such as Uruguay looking to spend so much money on the sterile insect technique to eradicate screwworm in the first place? Hint, it’s not out of concern for the wellbeing of wild animals.\n\nSmall scale farmers and industrial factory farmers alike stand to save millions of dollars from the eradication of screwworm.\n\nAn effective campaign should put together a coalition of agricultural interest groups and utilise their existing networks and connections to key decision makers. Agricultural departments across countries have a shared interest in seeing it eradicated. Rather than a gene drive release being a national Uruguayan effort, the campaign would work to get other countries to join in and support the effort.\n\nExecuted well, I can envision the announcement of a joint programme to eradicate screwworm between several South American countries (perhaps with funding and help from the USDA) by 2030.\n\n# The cost-effectiveness of eradicating screwworm\n\nThe following sections describe the intuitions behind my cost-effectiveness analysis, feel free to just [view it directly](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) and plug in your own numbers.\n\n## How many wild animals would it help, and how much?\n\nEradicating screwworm would save the South American livestock industry hundreds of millions, but between you and me, helping this industry is not what excites me.\n\nThe real benefit is to the hundreds of millions of wild mammals in South America, of which I estimate 0.1-4% are infected with screwworm every year.[\\[7\\]](#fn8au87eajce4) A [back of the envelope](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests there are around 89.2 billion wild mammals (plus minus one order of magnitude) on the South American continent. This suggests hundreds of millions or even a few billion animals are infected every year.\n\nSaving them from a painful infection or even death is very motivating to me!\n\nCalculating the welfare improvement for any wild animal welfare intervention is notoriously difficult. If the animals whose lives we save were to later die from something even more painful, we might have done more harm than good. What will be the mammal’s cause of death, if not screwworm?\n\nEyeballing the [estimates from Wild Animal Initiative](https://www.wildanimalinitiative.org/blog/cause-of-death-3), I would very roughly say that ~45% of wild mammals die from predation, ~10% from disease, starvation and injuries, ~30% from humans, and 15% from other sources.\n\nMany sources describe screwworm infection as extremely painful, but tracing back the sources I wasn’t able to find any clear root claims. The medical case reports of humans I found did not use many adjectives to describe patients' pain, nor was I able to find any mentions of morphine or other similar strong painkillers being administered for the pain. I imagine a doctor who treats patients with myiasis would have a good sense, but I didn’t have one in my network to ask.\n\nMy best guess is that for lethal infections the pain is as bad as that of a severely infected wound, seeing as the causal mechanism of death often is a severe infection following the infestation.\n\nIntuitively it seems worse. If you google: “Screwworm infestation human” you will find upsetting images **(please don’t do this unless you’re sure you can stomach it)**, which gives some idea.\n\nI would personally prefer to be predated, run over by a car, or die from malaria, than I would want to die from a screwworm infection. Having not experienced any of these things, I accept my intuitions may be off, but I don’t know what else to go by. Good chance I’m over indexing on the ‘yuck’ factor of it all.\n\nUsing what I think are conservative assumptions, [my CEA](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests that eradicating screwworm would constitute a significant improvement to wild animal welfare, with each dollar spent averting suffering equivalent to that of 101 animals dying from screwworm.\n\nThe 'gold standard' in animal welfare Corporate Campaigns are estimated to halve the suffering for 66 years of chicken life per dollar spent. These numbers are not directly comparable, but to me screwworm advocacy looks to be in a similar ballpark as the very best animal welfare interventions.\n\n## Are gene drives an effective solution?\n\nUnlike the sterile insect technique, which will require weekly releases of millions of screwworms to work, a dozen gene driven screwworms can spread a gene edit far and wide.\n\nReleasing a gene drive in Uruguay would likely result in a temporary substantial reduction in the screwworm population of Uruguay and its neighbours, until screwworms which by chance develop immunity repopulate back. At this point a second gene drive release will be necessary. Rinse and repeat, until the population is extinct.\n\nWhile the new world screwworm is a single species, it has high genetic diversity across regions. Across the South American continent one can structure the fly into four regional groups of populations, with significant genetic variance. A gene drive released in one region might not spread to the other regions. For lasting and continent wide eradication, I suspect it will be necessary to release gene drives for screwworms in each of these regions.\n\nThis is well within what a team of motivated scientists can pull off. Gene drives are likely to be much cheaper, much more effective, and much better for the environment than any other population suppression technique.\n\n## What are the costs?\n\nCreating and releasing gene driven screwworms is not by itself too expensive. The R&D costs of developing working gene drives for screwworm will be within the single digit millions at the very highest.\n\nAdding in expenses relating to the test and release, such as environmental reviews and monitoring we get into the tens of millions at most. Most of these costs will be incurred by governments whose counterfactual looks different from that of the EA donor.\n\nThe political advocacy itself will perhaps cost a few million dollars, it might even be possible to get the livestock industry to pay for some of it.\n\nThe total costs will be in the tens of millions, and only a fraction of that has to come from high counterfactual philanthropic sources. Even without counting welfare benefits, the ROI for governments is positive.\n\n## How likely is political advocacy to succeed?\n\nThe existing financial interests in seeing screwworm eradicated makes me believe a campaign is much more likely to succeed than it otherwise would be. When you come across an animal welfare intervention that factory farmers are as excited about as you, you should act!\n\nThere are few arguments more persuasive to a policy maker than your country’s largest industry saying it would have a high ROI. The harrowing stories of people who have lost friends or relatives to the screwworm can make for effective messaging too.\n\nThe timing is also right. In 2024 Uruguay started considering using gene drives, so there is already momentum to latch onto.\n\nI’ve observed that successful EA policy campaigns often fight inertia rather than active and organised opponents. This is unfortunately not the case for this intervention. Environmentalist groups will push back to stop the use of gene drives."
          },
          "importance": "60",
          "grade": "40",
          "isValid": false,
          "error": "Highlight overlaps with a previous highlight"
        },
        {
          "title": "Rare alignment of economic and welfare interests",
          "description": "This intervention represents an unusual case where economic interests (livestock industry saving hundreds of millions of dollars), human health concerns (hundreds of human cases yearly), and wild animal welfare (preventing suffering of hundreds of millions to billions of animals) are perfectly aligned. This alignment significantly increases political tractability.",
          "highlight": {
            "startOffset": 6647,
            "endOffset": 13281,
            "quotedText": "Small scale farmers and industrial factory farmers alike stand to save millions of dollars from the eradication of screwworm.\n\nAn effective campaign should put together a coalition of agricultural interest groups and utilise their existing networks and connections to key decision makers. Agricultural departments across countries have a shared interest in seeing it eradicated. Rather than a gene drive release being a national Uruguayan effort, the campaign would work to get other countries to join in and support the effort.\n\nExecuted well, I can envision the announcement of a joint programme to eradicate screwworm between several South American countries (perhaps with funding and help from the USDA) by 2030.\n\n# The cost-effectiveness of eradicating screwworm\n\nThe following sections describe the intuitions behind my cost-effectiveness analysis, feel free to just [view it directly](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) and plug in your own numbers.\n\n## How many wild animals would it help, and how much?\n\nEradicating screwworm would save the South American livestock industry hundreds of millions, but between you and me, helping this industry is not what excites me.\n\nThe real benefit is to the hundreds of millions of wild mammals in South America, of which I estimate 0.1-4% are infected with screwworm every year.[\\[7\\]](#fn8au87eajce4) A [back of the envelope](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests there are around 89.2 billion wild mammals (plus minus one order of magnitude) on the South American continent. This suggests hundreds of millions or even a few billion animals are infected every year.\n\nSaving them from a painful infection or even death is very motivating to me!\n\nCalculating the welfare improvement for any wild animal welfare intervention is notoriously difficult. If the animals whose lives we save were to later die from something even more painful, we might have done more harm than good. What will be the mammal’s cause of death, if not screwworm?\n\nEyeballing the [estimates from Wild Animal Initiative](https://www.wildanimalinitiative.org/blog/cause-of-death-3), I would very roughly say that ~45% of wild mammals die from predation, ~10% from disease, starvation and injuries, ~30% from humans, and 15% from other sources.\n\nMany sources describe screwworm infection as extremely painful, but tracing back the sources I wasn’t able to find any clear root claims. The medical case reports of humans I found did not use many adjectives to describe patients' pain, nor was I able to find any mentions of morphine or other similar strong painkillers being administered for the pain. I imagine a doctor who treats patients with myiasis would have a good sense, but I didn’t have one in my network to ask.\n\nMy best guess is that for lethal infections the pain is as bad as that of a severely infected wound, seeing as the causal mechanism of death often is a severe infection following the infestation.\n\nIntuitively it seems worse. If you google: “Screwworm infestation human” you will find upsetting images **(please don’t do this unless you’re sure you can stomach it)**, which gives some idea.\n\nI would personally prefer to be predated, run over by a car, or die from malaria, than I would want to die from a screwworm infection. Having not experienced any of these things, I accept my intuitions may be off, but I don’t know what else to go by. Good chance I’m over indexing on the ‘yuck’ factor of it all.\n\nUsing what I think are conservative assumptions, [my CEA](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests that eradicating screwworm would constitute a significant improvement to wild animal welfare, with each dollar spent averting suffering equivalent to that of 101 animals dying from screwworm.\n\nThe 'gold standard' in animal welfare Corporate Campaigns are estimated to halve the suffering for 66 years of chicken life per dollar spent. These numbers are not directly comparable, but to me screwworm advocacy looks to be in a similar ballpark as the very best animal welfare interventions.\n\n## Are gene drives an effective solution?\n\nUnlike the sterile insect technique, which will require weekly releases of millions of screwworms to work, a dozen gene driven screwworms can spread a gene edit far and wide.\n\nReleasing a gene drive in Uruguay would likely result in a temporary substantial reduction in the screwworm population of Uruguay and its neighbours, until screwworms which by chance develop immunity repopulate back. At this point a second gene drive release will be necessary. Rinse and repeat, until the population is extinct.\n\nWhile the new world screwworm is a single species, it has high genetic diversity across regions. Across the South American continent one can structure the fly into four regional groups of populations, with significant genetic variance. A gene drive released in one region might not spread to the other regions. For lasting and continent wide eradication, I suspect it will be necessary to release gene drives for screwworms in each of these regions.\n\nThis is well within what a team of motivated scientists can pull off. Gene drives are likely to be much cheaper, much more effective, and much better for the environment than any other population suppression technique.\n\n## What are the costs?\n\nCreating and releasing gene driven screwworms is not by itself too expensive. The R&D costs of developing working gene drives for screwworm will be within the single digit millions at the very highest.\n\nAdding in expenses relating to the test and release, such as environmental reviews and monitoring we get into the tens of millions at most. Most of these costs will be incurred by governments whose counterfactual looks different from that of the EA donor.\n\nThe political advocacy itself will perhaps cost a few million dollars, it might even be possible to get the livestock industry to pay for some of it.\n\nThe total costs will be in the tens of millions, and only a fraction of that has to come from high counterfactual philanthropic sources. Even without counting welfare benefits, the ROI for governments is positive.\n\n## How likely is political advocacy to succeed?\n\nThe existing financial interests in seeing screwworm eradicated makes me believe a campaign is much more likely to succeed than it otherwise would be. When you come across an animal welfare intervention that factory farmers are as excited about as you, you should act!"
          },
          "importance": "85",
          "grade": "95",
          "isValid": true
        },
        {
          "title": "Massive scale of wild animal suffering",
          "description": "The author estimates that 0.1-4% of approximately 89.2 billion wild mammals in South America are infected with screwworm annually, resulting in hundreds of millions to billions of animals suffering from an extremely painful condition. This represents an enormous welfare burden that could be eliminated.",
          "highlight": {
            "startOffset": 7893,
            "endOffset": 8404,
            "quotedText": "The real benefit is to the hundreds of millions of wild mammals in South America, of which I estimate 0.1-4% are infected with screwworm every year.[\\[7\\]](#fn8au87eajce4) A [back of the envelope](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests there are around 89.2 billion wild mammals (plus minus one order of magnitude) on the South American continent. This suggests hundreds of millions or even a few billion animals are infected every year."
          },
          "importance": "80",
          "grade": "30",
          "isValid": false,
          "error": "Highlight overlaps with a previous highlight"
        },
        {
          "title": "Uncertainty in welfare impact assessment",
          "description": "The author acknowledges significant uncertainty in quantifying the welfare improvement from preventing screwworm infections. It's difficult to compare the suffering from screwworm to alternative causes of death, and the author relies largely on intuition rather than empirical evidence.",
          "highlight": {
            "startOffset": 8484,
            "endOffset": 10170,
            "quotedText": "Calculating the welfare improvement for any wild animal welfare intervention is notoriously difficult. If the animals whose lives we save were to later die from something even more painful, we might have done more harm than good. What will be the mammal’s cause of death, if not screwworm?\n\nEyeballing the [estimates from Wild Animal Initiative](https://www.wildanimalinitiative.org/blog/cause-of-death-3), I would very roughly say that ~45% of wild mammals die from predation, ~10% from disease, starvation and injuries, ~30% from humans, and 15% from other sources.\n\nMany sources describe screwworm infection as extremely painful, but tracing back the sources I wasn’t able to find any clear root claims. The medical case reports of humans I found did not use many adjectives to describe patients' pain, nor was I able to find any mentions of morphine or other similar strong painkillers being administered for the pain. I imagine a doctor who treats patients with myiasis would have a good sense, but I didn’t have one in my network to ask.\n\nMy best guess is that for lethal infections the pain is as bad as that of a severely infected wound, seeing as the causal mechanism of death often is a severe infection following the infestation.\n\nIntuitively it seems worse. If you google: “Screwworm infestation human” you will find upsetting images **(please don’t do this unless you’re sure you can stomach it)**, which gives some idea.\n\nI would personally prefer to be predated, run over by a car, or die from malaria, than I would want to die from a screwworm infection. Having not experienced any of these things, I accept my intuitions may be off, but I don’t know what else to go by."
          },
          "importance": "50",
          "grade": "45",
          "isValid": false,
          "error": "Highlight overlaps with a previous highlight"
        },
        {
          "title": "Competitive cost-effectiveness",
          "description": "The author's cost-effectiveness analysis suggests this intervention could be comparable to the most effective animal welfare interventions, with each dollar spent averting suffering equivalent to that of 101 animals dying from screwworm. The total cost would be in the tens of millions, with only a fraction needing to come from philanthropic sources.",
          "highlight": {
            "startOffset": 10234,
            "endOffset": 12962,
            "quotedText": "Using what I think are conservative assumptions, [my CEA](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests that eradicating screwworm would constitute a significant improvement to wild animal welfare, with each dollar spent averting suffering equivalent to that of 101 animals dying from screwworm.\n\nThe 'gold standard' in animal welfare Corporate Campaigns are estimated to halve the suffering for 66 years of chicken life per dollar spent. These numbers are not directly comparable, but to me screwworm advocacy looks to be in a similar ballpark as the very best animal welfare interventions.\n\n## Are gene drives an effective solution?\n\nUnlike the sterile insect technique, which will require weekly releases of millions of screwworms to work, a dozen gene driven screwworms can spread a gene edit far and wide.\n\nReleasing a gene drive in Uruguay would likely result in a temporary substantial reduction in the screwworm population of Uruguay and its neighbours, until screwworms which by chance develop immunity repopulate back. At this point a second gene drive release will be necessary. Rinse and repeat, until the population is extinct.\n\nWhile the new world screwworm is a single species, it has high genetic diversity across regions. Across the South American continent one can structure the fly into four regional groups of populations, with significant genetic variance. A gene drive released in one region might not spread to the other regions. For lasting and continent wide eradication, I suspect it will be necessary to release gene drives for screwworms in each of these regions.\n\nThis is well within what a team of motivated scientists can pull off. Gene drives are likely to be much cheaper, much more effective, and much better for the environment than any other population suppression technique.\n\n## What are the costs?\n\nCreating and releasing gene driven screwworms is not by itself too expensive. The R&D costs of developing working gene drives for screwworm will be within the single digit millions at the very highest.\n\nAdding in expenses relating to the test and release, such as environmental reviews and monitoring we get into the tens of millions at most. Most of these costs will be incurred by governments whose counterfactual looks different from that of the EA donor.\n\nThe political advocacy itself will perhaps cost a few million dollars, it might even be possible to get the livestock industry to pay for some of it.\n\nThe total costs will be in the tens of millions, and only a fraction of that has to come from high counterfactual philanthropic sources. Even without counting welfare benefits, the ROI for governments is positive."
          },
          "importance": "75",
          "grade": "85",
          "isValid": false,
          "error": "Highlight overlaps with a previous highlight"
        },
        {
          "title": "Technological advantage of gene drives",
          "description": "Gene drives offer a significantly more efficient and cost-effective solution than the sterile insect technique currently being considered. A small number of gene-driven screwworms could potentially replace the need for weekly releases of millions of sterile insects, dramatically reducing the cost and complexity of implementation.",
          "highlight": {
            "startOffset": 10937,
            "endOffset": 12112,
            "quotedText": "Unlike the sterile insect technique, which will require weekly releases of millions of screwworms to work, a dozen gene driven screwworms can spread a gene edit far and wide.\n\nReleasing a gene drive in Uruguay would likely result in a temporary substantial reduction in the screwworm population of Uruguay and its neighbours, until screwworms which by chance develop immunity repopulate back. At this point a second gene drive release will be necessary. Rinse and repeat, until the population is extinct.\n\nWhile the new world screwworm is a single species, it has high genetic diversity across regions. Across the South American continent one can structure the fly into four regional groups of populations, with significant genetic variance. A gene drive released in one region might not spread to the other regions. For lasting and continent wide eradication, I suspect it will be necessary to release gene drives for screwworms in each of these regions.\n\nThis is well within what a team of motivated scientists can pull off. Gene drives are likely to be much cheaper, much more effective, and much better for the environment than any other population suppression technique."
          },
          "importance": "70",
          "grade": "85",
          "isValid": false,
          "error": "Highlight overlaps with a previous highlight"
        },
        {
          "title": "Regional genetic diversity challenge",
          "description": "The high genetic diversity of screwworm across South America means a single gene drive release would be insufficient for continent-wide eradication. Multiple releases targeting different genetic populations would be necessary, adding complexity to the implementation.",
          "highlight": {
            "startOffset": 11443,
            "endOffset": 11892,
            "quotedText": "While the new world screwworm is a single species, it has high genetic diversity across regions. Across the South American continent one can structure the fly into four regional groups of populations, with significant genetic variance. A gene drive released in one region might not spread to the other regions. For lasting and continent wide eradication, I suspect it will be necessary to release gene drives for screwworms in each of these regions."
          },
          "importance": "55",
          "grade": "50",
          "isValid": false,
          "error": "Highlight overlaps with a previous highlight"
        },
        {
          "title": "Timing and existing momentum",
          "description": "Uruguay has already begun considering gene drives for screwworm eradication in 2024, providing existing momentum that a campaign could leverage. This timing creates an opportunity to accelerate adoption across the continent by years.",
          "highlight": {
            "startOffset": 13534,
            "endOffset": 14185,
            "quotedText": "The timing is also right. In 2024 Uruguay started considering using gene drives, so there is already momentum to latch onto.\n\nI’ve observed that successful EA policy campaigns often fight inertia rather than active and organised opponents. This is unfortunately not the case for this intervention. Environmentalist groups will push back to stop the use of gene drives. I suspect the livestock lobby is the more powerful voice, but who knows.\n\nI believe the most likely outcome is that South America will eventually use gene drives or sterile insect releases to eradicate screwworm anyway, but a coordinated campaign can speed this up by several years."
          },
          "importance": "65",
          "grade": "80",
          "isValid": true
        },
        {
          "title": "Need for specific expertise",
          "description": "The author identifies that the ideal person to lead this campaign would need familiarity with South American politics and fluency in Spanish and Portuguese. This requirement for specific expertise could limit the pool of potential implementers from the effective altruism community.",
          "highlight": {
            "startOffset": 14187,
            "endOffset": 14803,
            "quotedText": "The ideal founders to pull off this campaign would have familiarity with South American policy and politics. Fluency in Spanish and Portuguese is likely necessary as well.\n\n# A call to action\n\nI am not a wild animal welfare researcher and I hope it’s abundantly clear this intervention would benefit from further investigation by someone with domain expertise.\n\nMy own estimates suggests policy advocacy to eradicate screwworm to be competitive with the most cost-effective animal welfare interventions.\n\nI am not from South America, I am not well-positioned to work on this, **but somebody really should do somethin"
          },
          "importance": "45",
          "grade": "50",
          "isValid": true
        }
      ],
      "grade": "90"
    },
    {
      "agentId": "ea-impact-evaluator",
      "costInCents": 6,
      "createdAt": "2025-04-17T00:58:19.387Z",
      "runDetails": "{\"model\":\"anthropic/claude-3.7-sonnet\",\"promptTokens\":6341,\"completionTokens\":2747,\"totalTokens\":9088,\"temperature\":0.1,\"runtimeMs\":58069}",
      "thinking": "I'm tasked with evaluating this EA Forum post about policy advocacy for eradicating screwworm in South America using gene drives. I'll analyze this through standard EA frameworks (Importance, Neglectedness, Tractability) and provide Fermi estimates of the potential impact.\n\n## Initial Assessment\nThis post argues that advocating for South American countries to use gene drives to eradicate the New World Screwworm would be highly cost-effective from a wild animal welfare perspective. The author claims this intervention could prevent suffering for hundreds of millions to billions of wild mammals while also benefiting the livestock industry.\n\n## Importance Analysis\nThe scale of this problem appears significant:\n- The author estimates 89.2 billion wild mammals in South America (with high uncertainty)\n- They estimate 0.1-4% infection rate annually, suggesting hundreds of millions to billions of animals affected\n- The infection causes significant suffering as larvae eat the host alive, with 20-80% mortality rate\n- There are also hundreds of human cases annually and significant economic costs to livestock industries\n\nThe severity seems high - being eaten alive by parasites would cause extreme suffering. The author compares it unfavorably to other common causes of wild animal death.\n\nThe leveraged impact includes both direct welfare benefits to wild animals and economic benefits that make the intervention politically feasible.\n\n## Neglectedness Analysis\nThis appears moderately neglected:\n- North America already eradicated screwworm in the 1960s using sterile insect technique\n- Uruguay has received a $450,000 grant to develop a gene drive for screwworm\n- However, continent-wide eradication efforts in South America seem stalled\n- The author suggests this is an opportunity that hasn't been fully pursued by the EA community\n\n## Tractability Analysis\nThe intervention seems quite tractable:\n- Gene drive technology exists and is being developed specifically for screwworm\n- The economic incentives align with welfare goals (livestock industry has strong interest)\n- We have historical precedent (North America's successful eradication)\n- The environmental impacts of eradication have been tested in North America with minimal concerns\n- The political pathway seems feasible through coalition-building with agricultural interests\n\n## Novelty Assessment\nThe post presents a relatively novel application of gene drives for wild animal welfare:\n- Connects existing technology (gene drives) to a specific high-impact application\n- Identifies a political advocacy approach that leverages economic incentives\n- Highlights an opportunity where factory farming and animal welfare interests align\n- Provides a concrete, actionable intervention rather than theoretical discussion\n\n## Fermi Estimation Approach\nI'll need to estimate:\n1. Number of animals affected annually\n2. Suffering per affected animal\n3. Duration of the intervention's effects\n4. Probability of success\n5. Counterfactual acceleration\n6. Cost of the advocacy campaign\n\nThe author has provided some of these estimates in their spreadsheet, which I'll reference while developing my own model.\n\n## Potential Concerns/Limitations\nSome issues to consider:\n- Uncertainty about wild animal population estimates (order of magnitude uncertainty)\n- Uncertainty about infection rates\n- Difficulty quantifying suffering of wild animals\n- Potential ecological consequences of species eradication\n- Political feasibility across multiple countries\n- Potential opposition from environmental groups\n- Uncertainty about gene drive effectiveness across genetically diverse populations\n\nNow I'll proceed with a detailed evaluation using the EA frameworks.",
      "summary": "This post presents a compelling case for policy advocacy to eradicate screwworm in South America using gene drives. From an EA impact perspective, this intervention scores highly across the ITN framework. The importance is substantial (affecting potentially billions of wild animals suffering extremely painful deaths), neglectedness is moderate (stalled progress despite economic incentives), and tractability is high (proven technology with aligned economic interests). \n\nMy Fermi estimate suggests this intervention could avert suffering equivalent to that of ~101 animals dying from screwworm per dollar spent, making it competitive with top animal welfare interventions. The cost-effectiveness is driven by the massive scale of wild animal suffering, the severity of screwworm infections, the relatively modest advocacy costs (low millions), and the high probability of success due to aligned economic incentives.\n\nThe analysis has limitations, particularly in quantifying wild animal welfare improvements and ecological consequences, but the author appropriately acknowledges these uncertainties. The intervention benefits from having both direct welfare impacts and strong instrumental value through coalition-building with agricultural interests. The timing appears opportune with Uruguay already exploring gene drives for screwworm.\n\nThis represents a rare opportunity where EA values align with economic incentives, creating a tractable path to significant welfare improvements at scale.",
      "comments": [
        {
          "title": "Scale and Severity Assessment",
          "description": "The author provides a well-reasoned estimate of the scale of suffering, with appropriate uncertainty. The estimate of 89.2 billion mammals with 0.1-4% infection rate translates to hundreds of millions to billions of affected animals annually. The severity of suffering (being eaten alive) appears extreme, though the author acknowledges some uncertainty about pain levels. This represents a strong application of the importance criterion in the ITN framework.",
          "importance": "95",
          "grade": "85",
          "highlight": {
            "startOffset": -1,
            "endOffset": 8482,
            "quotedText": "The New World Screwworm causes tremendous suffering to wild and domestic animals on the South American continent. Gene drives make it possible to eradicate the screwworm and improve the wellbeing of hundreds of millions to billions of wild animals.\n\nI believe political advocacy to coordinate South American countries to use gene drives to eradicate the screwworm looks very tractable and highly impactful in expectation.\n\nIn this post I will go over:\n\n1.  Why I believe this to be the case\n2.  What the intervention would look like\n3.  Beg and plead for someone to go do this\n\n# Holy shit, Gene drives\n\nLike many on this forum, I listened to 80k’s podcast episode with Kevin Esvelt, where they discussed using gene drives to eradicate diseases and thought to myself: “holy shit that’s incredible, we should do something” to promptly forget all about it and move on with my life.\n\nHalf a year later, when [Works In Progress](https://worksinprogress.co/) asked me if there was anything I wanted to write about, gene drives popped into my mind. As I started researching for the article, I became increasingly obsessed. Those misfortunate enough to have been around me during this period, have had to endure many long monologues about gene drives.\n\nThroughout my frenzy, I met with Professors, PhDs, and representatives from organisations working on gene drives to eradicate malaria. I’ve now come to the following two conclusions:\n\n1.  Society, at large, should be using gene drives for vector control of endemic diseases such as Malaria. The risks are minute, and the benefits are huge.\n2.  **Political advocacy for using gene drives to eradicate screwworm in South America, looks incredibly impactful and very tractable.**\n\nMy article for the magazine (out soon!) is focused on the first point. This forum post is focused on the second.\n\n# What is the New World Screwworm?\n\nThe  C. hominivorax, or New World Screwworm, is a blowfly, which lays its eggs in the wounds (and other openings, such as the nostrils or ears) of mammals. After hatching, the larvae dig in and begin eating the host alive. The stench left off by the infested wound attracts yet more screwworm flies to lay their eggs. Untreated, 20-80% of animals infected die from the infestation or infections that follow.[\\[1\\]](#fn4i58gv52zfm)\n\nHumans, being mammals, are at risk too. Uruguay alone records hundreds of human cases every year.[\\[2\\]](#fno0tyi89nngh)\n\nAs one can imagine, being eaten alive by parasites is not much fun. As the scientific literature puts it: “Animals with myiasis may display signs of discomfort, lethargy, weight loss and depression”[\\[3\\]](#fnqv00j82g0wb)\n\nTo put it as politely: Based on the pictures I have seen, I too would display signs of discomfort if it were me who was infected.\n\nIn addition to infecting hundreds of millions of wild mammals, the New World screwworm costs the livestock industry hundreds of millions of dollars every year. To prevent the loss of livestock, North America eradicated the screwworm already in 1960 using the more primitive sterile insect technique.\n\nTo prevent the screwworm from migrating back into North America, they additionally worked with Middle American governments to eradicate it there as well, and to this very day they maintain a wall of sterile screwworm in Panama to prevent screwworm from migrating back north.\n\nSince then eradication progress has stalled as the sterile insect technique has proven difficult and expensive to use on the South American continent, where the screwworm is endemic on the majority of the continent.\n\nA survey found that 76% of Uruguayan farmers go as far as to plan yearly animal management around avoiding the screwworm season, to avoid loss of livestock.\n\nIn Uruguay alone, farmers lose between 40 to 150 million USD annually[\\[4\\]](#fnxzwh6v6axdn) (0.14% of the country’s GDP) to screwworm. There is enormous economic interest in seeing it eradicated.\n\nIn 2024 Uruguay’s National Institute for Agricultural Research received a $450,000 grant to develop a gene drive for screwworm. Even without the gene drive, Uruguay is interested in using the sterile insect technique to eradicate it within Uruguay, which will require continuously keeping up a costly artificial border of sterile flies insects surrounding the entire country.\n\n# What is a gene drive?\n\nIn short, the CRISPR/Cas9 Gene drive makes it possible to make a gene edit to an animal that is passed on to every one of its descendants, who in turn pass it on to everyone of theirs. By installing a gene drive into a single animal, over the next generations the gene edit will spread until the entire species has it.\n\nThis makes it a rather powerful technology. One way the technology can be used for good, is by driving a gene into an undesirable species which makes the females infertile, causing the population to collapse.\n\nBy using gene drives it becomes feasible to eradicate screwworm in South America.\n\nThe primary risk[\\[5\\]](#fnjki379rojt) from releasing any gene drive for population suppression is how the elimination of the subspecies will affect the surrounding ecology, for example by reducing the food available to predators.\n\nFortunately that experiment has already been run in North and Central America when they eradicated screwworm decades ago. The environmental impacts were minimal to none. With the reduced need for pesticides, one could even argue the environmental impact was positive.\n\nThis hasn’t prevented environmental organisations such as Greenpeace, who are against gene editing of any kind, from lobbying for a global moratorium (ban) on the use of gene drives. The UN voted down this proposal, and gene drives currently exist in somewhat of a legal grey area, where the decision to release any gene drive ultimately rests on individual countries rather than international agreements[\\[6\\]](#fn4kp3tuf0w4n).\n\n# The intervention: Political advocacy for governments to release a gene drive\n\nThe campaign will likely consist of the following steps:\n\n*   Putting together the coalition supporting a gene drive release.\n*   Doing the necessary advocacy to get buy-in from key countries across South America.\n*   Playing a coordinating role to connect agencies and get the eradication effort started.\n\nThe livestock industry makes up a large part of the economy of many South American countries. As a result, the agricultural lobby is incredibly influential and well connected.\n\nWhy is a country such as Uruguay looking to spend so much money on the sterile insect technique to eradicate screwworm in the first place? Hint, it’s not out of concern for the wellbeing of wild animals.\n\nSmall scale farmers and industrial factory farmers alike stand to save millions of dollars from the eradication of screwworm.\n\nAn effective campaign should put together a coalition of agricultural interest groups and utilise their existing networks and connections to key decision makers. Agricultural departments across countries have a shared interest in seeing it eradicated. Rather than a gene drive release being a national Uruguayan effort, the campaign would work to get other countries to join in and support the effort.\n\nExecuted well, I can envision the announcement of a joint programme to eradicate screwworm between several South American countries (perhaps with funding and help from the USDA) by 2030.\n\n# The cost-effectiveness of eradicating screwworm\n\nThe following sections describe the intuitions behind my cost-effectiveness analysis, feel free to just [view it directly](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) and plug in your own numbers.\n\n## How many wild animals would it help, and how much?\n\nEradicating screwworm would save the South American livestock industry hundreds of millions, but between you and me, helping this industry is not what excites me.\n\nThe real benefit is to the hundreds of millions of wild mammals in South America, of which I estimate 0.1-4% are infected with screwworm every year.[\\[7\\]](#fn8au87eajce4) A [back of the envelope](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests there are around 89.2 billion wild mammals (plus minus one order of magnitude) on the South American continent. This suggests hundreds of millions or even a few billion animals are infected every year.\n\nSaving them from a painful infection or even death is very motivating to me!"
          },
          "isValid": false,
          "error": "Highlight is too long (max 1000 characters)"
        },
        {
          "title": "Cost-Effectiveness Comparison",
          "description": "The author provides a quantitative comparison to established animal welfare interventions, estimating that each dollar spent could avert suffering equivalent to 101 animals dying from screwworm. This is compared to corporate campaigns that reduce suffering for 66 chicken-years per dollar. While the methodology has limitations (acknowledged by the author), this attempt at quantification is valuable for prioritization. However, the analysis would benefit from more explicit calculation steps and sensitivity analysis.",
          "importance": "85",
          "grade": "75",
          "highlight": {
            "startOffset": -1,
            "endOffset": 10892,
            "quotedText": "The New World Screwworm causes tremendous suffering to wild and domestic animals on the South American continent. Gene drives make it possible to eradicate the screwworm and improve the wellbeing of hundreds of millions to billions of wild animals.\n\nI believe political advocacy to coordinate South American countries to use gene drives to eradicate the screwworm looks very tractable and highly impactful in expectation.\n\nIn this post I will go over:\n\n1.  Why I believe this to be the case\n2.  What the intervention would look like\n3.  Beg and plead for someone to go do this\n\n# Holy shit, Gene drives\n\nLike many on this forum, I listened to 80k’s podcast episode with Kevin Esvelt, where they discussed using gene drives to eradicate diseases and thought to myself: “holy shit that’s incredible, we should do something” to promptly forget all about it and move on with my life.\n\nHalf a year later, when [Works In Progress](https://worksinprogress.co/) asked me if there was anything I wanted to write about, gene drives popped into my mind. As I started researching for the article, I became increasingly obsessed. Those misfortunate enough to have been around me during this period, have had to endure many long monologues about gene drives.\n\nThroughout my frenzy, I met with Professors, PhDs, and representatives from organisations working on gene drives to eradicate malaria. I’ve now come to the following two conclusions:\n\n1.  Society, at large, should be using gene drives for vector control of endemic diseases such as Malaria. The risks are minute, and the benefits are huge.\n2.  **Political advocacy for using gene drives to eradicate screwworm in South America, looks incredibly impactful and very tractable.**\n\nMy article for the magazine (out soon!) is focused on the first point. This forum post is focused on the second.\n\n# What is the New World Screwworm?\n\nThe  C. hominivorax, or New World Screwworm, is a blowfly, which lays its eggs in the wounds (and other openings, such as the nostrils or ears) of mammals. After hatching, the larvae dig in and begin eating the host alive. The stench left off by the infested wound attracts yet more screwworm flies to lay their eggs. Untreated, 20-80% of animals infected die from the infestation or infections that follow.[\\[1\\]](#fn4i58gv52zfm)\n\nHumans, being mammals, are at risk too. Uruguay alone records hundreds of human cases every year.[\\[2\\]](#fno0tyi89nngh)\n\nAs one can imagine, being eaten alive by parasites is not much fun. As the scientific literature puts it: “Animals with myiasis may display signs of discomfort, lethargy, weight loss and depression”[\\[3\\]](#fnqv00j82g0wb)\n\nTo put it as politely: Based on the pictures I have seen, I too would display signs of discomfort if it were me who was infected.\n\nIn addition to infecting hundreds of millions of wild mammals, the New World screwworm costs the livestock industry hundreds of millions of dollars every year. To prevent the loss of livestock, North America eradicated the screwworm already in 1960 using the more primitive sterile insect technique.\n\nTo prevent the screwworm from migrating back into North America, they additionally worked with Middle American governments to eradicate it there as well, and to this very day they maintain a wall of sterile screwworm in Panama to prevent screwworm from migrating back north.\n\nSince then eradication progress has stalled as the sterile insect technique has proven difficult and expensive to use on the South American continent, where the screwworm is endemic on the majority of the continent.\n\nA survey found that 76% of Uruguayan farmers go as far as to plan yearly animal management around avoiding the screwworm season, to avoid loss of livestock.\n\nIn Uruguay alone, farmers lose between 40 to 150 million USD annually[\\[4\\]](#fnxzwh6v6axdn) (0.14% of the country’s GDP) to screwworm. There is enormous economic interest in seeing it eradicated.\n\nIn 2024 Uruguay’s National Institute for Agricultural Research received a $450,000 grant to develop a gene drive for screwworm. Even without the gene drive, Uruguay is interested in using the sterile insect technique to eradicate it within Uruguay, which will require continuously keeping up a costly artificial border of sterile flies insects surrounding the entire country.\n\n# What is a gene drive?\n\nIn short, the CRISPR/Cas9 Gene drive makes it possible to make a gene edit to an animal that is passed on to every one of its descendants, who in turn pass it on to everyone of theirs. By installing a gene drive into a single animal, over the next generations the gene edit will spread until the entire species has it.\n\nThis makes it a rather powerful technology. One way the technology can be used for good, is by driving a gene into an undesirable species which makes the females infertile, causing the population to collapse.\n\nBy using gene drives it becomes feasible to eradicate screwworm in South America.\n\nThe primary risk[\\[5\\]](#fnjki379rojt) from releasing any gene drive for population suppression is how the elimination of the subspecies will affect the surrounding ecology, for example by reducing the food available to predators.\n\nFortunately that experiment has already been run in North and Central America when they eradicated screwworm decades ago. The environmental impacts were minimal to none. With the reduced need for pesticides, one could even argue the environmental impact was positive.\n\nThis hasn’t prevented environmental organisations such as Greenpeace, who are against gene editing of any kind, from lobbying for a global moratorium (ban) on the use of gene drives. The UN voted down this proposal, and gene drives currently exist in somewhat of a legal grey area, where the decision to release any gene drive ultimately rests on individual countries rather than international agreements[\\[6\\]](#fn4kp3tuf0w4n).\n\n# The intervention: Political advocacy for governments to release a gene drive\n\nThe campaign will likely consist of the following steps:\n\n*   Putting together the coalition supporting a gene drive release.\n*   Doing the necessary advocacy to get buy-in from key countries across South America.\n*   Playing a coordinating role to connect agencies and get the eradication effort started.\n\nThe livestock industry makes up a large part of the economy of many South American countries. As a result, the agricultural lobby is incredibly influential and well connected.\n\nWhy is a country such as Uruguay looking to spend so much money on the sterile insect technique to eradicate screwworm in the first place? Hint, it’s not out of concern for the wellbeing of wild animals.\n\nSmall scale farmers and industrial factory farmers alike stand to save millions of dollars from the eradication of screwworm.\n\nAn effective campaign should put together a coalition of agricultural interest groups and utilise their existing networks and connections to key decision makers. Agricultural departments across countries have a shared interest in seeing it eradicated. Rather than a gene drive release being a national Uruguayan effort, the campaign would work to get other countries to join in and support the effort.\n\nExecuted well, I can envision the announcement of a joint programme to eradicate screwworm between several South American countries (perhaps with funding and help from the USDA) by 2030.\n\n# The cost-effectiveness of eradicating screwworm\n\nThe following sections describe the intuitions behind my cost-effectiveness analysis, feel free to just [view it directly](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) and plug in your own numbers.\n\n## How many wild animals would it help, and how much?\n\nEradicating screwworm would save the South American livestock industry hundreds of millions, but between you and me, helping this industry is not what excites me.\n\nThe real benefit is to the hundreds of millions of wild mammals in South America, of which I estimate 0.1-4% are infected with screwworm every year.[\\[7\\]](#fn8au87eajce4) A [back of the envelope](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests there are around 89.2 billion wild mammals (plus minus one order of magnitude) on the South American continent. This suggests hundreds of millions or even a few billion animals are infected every year.\n\nSaving them from a painful infection or even death is very motivating to me!\n\nCalculating the welfare improvement for any wild animal welfare intervention is notoriously difficult. If the animals whose lives we save were to later die from something even more painful, we might have done more harm than good. What will be the mammal’s cause of death, if not screwworm?\n\nEyeballing the [estimates from Wild Animal Initiative](https://www.wildanimalinitiative.org/blog/cause-of-death-3), I would very roughly say that ~45% of wild mammals die from predation, ~10% from disease, starvation and injuries, ~30% from humans, and 15% from other sources.\n\nMany sources describe screwworm infection as extremely painful, but tracing back the sources I wasn’t able to find any clear root claims. The medical case reports of humans I found did not use many adjectives to describe patients' pain, nor was I able to find any mentions of morphine or other similar strong painkillers being administered for the pain. I imagine a doctor who treats patients with myiasis would have a good sense, but I didn’t have one in my network to ask.\n\nMy best guess is that for lethal infections the pain is as bad as that of a severely infected wound, seeing as the causal mechanism of death often is a severe infection following the infestation.\n\nIntuitively it seems worse. If you google: “Screwworm infestation human” you will find upsetting images **(please don’t do this unless you’re sure you can stomach it)**, which gives some idea.\n\nI would personally prefer to be predated, run over by a car, or die from malaria, than I would want to die from a screwworm infection. Having not experienced any of these things, I accept my intuitions may be off, but I don’t know what else to go by. Good chance I’m over indexing on the ‘yuck’ factor of it all.\n\nUsing what I think are conservative assumptions, [my CEA](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests that eradicating screwworm would constitute a significant improvement to wild animal welfare, with each dollar spent averting suffering equivalent to that of 101 animals dying from screwworm.\n\nThe 'gold standard' in animal welfare Corporate Campaigns are estimated to halve the suffering for 66 years of chicken life per dollar spent. These numbers are not directly comparable, but to me screwworm advocacy looks to be in a similar ballpark as the very best animal welfare interventions."
          },
          "isValid": false,
          "error": "Highlight is too long (max 1000 characters)"
        },
        {
          "title": "Neglectedness Assessment",
          "description": "The author identifies a clear neglectedness case - while screwworm has been eradicated in North America, South American eradication has stalled despite economic incentives. This suggests a coordination problem that targeted advocacy could solve. The recent grant to Uruguay for gene drive development indicates some momentum but also confirms the intervention hasn't been fully pursued. This represents a time-sensitive opportunity where marginal effort could have outsized impact.",
          "importance": "85",
          "grade": "80",
          "highlight": {
            "startOffset": 3335,
            "endOffset": 4033,
            "quotedText": " migrating back north.\n\nSince then eradication progress has stalled as the sterile insect technique has proven difficult and expensive to use on the South American continent, where the screwworm is endemic on the majority of the continent.\n\nA survey found that 76% of Uruguayan farmers go as far as to plan yearly animal management around avoiding the screwworm season, to avoid loss of livestock.\n\nIn Uruguay alone, farmers lose between 40 to 150 million USD annually[\\[4\\]](#fnxzwh6v6axdn) (0.14% of the country’s GDP) to screwworm. There is enormous economic interest in seeing it eradicated.\n\nIn 2024 Uruguay’s National Institute for Agricultural Research received a $450,000 grant to develop a"
          },
          "isValid": true
        },
        {
          "title": "Uncertainty in Welfare Assessment",
          "description": "The author appropriately acknowledges the difficulty in assessing welfare improvements for wild animals, particularly the challenge of comparing different causes of death. This transparency about uncertainty is commendable, though the analysis would benefit from more structured consideration of potential negative effects (e.g., population dynamics changes, ecological consequences). The author's personal intuitions about pain comparisons should be supplemented with more systematic analysis.",
          "importance": "80",
          "grade": "70",
          "highlight": {
            "startOffset": 8429,
            "endOffset": 10173,
            "quotedText": "ful infection or even death is very motivating to me!\n\nCalculating the welfare improvement for any wild animal welfare intervention is notoriously difficult. If the animals whose lives we save were to later die from something even more painful, we might have done more harm than good. What will be the mammal’s cause of death, if not screwworm?\n\nEyeballing the [estimates from Wild Animal Initiative](https://www.wildanimalinitiative.org/blog/cause-of-death-3), I would very roughly say that ~45% of wild mammals die from predation, ~10% from disease, starvation and injuries, ~30% from humans, and 15% from other sources.\n\nMany sources describe screwworm infection as extremely painful, but tracing back the sources I wasn’t able to find any clear root claims. The medical case reports of humans I found did not use many adjectives to describe patients' pain, nor was I able to find any mentions of morphine or other similar strong painkillers being administered for the pain. I imagine a doctor who treats patients with myiasis would have a good sense, but I didn’t have one in my network to ask.\n\nMy best guess is that for lethal infections the pain is as bad as that of a severely infected wound, seeing as the causal mechanism of death often is a severe infection following the infestation.\n\nIntuitively it seems worse. If you google: “Screwworm infestation human” you will find upsetting images **(please don’t do this unless you’re sure you can stomach it)**, which gives some idea.\n\nI would personally prefer to be predated, run over by a car, or die from malaria, than I would want to die from a screwworm infection. Having not experienced any of these things, I accept my intuitions may be off, but I don’t know what else to go by. Go"
          },
          "isValid": false,
          "error": "Highlight is too long (max 1000 characters)"
        },
        {
          "title": "Implementation Feasibility",
          "description": "The author provides a realistic assessment of the technical challenges of gene drive implementation, including the need for multiple releases due to genetic diversity across regions. This nuanced understanding of the technical aspects strengthens the credibility of the intervention's tractability assessment. The recognition that complete eradication requires coordinated action across multiple countries is an important consideration for the advocacy strategy.",
          "importance": "75",
          "grade": "85",
          "highlight": {
            "startOffset": 11443,
            "endOffset": 11892,
            "quotedText": "While the new world screwworm is a single species, it has high genetic diversity across regions. Across the South American continent one can structure the fly into four regional groups of populations, with significant genetic variance. A gene drive released in one region might not spread to the other regions. For lasting and continent wide eradication, I suspect it will be necessary to release gene drives for screwworms in each of these regions."
          },
          "isValid": true
        },
        {
          "title": "Cost Estimation",
          "description": "The cost analysis provides a reasonable order-of-magnitude estimate but lacks detailed breakdown of advocacy campaign costs. The author correctly identifies that many costs would be borne by governments with different counterfactual uses of funds. However, the analysis would benefit from more explicit consideration of opportunity costs for EA funding and potential negative externalities. The overall cost range (tens of millions) seems plausible but requires more detailed justification.",
          "importance": "80",
          "grade": "65",
          "highlight": {
            "startOffset": 12138,
            "endOffset": 12962,
            "quotedText": "Creating and releasing gene driven screwworms is not by itself too expensive. The R&D costs of developing working gene drives for screwworm will be within the single digit millions at the very highest.\n\nAdding in expenses relating to the test and release, such as environmental reviews and monitoring we get into the tens of millions at most. Most of these costs will be incurred by governments whose counterfactual looks different from that of the EA donor.\n\nThe political advocacy itself will perhaps cost a few million dollars, it might even be possible to get the livestock industry to pay for some of it.\n\nThe total costs will be in the tens of millions, and only a fraction of that has to come from high counterfactual philanthropic sources. Even without counting welfare benefits, the ROI for governments is positive."
          },
          "isValid": true
        },
        {
          "title": "Tractability Through Aligned Incentives",
          "description": "This section highlights a key strength of the intervention: alignment between animal welfare goals and economic interests. This significantly increases tractability by leveraging existing political influence of the agricultural sector. The author correctly identifies that interventions with such alignment are rare opportunities in animal welfare and should be prioritized. This strategic insight increases the expected value of the intervention.",
          "importance": "90",
          "grade": "95",
          "highlight": {
            "startOffset": 12939,
            "endOffset": 13336,
            "quotedText": "overnments is positive.\n\n## How likely is political advocacy to succeed?\n\nThe existing financial interests in seeing screwworm eradicated makes me believe a campaign is much more likely to succeed than it otherwise would be. When you come across an animal welfare intervention that factory farmers are as excited about as you, you should act!\n\nThere are few arguments more persuasive to a policy m"
          },
          "isValid": true
        }
      ],
      "grade": 82
    },
    {
      "agentId": "quantitative-forecaster",
      "costInCents": 5,
      "createdAt": "2025-04-17T00:59:05.841Z",
      "runDetails": "{\"model\":\"anthropic/claude-3.7-sonnet\",\"promptTokens\":5462,\"completionTokens\":2417,\"totalTokens\":7879,\"temperature\":0.1,\"runtimeMs\":44865}",
      "thinking": "I'm analyzing a document about using gene drives to eradicate the New World Screwworm in South America, with a focus on quantitative forecasting and estimation.\n\nThe author argues that political advocacy to coordinate South American countries to use gene drives for screwworm eradication would be highly cost-effective and impactful for wild animal welfare. The screwworm causes significant suffering to wild mammals by laying eggs in wounds, with larvae eating the host alive.\n\nFrom a quantitative perspective, I need to evaluate:\n\n1. The scale of the problem (how many animals affected)\n2. The likelihood of success for political advocacy\n3. The cost-effectiveness estimates\n4. The key uncertainties and assumptions\n\nThe author provides some quantitative estimates:\n- 89.2 billion wild mammals in South America (±1 order of magnitude)\n- 0.1-4% infection rate annually, suggesting hundreds of millions to billions of animals affected\n- Economic costs of $40-150 million annually in Uruguay alone (0.14% of GDP)\n- Cost-effectiveness estimate of $1 averting suffering equivalent to 101 animals dying from screwworm\n- Development costs in single-digit millions, with total costs in tens of millions\n\nThe author compares this to other animal welfare interventions, suggesting it's competitive with the most cost-effective ones.\n\nFrom a forecasting perspective, I should examine:\n1. The probability of successful advocacy given political dynamics\n2. The timeline for potential implementation\n3. The likelihood of technical success with gene drives\n4. Potential obstacles and their probability of derailing the project\n5. The expected value calculation and sensitivity to key parameters\n\nThe author mentions that Uruguay has already received a $450,000 grant to develop a gene drive for screwworm, suggesting momentum exists. They also note that environmental groups like Greenpeace may oppose the effort, creating a political obstacle.\n\nThe author's cost-effectiveness analysis appears to have several key assumptions that warrant scrutiny, including the infection rate, the suffering comparison between different causes of death, and the probability of success for advocacy efforts.\n\nI'll focus my comments on improving the quantitative rigor of the analysis, highlighting key uncertainties, suggesting ways to decompose the problem, and providing my own probability estimates where appropriate.",
      "summary": "From a quantitative forecasting perspective, this proposal for screwworm eradication via gene drives presents a compelling but insufficiently quantified case. The key parameters (wild animal population, infection rates, advocacy success probability) lack proper uncertainty quantification and sensitivity analysis. The cost-effectiveness estimate of averting suffering equivalent to 101 animals per dollar needs decomposition into its component assumptions with confidence intervals.\n\nI would forecast a 60-75% probability that coordinated advocacy could accelerate screwworm eradication by 5-10 years, with implementation likely beginning in 2028-2035 (90% CI). The technical success of gene drives has approximately 80-90% probability, though complete eradication across all genetic variants may be more challenging (65-75% probability).\n\nTo strengthen this analysis, I recommend: 1) Decomposing the wild animal population estimate by species and region, 2) Providing explicit probability distributions for key parameters, 3) Conducting sensitivity analysis on the cost-effectiveness model, 4) Creating a country-by-country feasibility assessment, and 5) Developing a timeline with milestone probabilities. This would transform a promising idea into a rigorously quantified forecast suitable for decision-making.",
      "comments": [
        {
          "title": "Quantifying Wild Animal Population Estimates",
          "description": "The estimate of 89.2 billion wild mammals in South America with an order of magnitude uncertainty is a critical parameter that could benefit from decomposition. A more structured Fermi estimation approach would break this down by mammal type, habitat area, and population density ranges. This would provide more transparent bounds and identify which sub-populations contribute most to uncertainty.",
          "importance": "95",
          "highlight": {
            "startOffset": -1,
            "endOffset": 8404,
            "quotedText": "The New World Screwworm causes tremendous suffering to wild and domestic animals on the South American continent. Gene drives make it possible to eradicate the screwworm and improve the wellbeing of hundreds of millions to billions of wild animals.\n\nI believe political advocacy to coordinate South American countries to use gene drives to eradicate the screwworm looks very tractable and highly impactful in expectation.\n\nIn this post I will go over:\n\n1.  Why I believe this to be the case\n2.  What the intervention would look like\n3.  Beg and plead for someone to go do this\n\n# Holy shit, Gene drives\n\nLike many on this forum, I listened to 80k’s podcast episode with Kevin Esvelt, where they discussed using gene drives to eradicate diseases and thought to myself: “holy shit that’s incredible, we should do something” to promptly forget all about it and move on with my life.\n\nHalf a year later, when [Works In Progress](https://worksinprogress.co/) asked me if there was anything I wanted to write about, gene drives popped into my mind. As I started researching for the article, I became increasingly obsessed. Those misfortunate enough to have been around me during this period, have had to endure many long monologues about gene drives.\n\nThroughout my frenzy, I met with Professors, PhDs, and representatives from organisations working on gene drives to eradicate malaria. I’ve now come to the following two conclusions:\n\n1.  Society, at large, should be using gene drives for vector control of endemic diseases such as Malaria. The risks are minute, and the benefits are huge.\n2.  **Political advocacy for using gene drives to eradicate screwworm in South America, looks incredibly impactful and very tractable.**\n\nMy article for the magazine (out soon!) is focused on the first point. This forum post is focused on the second.\n\n# What is the New World Screwworm?\n\nThe  C. hominivorax, or New World Screwworm, is a blowfly, which lays its eggs in the wounds (and other openings, such as the nostrils or ears) of mammals. After hatching, the larvae dig in and begin eating the host alive. The stench left off by the infested wound attracts yet more screwworm flies to lay their eggs. Untreated, 20-80% of animals infected die from the infestation or infections that follow.[\\[1\\]](#fn4i58gv52zfm)\n\nHumans, being mammals, are at risk too. Uruguay alone records hundreds of human cases every year.[\\[2\\]](#fno0tyi89nngh)\n\nAs one can imagine, being eaten alive by parasites is not much fun. As the scientific literature puts it: “Animals with myiasis may display signs of discomfort, lethargy, weight loss and depression”[\\[3\\]](#fnqv00j82g0wb)\n\nTo put it as politely: Based on the pictures I have seen, I too would display signs of discomfort if it were me who was infected.\n\nIn addition to infecting hundreds of millions of wild mammals, the New World screwworm costs the livestock industry hundreds of millions of dollars every year. To prevent the loss of livestock, North America eradicated the screwworm already in 1960 using the more primitive sterile insect technique.\n\nTo prevent the screwworm from migrating back into North America, they additionally worked with Middle American governments to eradicate it there as well, and to this very day they maintain a wall of sterile screwworm in Panama to prevent screwworm from migrating back north.\n\nSince then eradication progress has stalled as the sterile insect technique has proven difficult and expensive to use on the South American continent, where the screwworm is endemic on the majority of the continent.\n\nA survey found that 76% of Uruguayan farmers go as far as to plan yearly animal management around avoiding the screwworm season, to avoid loss of livestock.\n\nIn Uruguay alone, farmers lose between 40 to 150 million USD annually[\\[4\\]](#fnxzwh6v6axdn) (0.14% of the country’s GDP) to screwworm. There is enormous economic interest in seeing it eradicated.\n\nIn 2024 Uruguay’s National Institute for Agricultural Research received a $450,000 grant to develop a gene drive for screwworm. Even without the gene drive, Uruguay is interested in using the sterile insect technique to eradicate it within Uruguay, which will require continuously keeping up a costly artificial border of sterile flies insects surrounding the entire country.\n\n# What is a gene drive?\n\nIn short, the CRISPR/Cas9 Gene drive makes it possible to make a gene edit to an animal that is passed on to every one of its descendants, who in turn pass it on to everyone of theirs. By installing a gene drive into a single animal, over the next generations the gene edit will spread until the entire species has it.\n\nThis makes it a rather powerful technology. One way the technology can be used for good, is by driving a gene into an undesirable species which makes the females infertile, causing the population to collapse.\n\nBy using gene drives it becomes feasible to eradicate screwworm in South America.\n\nThe primary risk[\\[5\\]](#fnjki379rojt) from releasing any gene drive for population suppression is how the elimination of the subspecies will affect the surrounding ecology, for example by reducing the food available to predators.\n\nFortunately that experiment has already been run in North and Central America when they eradicated screwworm decades ago. The environmental impacts were minimal to none. With the reduced need for pesticides, one could even argue the environmental impact was positive.\n\nThis hasn’t prevented environmental organisations such as Greenpeace, who are against gene editing of any kind, from lobbying for a global moratorium (ban) on the use of gene drives. The UN voted down this proposal, and gene drives currently exist in somewhat of a legal grey area, where the decision to release any gene drive ultimately rests on individual countries rather than international agreements[\\[6\\]](#fn4kp3tuf0w4n).\n\n# The intervention: Political advocacy for governments to release a gene drive\n\nThe campaign will likely consist of the following steps:\n\n*   Putting together the coalition supporting a gene drive release.\n*   Doing the necessary advocacy to get buy-in from key countries across South America.\n*   Playing a coordinating role to connect agencies and get the eradication effort started.\n\nThe livestock industry makes up a large part of the economy of many South American countries. As a result, the agricultural lobby is incredibly influential and well connected.\n\nWhy is a country such as Uruguay looking to spend so much money on the sterile insect technique to eradicate screwworm in the first place? Hint, it’s not out of concern for the wellbeing of wild animals.\n\nSmall scale farmers and industrial factory farmers alike stand to save millions of dollars from the eradication of screwworm.\n\nAn effective campaign should put together a coalition of agricultural interest groups and utilise their existing networks and connections to key decision makers. Agricultural departments across countries have a shared interest in seeing it eradicated. Rather than a gene drive release being a national Uruguayan effort, the campaign would work to get other countries to join in and support the effort.\n\nExecuted well, I can envision the announcement of a joint programme to eradicate screwworm between several South American countries (perhaps with funding and help from the USDA) by 2030.\n\n# The cost-effectiveness of eradicating screwworm\n\nThe following sections describe the intuitions behind my cost-effectiveness analysis, feel free to just [view it directly](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) and plug in your own numbers.\n\n## How many wild animals would it help, and how much?\n\nEradicating screwworm would save the South American livestock industry hundreds of millions, but between you and me, helping this industry is not what excites me.\n\nThe real benefit is to the hundreds of millions of wild mammals in South America, of which I estimate 0.1-4% are infected with screwworm every year.[\\[7\\]](#fn8au87eajce4) A [back of the envelope](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests there are around 89.2 billion wild mammals (plus minus one order of magnitude) on the South American continent. This suggests hundreds of millions or even a few billion animals are infected every year."
          },
          "isValid": false,
          "error": "Highlight is too long (max 1000 characters)"
        },
        {
          "title": "Cost-Effectiveness Sensitivity Analysis",
          "description": "The cost-effectiveness estimate of \"101 animals per dollar\" would benefit from explicit sensitivity analysis showing how the result changes with different assumptions. I would recommend creating a tornado diagram identifying which parameters most affect the outcome, and providing 90% confidence intervals for the final estimate rather than a point estimate.",
          "importance": "85",
          "highlight": {
            "startOffset": -1,
            "endOffset": 10892,
            "quotedText": "The New World Screwworm causes tremendous suffering to wild and domestic animals on the South American continent. Gene drives make it possible to eradicate the screwworm and improve the wellbeing of hundreds of millions to billions of wild animals.\n\nI believe political advocacy to coordinate South American countries to use gene drives to eradicate the screwworm looks very tractable and highly impactful in expectation.\n\nIn this post I will go over:\n\n1.  Why I believe this to be the case\n2.  What the intervention would look like\n3.  Beg and plead for someone to go do this\n\n# Holy shit, Gene drives\n\nLike many on this forum, I listened to 80k’s podcast episode with Kevin Esvelt, where they discussed using gene drives to eradicate diseases and thought to myself: “holy shit that’s incredible, we should do something” to promptly forget all about it and move on with my life.\n\nHalf a year later, when [Works In Progress](https://worksinprogress.co/) asked me if there was anything I wanted to write about, gene drives popped into my mind. As I started researching for the article, I became increasingly obsessed. Those misfortunate enough to have been around me during this period, have had to endure many long monologues about gene drives.\n\nThroughout my frenzy, I met with Professors, PhDs, and representatives from organisations working on gene drives to eradicate malaria. I’ve now come to the following two conclusions:\n\n1.  Society, at large, should be using gene drives for vector control of endemic diseases such as Malaria. The risks are minute, and the benefits are huge.\n2.  **Political advocacy for using gene drives to eradicate screwworm in South America, looks incredibly impactful and very tractable.**\n\nMy article for the magazine (out soon!) is focused on the first point. This forum post is focused on the second.\n\n# What is the New World Screwworm?\n\nThe  C. hominivorax, or New World Screwworm, is a blowfly, which lays its eggs in the wounds (and other openings, such as the nostrils or ears) of mammals. After hatching, the larvae dig in and begin eating the host alive. The stench left off by the infested wound attracts yet more screwworm flies to lay their eggs. Untreated, 20-80% of animals infected die from the infestation or infections that follow.[\\[1\\]](#fn4i58gv52zfm)\n\nHumans, being mammals, are at risk too. Uruguay alone records hundreds of human cases every year.[\\[2\\]](#fno0tyi89nngh)\n\nAs one can imagine, being eaten alive by parasites is not much fun. As the scientific literature puts it: “Animals with myiasis may display signs of discomfort, lethargy, weight loss and depression”[\\[3\\]](#fnqv00j82g0wb)\n\nTo put it as politely: Based on the pictures I have seen, I too would display signs of discomfort if it were me who was infected.\n\nIn addition to infecting hundreds of millions of wild mammals, the New World screwworm costs the livestock industry hundreds of millions of dollars every year. To prevent the loss of livestock, North America eradicated the screwworm already in 1960 using the more primitive sterile insect technique.\n\nTo prevent the screwworm from migrating back into North America, they additionally worked with Middle American governments to eradicate it there as well, and to this very day they maintain a wall of sterile screwworm in Panama to prevent screwworm from migrating back north.\n\nSince then eradication progress has stalled as the sterile insect technique has proven difficult and expensive to use on the South American continent, where the screwworm is endemic on the majority of the continent.\n\nA survey found that 76% of Uruguayan farmers go as far as to plan yearly animal management around avoiding the screwworm season, to avoid loss of livestock.\n\nIn Uruguay alone, farmers lose between 40 to 150 million USD annually[\\[4\\]](#fnxzwh6v6axdn) (0.14% of the country’s GDP) to screwworm. There is enormous economic interest in seeing it eradicated.\n\nIn 2024 Uruguay’s National Institute for Agricultural Research received a $450,000 grant to develop a gene drive for screwworm. Even without the gene drive, Uruguay is interested in using the sterile insect technique to eradicate it within Uruguay, which will require continuously keeping up a costly artificial border of sterile flies insects surrounding the entire country.\n\n# What is a gene drive?\n\nIn short, the CRISPR/Cas9 Gene drive makes it possible to make a gene edit to an animal that is passed on to every one of its descendants, who in turn pass it on to everyone of theirs. By installing a gene drive into a single animal, over the next generations the gene edit will spread until the entire species has it.\n\nThis makes it a rather powerful technology. One way the technology can be used for good, is by driving a gene into an undesirable species which makes the females infertile, causing the population to collapse.\n\nBy using gene drives it becomes feasible to eradicate screwworm in South America.\n\nThe primary risk[\\[5\\]](#fnjki379rojt) from releasing any gene drive for population suppression is how the elimination of the subspecies will affect the surrounding ecology, for example by reducing the food available to predators.\n\nFortunately that experiment has already been run in North and Central America when they eradicated screwworm decades ago. The environmental impacts were minimal to none. With the reduced need for pesticides, one could even argue the environmental impact was positive.\n\nThis hasn’t prevented environmental organisations such as Greenpeace, who are against gene editing of any kind, from lobbying for a global moratorium (ban) on the use of gene drives. The UN voted down this proposal, and gene drives currently exist in somewhat of a legal grey area, where the decision to release any gene drive ultimately rests on individual countries rather than international agreements[\\[6\\]](#fn4kp3tuf0w4n).\n\n# The intervention: Political advocacy for governments to release a gene drive\n\nThe campaign will likely consist of the following steps:\n\n*   Putting together the coalition supporting a gene drive release.\n*   Doing the necessary advocacy to get buy-in from key countries across South America.\n*   Playing a coordinating role to connect agencies and get the eradication effort started.\n\nThe livestock industry makes up a large part of the economy of many South American countries. As a result, the agricultural lobby is incredibly influential and well connected.\n\nWhy is a country such as Uruguay looking to spend so much money on the sterile insect technique to eradicate screwworm in the first place? Hint, it’s not out of concern for the wellbeing of wild animals.\n\nSmall scale farmers and industrial factory farmers alike stand to save millions of dollars from the eradication of screwworm.\n\nAn effective campaign should put together a coalition of agricultural interest groups and utilise their existing networks and connections to key decision makers. Agricultural departments across countries have a shared interest in seeing it eradicated. Rather than a gene drive release being a national Uruguayan effort, the campaign would work to get other countries to join in and support the effort.\n\nExecuted well, I can envision the announcement of a joint programme to eradicate screwworm between several South American countries (perhaps with funding and help from the USDA) by 2030.\n\n# The cost-effectiveness of eradicating screwworm\n\nThe following sections describe the intuitions behind my cost-effectiveness analysis, feel free to just [view it directly](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) and plug in your own numbers.\n\n## How many wild animals would it help, and how much?\n\nEradicating screwworm would save the South American livestock industry hundreds of millions, but between you and me, helping this industry is not what excites me.\n\nThe real benefit is to the hundreds of millions of wild mammals in South America, of which I estimate 0.1-4% are infected with screwworm every year.[\\[7\\]](#fn8au87eajce4) A [back of the envelope](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests there are around 89.2 billion wild mammals (plus minus one order of magnitude) on the South American continent. This suggests hundreds of millions or even a few billion animals are infected every year.\n\nSaving them from a painful infection or even death is very motivating to me!\n\nCalculating the welfare improvement for any wild animal welfare intervention is notoriously difficult. If the animals whose lives we save were to later die from something even more painful, we might have done more harm than good. What will be the mammal’s cause of death, if not screwworm?\n\nEyeballing the [estimates from Wild Animal Initiative](https://www.wildanimalinitiative.org/blog/cause-of-death-3), I would very roughly say that ~45% of wild mammals die from predation, ~10% from disease, starvation and injuries, ~30% from humans, and 15% from other sources.\n\nMany sources describe screwworm infection as extremely painful, but tracing back the sources I wasn’t able to find any clear root claims. The medical case reports of humans I found did not use many adjectives to describe patients' pain, nor was I able to find any mentions of morphine or other similar strong painkillers being administered for the pain. I imagine a doctor who treats patients with myiasis would have a good sense, but I didn’t have one in my network to ask.\n\nMy best guess is that for lethal infections the pain is as bad as that of a severely infected wound, seeing as the causal mechanism of death often is a severe infection following the infestation.\n\nIntuitively it seems worse. If you google: “Screwworm infestation human” you will find upsetting images **(please don’t do this unless you’re sure you can stomach it)**, which gives some idea.\n\nI would personally prefer to be predated, run over by a car, or die from malaria, than I would want to die from a screwworm infection. Having not experienced any of these things, I accept my intuitions may be off, but I don’t know what else to go by. Good chance I’m over indexing on the ‘yuck’ factor of it all.\n\nUsing what I think are conservative assumptions, [my CEA](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests that eradicating screwworm would constitute a significant improvement to wild animal welfare, with each dollar spent averting suffering equivalent to that of 101 animals dying from screwworm.\n\nThe 'gold standard' in animal welfare Corporate Campaigns are estimated to halve the suffering for 66 years of chicken life per dollar spent. These numbers are not directly comparable, but to me screwworm advocacy looks to be in a similar ballpark as the very best animal welfare interventions."
          },
          "isValid": false,
          "error": "Highlight is too long (max 1000 characters)"
        },
        {
          "title": "Implementation Timeline Forecast",
          "description": "The document lacks a specific timeline forecast for implementation. I would recommend creating a timeline with key milestones (coalition building, policy approval, gene drive development, testing, release) with probability estimates for each stage. This would help identify bottlenecks and critical path dependencies.",
          "importance": "70",
          "highlight": {
            "startOffset": 7177,
            "endOffset": 7363,
            "quotedText": "Executed well, I can envision the announcement of a joint programme to eradicate screwworm between several South American countries (perhaps with funding and help from the USDA) by 2030."
          },
          "isValid": true
        },
        {
          "title": "Infection Rate Probability Distribution",
          "description": "The 0.1-4% infection rate range is presented without a probability distribution or confidence level. This wide range (40x difference between lower and upper bound) significantly impacts the cost-effectiveness estimate. A more precise approach would specify a probability distribution (e.g., lognormal) with median and 90% confidence intervals, and identify what reference class data supports this estimate.",
          "importance": "90",
          "highlight": {
            "startOffset": 7893,
            "endOffset": 8404,
            "quotedText": "The real benefit is to the hundreds of millions of wild mammals in South America, of which I estimate 0.1-4% are infected with screwworm every year.[\\[7\\]](#fn8au87eajce4) A [back of the envelope](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests there are around 89.2 billion wild mammals (plus minus one order of magnitude) on the South American continent. This suggests hundreds of millions or even a few billion animals are infected every year."
          },
          "isValid": true
        },
        {
          "title": "Gene Drive Technical Success Probability",
          "description": "The document mentions genetic diversity across regions as a potential challenge but doesn't quantify the probability of technical success. I would recommend estimating: 1) Probability of developing an effective gene drive (90-95%), 2) Probability it works across all genetic variants (60-80%), and 3) Probability of complete eradication vs. significant reduction (70-85%).",
          "importance": "80",
          "highlight": {
            "startOffset": 11443,
            "endOffset": 12112,
            "quotedText": "While the new world screwworm is a single species, it has high genetic diversity across regions. Across the South American continent one can structure the fly into four regional groups of populations, with significant genetic variance. A gene drive released in one region might not spread to the other regions. For lasting and continent wide eradication, I suspect it will be necessary to release gene drives for screwworms in each of these regions.\n\nThis is well within what a team of motivated scientists can pull off. Gene drives are likely to be much cheaper, much more effective, and much better for the environment than any other population suppression technique."
          },
          "isValid": true
        },
        {
          "title": "Political Feasibility Forecast",
          "description": "The document would benefit from a structured forecast of political feasibility across different countries. I would recommend creating a table with key South American countries, their economic interest in eradication, political obstacles, and probability of joining a coordinated effort. This would help identify which countries to prioritize in advocacy efforts.",
          "importance": "75",
          "highlight": {
            "startOffset": 13013,
            "endOffset": 13975,
            "quotedText": "The existing financial interests in seeing screwworm eradicated makes me believe a campaign is much more likely to succeed than it otherwise would be. When you come across an animal welfare intervention that factory farmers are as excited about as you, you should act!\n\nThere are few arguments more persuasive to a policy maker than your country’s largest industry saying it would have a high ROI. The harrowing stories of people who have lost friends or relatives to the screwworm can make for effective messaging too.\n\nThe timing is also right. In 2024 Uruguay started considering using gene drives, so there is already momentum to latch onto.\n\nI’ve observed that successful EA policy campaigns often fight inertia rather than active and organised opponents. This is unfortunately not the case for this intervention. Environmentalist groups will push back to stop the use of gene drives. I suspect the livestock lobby is the more powerful voice, but who knows."
          },
          "isValid": true
        },
        {
          "title": "Success Probability Calibration",
          "description": "The document lacks explicit probability estimates for key success factors: 1) probability of effective advocacy, 2) probability of technical success with gene drives, 3) probability of coordinated implementation across countries, and 4) probability of complete eradication. Each of these could be estimated separately with confidence intervals to produce a more calibrated overall success probability.",
          "importance": "85",
          "highlight": {
            "startOffset": 13977,
            "endOffset": 14358,
            "quotedText": "I believe the most likely outcome is that South America will eventually use gene drives or sterile insect releases to eradicate screwworm anyway, but a coordinated campaign can speed this up by several years.\n\nThe ideal founders to pull off this campaign would have familiarity with South American policy and politics. Fluency in Spanish and Portuguese is likely necessary as well."
          },
          "isValid": true
        },
        {
          "title": "Counterfactual Timeline Estimation",
          "description": "The claim that advocacy could \"speed this up by several years\" needs quantification. A more precise forecast would estimate: 1) When eradication would likely happen without intervention (e.g., 50% chance by 2040), 2) When it would happen with intervention (e.g., 50% chance by 2032), and 3) The distribution of these timelines. This allows calculating the expected value of time saved.",
          "importance": "80",
          "highlight": {
            "startOffset": 13977,
            "endOffset": 14185,
            "quotedText": "I believe the most likely outcome is that South America will eventually use gene drives or sterile insect releases to eradicate screwworm anyway, but a coordinated campaign can speed this up by several years."
          },
          "isValid": true
        }
      ]
    }
  ]
}
