{
  "id": "policy-advocacy-for-eradicating-screwworm-looks-remarkably-cost-effective-ea-forum",
  "slug": "policy-advocacy-for-eradicating-screwworm-looks-remarkably-cost-effective-ea-forum",
  "title": "Policy advocacy for eradicating screwworm looks remarkably cost-effective — EA Forum",
  "author": "Unknown Author",
  "publishedDate": "2025-04-15",
  "intendedAgents": [
    "bias-detector",
    "clarity-coach",
    "research-scholar"
  ],
  "content": "The New World Screwworm causes tremendous suffering to wild and domestic animals on the South American continent. Gene drives make it possible to eradicate the screwworm and improve the wellbeing of hundreds of millions to billions of wild animals.\n\nI believe political advocacy to coordinate South American countries to use gene drives to eradicate the screwworm looks very tractable and highly impactful in expectation.\n\nIn this post I will go over:\n\n1.  Why I believe this to be the case\n2.  What the intervention would look like\n3.  Beg and plead for someone to go do this\n\n# Holy shit, Gene drives\n\nLike many on this forum, I listened to 80k’s podcast episode with Kevin Esvelt, where they discussed using gene drives to eradicate diseases and thought to myself: “holy shit that’s incredible, we should do something” to promptly forget all about it and move on with my life.\n\nHalf a year later, when [Works In Progress](https://worksinprogress.co/) asked me if there was anything I wanted to write about, gene drives popped into my mind. As I started researching for the article, I became increasingly obsessed. Those misfortunate enough to have been around me during this period, have had to endure many long monologues about gene drives.\n\nThroughout my frenzy, I met with Professors, PhDs, and representatives from organisations working on gene drives to eradicate malaria. I’ve now come to the following two conclusions:\n\n1.  Society, at large, should be using gene drives for vector control of endemic diseases such as Malaria. The risks are minute, and the benefits are huge.\n2.  **Political advocacy for using gene drives to eradicate screwworm in South America, looks incredibly impactful and very tractable.**\n\nMy article for the magazine (out soon!) is focused on the first point. This forum post is focused on the second.\n\n# What is the New World Screwworm?\n\nThe  C. hominivorax, or New World Screwworm, is a blowfly, which lays its eggs in the wounds (and other openings, such as the nostrils or ears) of mammals. After hatching, the larvae dig in and begin eating the host alive. The stench left off by the infested wound attracts yet more screwworm flies to lay their eggs. Untreated, 20-80% of animals infected die from the infestation or infections that follow.[\\[1\\]](#fn4i58gv52zfm)\n\nHumans, being mammals, are at risk too. Uruguay alone records hundreds of human cases every year.[\\[2\\]](#fno0tyi89nngh)\n\nAs one can imagine, being eaten alive by parasites is not much fun. As the scientific literature puts it: “Animals with myiasis may display signs of discomfort, lethargy, weight loss and depression”[\\[3\\]](#fnqv00j82g0wb)\n\nTo put it as politely: Based on the pictures I have seen, I too would display signs of discomfort if it were me who was infected.\n\nIn addition to infecting hundreds of millions of wild mammals, the New World screwworm costs the livestock industry hundreds of millions of dollars every year. To prevent the loss of livestock, North America eradicated the screwworm already in 1960 using the more primitive sterile insect technique.\n\nTo prevent the screwworm from migrating back into North America, they additionally worked with Middle American governments to eradicate it there as well, and to this very day they maintain a wall of sterile screwworm in Panama to prevent screwworm from migrating back north.\n\nSince then eradication progress has stalled as the sterile insect technique has proven difficult and expensive to use on the South American continent, where the screwworm is endemic on the majority of the continent.\n\nA survey found that 76% of Uruguayan farmers go as far as to plan yearly animal management around avoiding the screwworm season, to avoid loss of livestock.\n\nIn Uruguay alone, farmers lose between 40 to 150 million USD annually[\\[4\\]](#fnxzwh6v6axdn) (0.14% of the country’s GDP) to screwworm. There is enormous economic interest in seeing it eradicated.\n\nIn 2024 Uruguay’s National Institute for Agricultural Research received a $450,000 grant to develop a gene drive for screwworm. Even without the gene drive, Uruguay is interested in using the sterile insect technique to eradicate it within Uruguay, which will require continuously keeping up a costly artificial border of sterile flies insects surrounding the entire country.\n\n# What is a gene drive?\n\nIn short, the CRISPR/Cas9 Gene drive makes it possible to make a gene edit to an animal that is passed on to every one of its descendants, who in turn pass it on to everyone of theirs. By installing a gene drive into a single animal, over the next generations the gene edit will spread until the entire species has it.\n\nThis makes it a rather powerful technology. One way the technology can be used for good, is by driving a gene into an undesirable species which makes the females infertile, causing the population to collapse.\n\nBy using gene drives it becomes feasible to eradicate screwworm in South America.\n\nThe primary risk[\\[5\\]](#fnjki379rojt) from releasing any gene drive for population suppression is how the elimination of the subspecies will affect the surrounding ecology, for example by reducing the food available to predators.\n\nFortunately that experiment has already been run in North and Central America when they eradicated screwworm decades ago. The environmental impacts were minimal to none. With the reduced need for pesticides, one could even argue the environmental impact was positive.\n\nThis hasn’t prevented environmental organisations such as Greenpeace, who are against gene editing of any kind, from lobbying for a global moratorium (ban) on the use of gene drives. The UN voted down this proposal, and gene drives currently exist in somewhat of a legal grey area, where the decision to release any gene drive ultimately rests on individual countries rather than international agreements[\\[6\\]](#fn4kp3tuf0w4n).\n\n# The intervention: Political advocacy for governments to release a gene drive\n\nThe campaign will likely consist of the following steps:\n\n*   Putting together the coalition supporting a gene drive release.\n*   Doing the necessary advocacy to get buy-in from key countries across South America.\n*   Playing a coordinating role to connect agencies and get the eradication effort started.\n\nThe livestock industry makes up a large part of the economy of many South American countries. As a result, the agricultural lobby is incredibly influential and well connected.\n\nWhy is a country such as Uruguay looking to spend so much money on the sterile insect technique to eradicate screwworm in the first place? Hint, it’s not out of concern for the wellbeing of wild animals.\n\nSmall scale farmers and industrial factory farmers alike stand to save millions of dollars from the eradication of screwworm.\n\nAn effective campaign should put together a coalition of agricultural interest groups and utilise their existing networks and connections to key decision makers. Agricultural departments across countries have a shared interest in seeing it eradicated. Rather than a gene drive release being a national Uruguayan effort, the campaign would work to get other countries to join in and support the effort.\n\nExecuted well, I can envision the announcement of a joint programme to eradicate screwworm between several South American countries (perhaps with funding and help from the USDA) by 2030.\n\n# The cost-effectiveness of eradicating screwworm\n\nThe following sections describe the intuitions behind my cost-effectiveness analysis, feel free to just [view it directly](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) and plug in your own numbers.\n\n## How many wild animals would it help, and how much?\n\nEradicating screwworm would save the South American livestock industry hundreds of millions, but between you and me, helping this industry is not what excites me.\n\nThe real benefit is to the hundreds of millions of wild mammals in South America, of which I estimate 0.1-4% are infected with screwworm every year.[\\[7\\]](#fn8au87eajce4) A [back of the envelope](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests there are around 89.2 billion wild mammals (plus minus one order of magnitude) on the South American continent. This suggests hundreds of millions or even a few billion animals are infected every year.\n\nSaving them from a painful infection or even death is very motivating to me!\n\nCalculating the welfare improvement for any wild animal welfare intervention is notoriously difficult. If the animals whose lives we save were to later die from something even more painful, we might have done more harm than good. What will be the mammal’s cause of death, if not screwworm?\n\nEyeballing the [estimates from Wild Animal Initiative](https://www.wildanimalinitiative.org/blog/cause-of-death-3), I would very roughly say that ~45% of wild mammals die from predation, ~10% from disease, starvation and injuries, ~30% from humans, and 15% from other sources.\n\nMany sources describe screwworm infection as extremely painful, but tracing back the sources I wasn’t able to find any clear root claims. The medical case reports of humans I found did not use many adjectives to describe patients' pain, nor was I able to find any mentions of morphine or other similar strong painkillers being administered for the pain. I imagine a doctor who treats patients with myiasis would have a good sense, but I didn’t have one in my network to ask.\n\nMy best guess is that for lethal infections the pain is as bad as that of a severely infected wound, seeing as the causal mechanism of death often is a severe infection following the infestation.\n\nIntuitively it seems worse. If you google: “Screwworm infestation human” you will find upsetting images **(please don’t do this unless you’re sure you can stomach it)**, which gives some idea.\n\nI would personally prefer to be predated, run over by a car, or die from malaria, than I would want to die from a screwworm infection. Having not experienced any of these things, I accept my intuitions may be off, but I don’t know what else to go by. Good chance I’m over indexing on the ‘yuck’ factor of it all.\n\nUsing what I think are conservative assumptions, [my CEA](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests that eradicating screwworm would constitute a significant improvement to wild animal welfare, with each dollar spent averting suffering equivalent to that of 101 animals dying from screwworm.\n\nThe 'gold standard' in animal welfare Corporate Campaigns are estimated to halve the suffering for 66 years of chicken life per dollar spent. These numbers are not directly comparable, but to me screwworm advocacy looks to be in a similar ballpark as the very best animal welfare interventions.\n\n## Are gene drives an effective solution?\n\nUnlike the sterile insect technique, which will require weekly releases of millions of screwworms to work, a dozen gene driven screwworms can spread a gene edit far and wide.\n\nReleasing a gene drive in Uruguay would likely result in a temporary substantial reduction in the screwworm population of Uruguay and its neighbours, until screwworms which by chance develop immunity repopulate back. At this point a second gene drive release will be necessary. Rinse and repeat, until the population is extinct.\n\nWhile the new world screwworm is a single species, it has high genetic diversity across regions. Across the South American continent one can structure the fly into four regional groups of populations, with significant genetic variance. A gene drive released in one region might not spread to the other regions. For lasting and continent wide eradication, I suspect it will be necessary to release gene drives for screwworms in each of these regions.\n\nThis is well within what a team of motivated scientists can pull off. Gene drives are likely to be much cheaper, much more effective, and much better for the environment than any other population suppression technique.\n\n## What are the costs?\n\nCreating and releasing gene driven screwworms is not by itself too expensive. The R&D costs of developing working gene drives for screwworm will be within the single digit millions at the very highest.\n\nAdding in expenses relating to the test and release, such as environmental reviews and monitoring we get into the tens of millions at most. Most of these costs will be incurred by governments whose counterfactual looks different from that of the EA donor.\n\nThe political advocacy itself will perhaps cost a few million dollars, it might even be possible to get the livestock industry to pay for some of it.\n\nThe total costs will be in the tens of millions, and only a fraction of that has to come from high counterfactual philanthropic sources. Even without counting welfare benefits, the ROI for governments is positive.\n\n## How likely is political advocacy to succeed?\n\nThe existing financial interests in seeing screwworm eradicated makes me believe a campaign is much more likely to succeed than it otherwise would be. When you come across an animal welfare intervention that factory farmers are as excited about as you, you should act!\n\nThere are few arguments more persuasive to a policy maker than your country’s largest industry saying it would have a high ROI. The harrowing stories of people who have lost friends or relatives to the screwworm can make for effective messaging too.\n\nThe timing is also right. In 2024 Uruguay started considering using gene drives, so there is already momentum to latch onto.\n\nI’ve observed that successful EA policy campaigns often fight inertia rather than active and organised opponents. This is unfortunately not the case for this intervention. Environmentalist groups will push back to stop the use of gene drives. I suspect the livestock lobby is the more powerful voice, but who knows.\n\nI believe the most likely outcome is that South America will eventually use gene drives or sterile insect releases to eradicate screwworm anyway, but a coordinated campaign can speed this up by several years.\n\nThe ideal founders to pull off this campaign would have familiarity with South American policy and politics. Fluency in Spanish and Portuguese is likely necessary as well.\n\n# A call to action\n\nI am not a wild animal welfare researcher and I hope it’s abundantly clear this intervention would benefit from further investigation by someone with domain expertise.\n\nMy own estimates suggests policy advocacy to eradicate screwworm to be competitive with the most cost-effective animal welfare interventions.\n\nI am not from South America, I am not well-positioned to work on this, **but somebody really should do something**. There’s lots to do. One could reach out to the Uruguayan researchers to better understand their bottlenecks. Is it funding? If so, how much? One could speak with the livestock industry to gauge their interest. Would they join a coalition and/or pay for the campaign?\n\nI believe a  group of motivated volunteers could get quite far. **If you are interested in continuing work on any of this do reach out.** The best person to work on this was someone more qualified five years ago, the second best is you today.\n\n_Cochliomyia hominivorax delenda est_\n\n1.  **[^](#fnref4i58gv52zfm)**\n    \n     https://www.iaea.org/sites/default/files/32406483541.pdf\n    \n2.  **[^](#fnrefo0tyi89nngh)**\n    \n     https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7789611/\n    \n3.  **[^](#fnrefqv00j82g0wb)**\n    \n     https://www.aphis.usda.gov/sites/default/files/screwworm-environmental-assessment.pdf\n    \n4.  **[^](#fnrefxzwh6v6axdn)**\n    \n     http://www.scielo.edu.uy/scielo.php?script=sci\\_arttext&pid=S2730-50662021000301401\n    \n5.  **[^](#fnrefjki379rojt)**\n    \n    Some also worry about the gene drive spreading to other Cochliomyia species, which is a genuine concern but not something that worries me that much.\n    \n    In theory it could happen through one of two ways:\n    \n    \\- Hybridization (successful cross-breeding between the species)  \n    \\- Horizontal spread (gene drive transferred without reproduction, for example through a virus)\n    \n    For screwworm I haven't been able to find any source claiming screwworm species can hybridize (unlike between subspecies of eg. anopheles gambiae mosquitoes where it regularly happens). This is in line with what I would expect, as hybridization between species is the exception not the rule. But one could cheaply run a lab experiment to verify they don't hybridize. If nobody has done this already, that would be wise to do.\n    \n    Horizontal gene flow is impossible to rule out completely, but the likelihood of this occurring is pretty much zero. The risk of the gene spreading can also be addressed by building the gene drive to target a section of the genome unique to C. hominivorax.\n    \n    Additionally one can run a no-payload daisy chain drive test first (more on that in my magazine article) to verify the drive works as intended and doesn't spread, before releasing a full suppression drive.\n    \n6.  **[^](#fnref4kp3tuf0w4n)**\n    \n     Countries which have signed the cartagena protocol have some obligations to their neighbour countries.\n    \n7.  **[^](#fnref8au87eajce4)**\n    \n     Before the eradication in north America an estimated 2-3% of wild animals in endemic regions were infested: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7789611/#:~:text=Prior%20to%20eradication%20the%20USA,eradication%20%5B17%2C%2018%5D.",
  "reviews": [
    {
      "agentId": "bias-detector",
      "costInCents": 9341,
      "createdAt": "2025-04-16T00:26:07.939Z",
      "runDetails": "{\"model\":\"anthropic/claude-3.7-sonnet\",\"promptTokens\":6771,\"completionTokens\":2570,\"totalTokens\":9341,\"temperature\":0.7,\"runtimeMs\":52631}",
      "summary": "This document presents a case for using gene drives to eradicate the New World Screwworm from South America through political advocacy. The analysis contains several biases that affect its objectivity and completeness. There's a strong confirmation bias throughout, with the author acknowledging their \"frenzy\" and \"obsession\" while primarily citing evidence supporting their position. The document displays emotional framing bias by using vivid language (\"holy shit\", \"eaten alive\") and emotional appeals rather than neutral assessments. Anthropomorphic bias appears in assumptions about wild animal suffering preferences. There's selective evidence presentation, particularly regarding environmental impacts and potential resistance to gene drives. The document shows Western-centric thinking by applying solutions without adequate consideration of South American perspectives. Quantitative bias manifests in speculative calculations with wide uncertainty ranges presented as reliable. The assessment of opposition from environmental groups shows adversarial bias, while economic benefits receive disproportionate emphasis compared to ecological concerns. Overall, the document demonstrates enthusiasm for the intervention but would benefit from more balanced consideration of risks, limitations, and alternative perspectives.",
      "comments": [
        {
          "title": "Emotional Framing Bias",
          "description": "The document uses emotionally charged language (\"holy shit\", \"tremendous suffering\", \"eaten alive\") that frames the issue in a way that evokes strong emotional responses rather than encouraging neutral, objective assessment. This emotional framing can lead readers to make decisions based on emotional reactions rather than balanced evaluation of evidence. A more neutral presentation would help readers evaluate the merits of the proposal more objectively.",
          "highlight": {
            "startOffset": 578,
            "endOffset": 879,
            "quotedText": "# Holy shit, Gene drives\n\nLike many on this forum, I listened to 80k’s podcast episode with Kevin Esvelt, where they discussed using gene drives to eradicate diseases and thought to myself: “holy shit that’s incredible, we should do something” to promptly forget all about it and move on with my life."
          },
          "isValid": true
        },
        {
          "title": "Confirmation Bias",
          "description": "The author acknowledges becoming \"increasingly obsessed\" with gene drives and having delivered \"many long monologues\" about them, indicating they may be primarily seeking information that confirms their pre-existing enthusiasm rather than evaluating the topic objectively. This confirmation bias is evident in how they present their conclusions with high certainty despite acknowledging limited expertise in wild animal welfare. A more balanced approach would include more rigorous examination of potential downsides and limitations of gene drives.",
          "highlight": {
            "startOffset": 1043,
            "endOffset": 1380,
            "quotedText": "As I started researching for the article, I became increasingly obsessed. Those misfortunate enough to have been around me during this period, have had to endure many long monologues about gene drives.\n\nThroughout my frenzy, I met with Professors, PhDs, and representatives from organisations working on gene drives to eradicate malaria."
          },
          "isValid": true
        },
        {
          "title": "Selective Evidence Presentation",
          "description": "The document claims environmental impacts from previous screwworm eradication were \"minimal to none\" without providing substantive evidence or citing ecological studies. This selective presentation of evidence ignores potential complex ecological consequences that may have occurred or could occur in different ecosystems. A more balanced analysis would include detailed ecological assessments and acknowledge the limitations in our understanding of ecosystem impacts.",
          "highlight": {
            "startOffset": 5179,
            "endOffset": 5630,
            "quotedText": "Fortunately that experiment has already been run in North and Central America when they eradicated screwworm decades ago. The environmental impacts were minimal to none. With the reduced need for pesticides, one could even argue the environmental impact was positive.\n\nThis hasn’t prevented environmental organisations such as Greenpeace, who are against gene editing of any kind, from lobbying for a global moratorium (ban) on the use of gene drives."
          },
          "isValid": true
        },
        {
          "title": "Adversarial Bias Against Environmental Groups",
          "description": "The document characterizes environmental organizations like Greenpeace as categorically \"against gene editing of any kind\" without nuanced representation of their positions or concerns. This creates an adversarial framing that dismisses legitimate ecological concerns as mere opposition to progress. A more balanced approach would acknowledge the complexity of environmental organizations' positions and engage substantively with their specific concerns about gene drives.",
          "highlight": {
            "startOffset": 5448,
            "endOffset": 5876,
            "quotedText": "This hasn’t prevented environmental organisations such as Greenpeace, who are against gene editing of any kind, from lobbying for a global moratorium (ban) on the use of gene drives. The UN voted down this proposal, and gene drives currently exist in somewhat of a legal grey area, where the decision to release any gene drive ultimately rests on individual countries rather than international agreements[\\[6\\]](#fn4kp3tuf0w4n)."
          },
          "isValid": false,
          "error": "Highlight overlaps with a previous highlight"
        },
        {
          "title": "Economic Focus Bias",
          "description": "The document overemphasizes economic benefits to the livestock industry while giving less attention to ecological considerations. While acknowledging that helping the livestock industry \"is not what excites me,\" the proposal heavily leverages economic arguments to gain political support. This creates an imbalance where economic factors receive disproportionate weight compared to ecological and ethical considerations. A more balanced approach would give equal consideration to ecological impacts alongside economic benefits.",
          "highlight": {
            "startOffset": 7729,
            "endOffset": 8041,
            "quotedText": "Eradicating screwworm would save the South American livestock industry hundreds of millions, but between you and me, helping this industry is not what excites me.\n\nThe real benefit is to the hundreds of millions of wild mammals in South America, of which I estimate 0.1-4% are infected with screwworm every year."
          },
          "isValid": true
        },
        {
          "title": "Quantitative Bias",
          "description": "The document presents highly uncertain quantitative estimates (\"89.2 billion wild mammals (plus minus one order of magnitude)\") as if they provide reliable evidence. This creates an illusion of precision where significant uncertainty exists. The wide range in the estimate (potentially varying from 8.92 billion to 892 billion) reveals the extreme uncertainty, yet the specific figure of 89.2 billion is used to support subsequent calculations, potentially misleading readers about the reliability of the analysis.",
          "highlight": {
            "startOffset": 8065,
            "endOffset": 8404,
            "quotedText": "A [back of the envelope](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests there are around 89.2 billion wild mammals (plus minus one order of magnitude) on the South American continent. This suggests hundreds of millions or even a few billion animals are infected every year."
          },
          "isValid": true
        },
        {
          "title": "Anthropomorphic Bias",
          "description": "The author projects human preferences onto wild animals when comparing different causes of death (\"I would personally prefer to be predated, run over by a car, or die from malaria, than I would want to die from a screwworm infection\"). This anthropomorphizes wild animals by assuming their experience of suffering matches human perceptions. Different species may experience pain and suffering differently, making such comparisons potentially misleading for welfare assessment.",
          "highlight": {
            "startOffset": 9920,
            "endOffset": 10530,
            "quotedText": "I would personally prefer to be predated, run over by a car, or die from malaria, than I would want to die from a screwworm infection. Having not experienced any of these things, I accept my intuitions may be off, but I don’t know what else to go by. Good chance I’m over indexing on the ‘yuck’ factor of it all.\n\nUsing what I think are conservative assumptions, [my CEA](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests that eradicating screwworm would constitute a significant improvement to wild animal welfare, with each dollar spent averting"
          },
          "isValid": true
        },
        {
          "title": "Optimism Bias in Technical Feasibility",
          "description": "The document downplays technical challenges in implementing gene drives, particularly regarding potential resistance development. While it acknowledges that screwworms might \"by chance develop immunity\" requiring multiple releases, it presents this as a minor issue rather than a significant technical challenge. The assumption that repeating releases will eventually lead to extinction underestimates potential evolutionary adaptations. A more balanced assessment would thoroughly address the technical limitations and potential failure modes of gene drive technology.",
          "highlight": {
            "startOffset": 11113,
            "endOffset": 11678,
            "quotedText": "Releasing a gene drive in Uruguay would likely result in a temporary substantial reduction in the screwworm population of Uruguay and its neighbours, until screwworms which by chance develop immunity repopulate back. At this point a second gene drive release will be necessary. Rinse and repeat, until the population is extinct.\n\nWhile the new world screwworm is a single species, it has high genetic diversity across regions. Across the South American continent one can structure the fly into four regional groups of populations, with significant genetic variance."
          },
          "isValid": true
        },
        {
          "title": "Political Feasibility Bias",
          "description": "The document presents an overly optimistic assessment of political feasibility, assuming that economic interests will easily overcome potential opposition. While acknowledging that environmental groups will push back, the author dismisses this concern with the unsupported assertion that \"the livestock lobby is the more powerful voice.\" This overlooks the complexity of political decision-making, particularly for novel biotechnologies with potential ecological impacts. A more balanced assessment would include a more detailed analysis of the political landscape and potential barriers.",
          "highlight": {
            "startOffset": 13660,
            "endOffset": 14185,
            "quotedText": "I’ve observed that successful EA policy campaigns often fight inertia rather than active and organised opponents. This is unfortunately not the case for this intervention. Environmentalist groups will push back to stop the use of gene drives. I suspect the livestock lobby is the more powerful voice, but who knows.\n\nI believe the most likely outcome is that South America will eventually use gene drives or sterile insect releases to eradicate screwworm anyway, but a coordinated campaign can speed this up by several years."
          },
          "isValid": true
        },
        {
          "title": "Western-Centric Cultural Bias",
          "description": "The proposal applies a solution developed primarily in Western scientific contexts to South American countries without adequate consideration of local perspectives, cultural attitudes toward ecological intervention, or indigenous knowledge systems. The document positions the author as knowing what's best for South American countries rather than emphasizing the importance of local leadership and decision-making. A more inclusive approach would center South American perspectives and leadership in the proposed intervention.",
          "highlight": {
            "startOffset": 14692,
            "endOffset": 15318,
            "quotedText": "I am not from South America, I am not well-positioned to work on this, **but somebody really should do something**. There’s lots to do. One could reach out to the Uruguayan researchers to better understand their bottlenecks. Is it funding? If so, how much? One could speak with the livestock industry to gauge their interest. Would they join a coalition and/or pay for the campaign?\n\nI believe a  group of motivated volunteers could get quite far. **If you are interested in continuing work on any of this do reach out.** The best person to work on this was someone more qualified five years ago, the second best is you today."
          },
          "isValid": true
        }
      ]
    },
    {
      "agentId": "clarity-coach",
      "costInCents": 9333,
      "createdAt": "2025-04-16T00:27:50.710Z",
      "runDetails": "{\"model\":\"anthropic/claude-3.7-sonnet\",\"promptTokens\":7401,\"completionTokens\":1932,\"totalTokens\":9333,\"temperature\":0.7,\"runtimeMs\":43776}",
      "summary": "This document presents a compelling case for using gene drives to eradicate the New World Screwworm in South America. The author argues this intervention would be highly impactful for wild animal welfare while also being economically beneficial and politically tractable. The screwworm causes immense suffering to millions of wild mammals and livestock by laying eggs in wounds, with larvae that literally eat animals alive. While North America eradicated the pest in the 1960s using sterile insect techniques, South America continues to struggle with endemic infestations. Gene drives—a technology that spreads genetic modifications through entire populations—could efficiently eliminate the screwworm continent-wide. The author estimates hundreds of millions to billions of wild animals would be spared painful infections annually, making this intervention potentially competitive with the most cost-effective animal welfare interventions. The economic benefits to the livestock industry provide a powerful incentive for governmental action. The document calls for political advocacy to coordinate South American countries in implementing this solution, suggesting a coalition of agricultural interests could overcome potential opposition from environmental groups.",
      "comments": [
        {
          "title": "Clear Executive Summary",
          "description": "The opening paragraphs effectively summarize the entire proposal in just a few sentences. This clarity helps readers immediately understand the topic, importance, and call to action. The three-point structure (why this matters, what the intervention would look like, and call to action) provides an excellent roadmap for the reader.",
          "highlight": {
            "startOffset": 0,
            "endOffset": 576,
            "quotedText": "The New World Screwworm causes tremendous suffering to wild and domestic animals on the South American continent. Gene drives make it possible to eradicate the screwworm and improve the wellbeing of hundreds of millions to billions of wild animals.\n\nI believe political advocacy to coordinate South American countries to use gene drives to eradicate the screwworm looks very tractable and highly impactful in expectation.\n\nIn this post I will go over:\n\n1.  Why I believe this to be the case\n2.  What the intervention would look like\n3.  Beg and plead for someone to go do this"
          },
          "isValid": true
        },
        {
          "title": "Effective Use of Section Headers",
          "description": "The document uses clear, descriptive headers that guide the reader through the logical flow of the argument. Headers like \"What is the New World Screwworm?\" and \"The cost-effectiveness of eradicating screwworm\" create distinct sections that help organize information and maintain reader orientation throughout the lengthy document.",
          "highlight": {
            "startOffset": 0,
            "endOffset": 0,
            "quotedText": ""
          },
          "isValid": false,
          "error": "End text not found in document"
        },
        {
          "title": "Inconsistent Formatting in Numbered Lists",
          "description": "The document uses two different formats for numbered lists: Arabic numerals with periods in the introduction and Arabic numerals with parentheses in later sections. Standardizing list formatting throughout the document would improve structural coherence and visual consistency.",
          "highlight": {
            "startOffset": 453,
            "endOffset": 576,
            "quotedText": "1.  Why I believe this to be the case\n2.  What the intervention would look like\n3.  Beg and plead for someone to go do this"
          },
          "isValid": false,
          "error": "Highlight overlaps with a previous highlight"
        },
        {
          "title": "Abrupt Transition Between Personal Narrative and Technical Information",
          "description": "The transition from the personal narrative in \"Holy shit, Gene drives\" to the technical explanation of screwworm is somewhat abrupt. A brief transitional paragraph connecting these sections would help maintain narrative flow and guide readers more smoothly between the author's personal journey and the technical content that follows.",
          "highlight": {
            "startOffset": 1246,
            "endOffset": 1872,
            "quotedText": "Throughout my frenzy, I met with Professors, PhDs, and representatives from organisations working on gene drives to eradicate malaria. I’ve now come to the following two conclusions:\n\n1.  Society, at large, should be using gene drives for vector control of endemic diseases such as Malaria. The risks are minute, and the benefits are huge.\n2.  **Political advocacy for using gene drives to eradicate screwworm in South America, looks incredibly impactful and very tractable.**\n\nMy article for the magazine (out soon!) is focused on the first point. This forum post is focused on the second.\n\n# What is the New World Screwworm?"
          },
          "isValid": true
        },
        {
          "title": "Vivid Problem Description",
          "description": "The document provides a vivid, concrete description of the screwworm problem that helps readers understand the severity of the issue. The description of how screwworms infect animals creates a clear mental image that emphasizes the suffering caused, making the case for intervention more compelling without resorting to unnecessarily graphic language.",
          "highlight": {
            "startOffset": 1874,
            "endOffset": 2780,
            "quotedText": "The  C. hominivorax, or New World Screwworm, is a blowfly, which lays its eggs in the wounds (and other openings, such as the nostrils or ears) of mammals. After hatching, the larvae dig in and begin eating the host alive. The stench left off by the infested wound attracts yet more screwworm flies to lay their eggs. Untreated, 20-80% of animals infected die from the infestation or infections that follow.[\\[1\\]](#fn4i58gv52zfm)\n\nHumans, being mammals, are at risk too. Uruguay alone records hundreds of human cases every year.[\\[2\\]](#fno0tyi89nngh)\n\nAs one can imagine, being eaten alive by parasites is not much fun. As the scientific literature puts it: “Animals with myiasis may display signs of discomfort, lethargy, weight loss and depression”[\\[3\\]](#fnqv00j82g0wb)\n\nTo put it as politely: Based on the pictures I have seen, I too would display signs of discomfort if it were me who was infected."
          },
          "isValid": true
        },
        {
          "title": "Technical Jargon with Accessible Explanations",
          "description": "The author skillfully introduces technical concepts like gene drives by providing clear, concise explanations that make the science accessible to non-specialists. The explanation balances simplicity with accuracy, avoiding overwhelming readers with unnecessary complexity while still conveying the essential information.",
          "highlight": {
            "startOffset": 4309,
            "endOffset": 4945,
            "quotedText": "# What is a gene drive?\n\nIn short, the CRISPR/Cas9 Gene drive makes it possible to make a gene edit to an animal that is passed on to every one of its descendants, who in turn pass it on to everyone of theirs. By installing a gene drive into a single animal, over the next generations the gene edit will spread until the entire species has it.\n\nThis makes it a rather powerful technology. One way the technology can be used for good, is by driving a gene into an undesirable species which makes the females infertile, causing the population to collapse.\n\nBy using gene drives it becomes feasible to eradicate screwworm in South America."
          },
          "isValid": true
        },
        {
          "title": "Excessive Sentence Length in Technical Explanation",
          "description": "Some sentences in the gene drive explanation section are excessively long, which reduces readability. Breaking these into shorter sentences would improve comprehension, especially for readers unfamiliar with the technical concepts being described.",
          "highlight": {
            "startOffset": 4334,
            "endOffset": 4652,
            "quotedText": "In short, the CRISPR/Cas9 Gene drive makes it possible to make a gene edit to an animal that is passed on to every one of its descendants, who in turn pass it on to everyone of theirs. By installing a gene drive into a single animal, over the next generations the gene edit will spread until the entire species has it."
          },
          "isValid": false,
          "error": "Highlight overlaps with a previous highlight"
        },
        {
          "title": "Unclear Antecedent in Risk Discussion",
          "description": "The sentence beginning \"The primary risk\" has an unclear antecedent, making it initially difficult to understand what specific risk is being discussed. Restructuring to clearly state \"The primary environmental risk of gene drives for population suppression is...\" would improve clarity and prevent readers from momentarily searching for context.",
          "highlight": {
            "startOffset": 4947,
            "endOffset": 5177,
            "quotedText": "The primary risk[\\[5\\]](#fnjki379rojt) from releasing any gene drive for population suppression is how the elimination of the subspecies will affect the surrounding ecology, for example by reducing the food available to predators."
          },
          "isValid": true
        },
        {
          "title": "Explicit Transparency About Uncertainty",
          "description": "The author demonstrates intellectual honesty by explicitly acknowledging areas of uncertainty in their analysis. This transparency builds credibility and helps readers understand which parts of the argument are most robust versus which might benefit from further investigation. The acknowledgment of potential biases in personal intuitions about suffering comparisons is particularly effective.",
          "highlight": {
            "startOffset": 9920,
            "endOffset": 10232,
            "quotedText": "I would personally prefer to be predated, run over by a car, or die from malaria, than I would want to die from a screwworm infection. Having not experienced any of these things, I accept my intuitions may be off, but I don’t know what else to go by. Good chance I’m over indexing on the ‘yuck’ factor of it all."
          },
          "isValid": true
        },
        {
          "title": "Effective Use of External Resources",
          "description": "The document effectively incorporates external resources through hyperlinks to supporting documentation and cost-effectiveness analyses. This allows interested readers to explore the evidence in greater depth without cluttering the main text with excessive detail. The links to the author's CEA spreadsheet are particularly valuable for readers who want to examine the quantitative assumptions.",
          "highlight": {
            "startOffset": 10234,
            "endOffset": 10596,
            "quotedText": "Using what I think are conservative assumptions, [my CEA](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests that eradicating screwworm would constitute a significant improvement to wild animal welfare, with each dollar spent averting suffering equivalent to that of 101 animals dying from screwworm."
          },
          "isValid": true
        }
      ]
    },
    {
      "agentId": "research-scholar",
      "costInCents": 10709,
      "createdAt": "2025-04-16T00:29:07.159Z",
      "runDetails": "{\"model\":\"anthropic/claude-3.7-sonnet\",\"promptTokens\":7572,\"completionTokens\":3137,\"totalTokens\":10709,\"temperature\":0.7,\"runtimeMs\":66581}",
      "summary": "This post examines the potential for using gene drives to eradicate the New World Screwworm (Cochliomyia hominivorax) in South America as a highly tractable and impactful animal welfare intervention. The screwworm causes immense suffering to mammals by laying eggs in wounds, after which larvae eat the host alive, affecting hundreds of millions to billions of wild animals annually. While North America eradicated the pest in the 1960s using sterile insect technique, South America continues to struggle with endemic populations. Gene drives—a CRISPR-based technology that ensures genetic modifications spread to all offspring—could efficiently collapse screwworm populations. The author argues that political advocacy coordinating South American countries to implement gene drives appears highly cost-effective, potentially averting suffering equivalent to that of 101 animals dying from screwworm per dollar spent. The intervention benefits from strong economic incentives (livestock industries lose hundreds of millions annually), existing momentum (Uruguay is already developing a gene drive), and minimal ecological concerns (based on North America's successful eradication). The author calls for someone with regional expertise to lead a coalition-building campaign that could accelerate screwworm eradication by several years.",
      "comments": [
        {
          "title": "Neglectedness despite high tractability",
          "description": "This intervention appears to occupy an unusual position in the ITN (Importance, Tractability, Neglectedness) framework popular in EA circles. While highly tractable (economic incentives, existing technology, proven concept) and important (affecting billions of animals), it remains neglected. This pattern sometimes appears when interventions fall between different cause areas or expertise domains - in this case, between wild animal welfare, global health, and agricultural policy. The author's personal journey from \"holy shit that's incredible\" to forgetting about it exemplifies how even promising interventions can fail to gain traction without dedicated champions. This relates to the broader EA concept of \"crucial considerations\" - factors that fundamentally change the assessment of an intervention's value.",
          "highlight": {
            "startOffset": 604,
            "endOffset": 1116,
            "quotedText": "Like many on this forum, I listened to 80k’s podcast episode with Kevin Esvelt, where they discussed using gene drives to eradicate diseases and thought to myself: “holy shit that’s incredible, we should do something” to promptly forget all about it and move on with my life.\n\nHalf a year later, when [Works In Progress](https://worksinprogress.co/) asked me if there was anything I wanted to write about, gene drives popped into my mind. As I started researching for the article, I became increasingly obsessed."
          },
          "isValid": true
        },
        {
          "title": "Moral weight of invertebrate suffering",
          "description": "The author frames the intervention primarily in terms of preventing mammalian suffering, with no discussion of potential moral consideration for the screwworm flies themselves. This reflects an ongoing debate within wild animal welfare about the moral weights assigned to different taxa. The EA community has increasingly questioned traditional hierarchical views of consciousness, with organizations like Rethink Priorities investigating invertebrate sentience. While mammals are generally assigned higher moral weight than insects in most moral frameworks, a comprehensive analysis might acknowledge the tradeoff between mammal and insect welfare. The extinction of a species also raises complex moral considerations about biodiversity value that aren't addressed here.",
          "highlight": {
            "startOffset": 7893,
            "endOffset": 8349,
            "quotedText": "The real benefit is to the hundreds of millions of wild mammals in South America, of which I estimate 0.1-4% are infected with screwworm every year.[\\[7\\]](#fn8au87eajce4) A [back of the envelope](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests there are around 89.2 billion wild mammals (plus minus one order of magnitude) on the South American continent. This suggests hundreds of millions"
          },
          "isValid": true
        },
        {
          "title": "Uncertain welfare improvement calculations",
          "description": "The post highlights a fundamental challenge in wild animal welfare interventions: determining whether preventing one cause of death actually improves welfare when animals might instead die from potentially worse causes. This reflects the complex population dynamics and welfare considerations that make wild animal interventions difficult to evaluate. The author's approach of comparing different causes of death subjectively (\"I would personally prefer to be predated...\") aligns with frameworks like relative welfare footprints used by Wild Animal Initiative, but acknowledges significant uncertainty. This highlights the need for more systematic approaches to comparing different welfare states in wild animals - a key research priority in the field. The author's transparency about potential overindexing on the \"yuck factor\" demonstrates good epistemic practices.",
          "highlight": {
            "startOffset": 8484,
            "endOffset": 9051,
            "quotedText": "Calculating the welfare improvement for any wild animal welfare intervention is notoriously difficult. If the animals whose lives we save were to later die from something even more painful, we might have done more harm than good. What will be the mammal’s cause of death, if not screwworm?\n\nEyeballing the [estimates from Wild Animal Initiative](https://www.wildanimalinitiative.org/blog/cause-of-death-3), I would very roughly say that ~45% of wild mammals die from predation, ~10% from disease, starvation and injuries, ~30% from humans, and 15% from other sources."
          },
          "isValid": true
        },
        {
          "title": "Comparative cost-effectiveness analysis",
          "description": "The author compares this intervention to corporate campaigns for chicken welfare, providing a benchmark against established animal welfare interventions. This type of cross-cause comparison is central to EA prioritization methods, helping to identify the most efficient ways to improve welfare. The comparison to \"66 years of chicken life per dollar spent\" references work by organizations like Animal Charity Evaluators on quantifying welfare impacts. While acknowledging the challenges in direct comparison, this approach demonstrates how EA practitioners attempt to make difficult cross-species welfare comparisons. The author's transparency about the uncertainty in these comparisons reflects good epistemic practices, while still providing a useful reference point for decision-making.",
          "highlight": {
            "startOffset": 10234,
            "endOffset": 10892,
            "quotedText": "Using what I think are conservative assumptions, [my CEA](https://docs.google.com/spreadsheets/d/1fg7V_O-b3TYdYfksgIa5cYv6hxxsgUBQ1kFF9HcdcSc/edit#gid=488725566) suggests that eradicating screwworm would constitute a significant improvement to wild animal welfare, with each dollar spent averting suffering equivalent to that of 101 animals dying from screwworm.\n\nThe 'gold standard' in animal welfare Corporate Campaigns are estimated to halve the suffering for 66 years of chicken life per dollar spent. These numbers are not directly comparable, but to me screwworm advocacy looks to be in a similar ballpark as the very best animal welfare interventions."
          },
          "isValid": true
        },
        {
          "title": "Technological leapfrogging with gene drives",
          "description": "The post highlights how gene drives represent a significant technological advancement over previous sterile insect techniques. This case study demonstrates the concept of technological leapfrogging, where newer technologies can enable developing regions to skip intermediate technological stages. In the EA community, this relates to discussions about differential technological development and the importance of technology diffusion pathways. The comparison between releasing millions of sterile insects weekly versus a dozen gene-driven insects illustrates the dramatic efficiency gains possible with advanced biotechnology. However, the post doesn't deeply explore how this technological capability might affect other intervention possibilities beyond screwworm - a potential area for further exploration of the intervention landscape.",
          "highlight": {
            "startOffset": 10937,
            "endOffset": 11441,
            "quotedText": "Unlike the sterile insect technique, which will require weekly releases of millions of screwworms to work, a dozen gene driven screwworms can spread a gene edit far and wide.\n\nReleasing a gene drive in Uruguay would likely result in a temporary substantial reduction in the screwworm population of Uruguay and its neighbours, until screwworms which by chance develop immunity repopulate back. At this point a second gene drive release will be necessary. Rinse and repeat, until the population is extinct."
          },
          "isValid": true
        },
        {
          "title": "Genetic diversity as implementation challenge",
          "description": "The post identifies an important implementation challenge: genetic diversity across regional populations may require multiple targeted gene drives. This highlights how biological complexity can affect intervention scaling - a critical consideration in wild animal welfare work. The EA community often discusses the importance of understanding heterogeneity in intervention contexts, and this represents a clear example where regional differences matter significantly. This challenge also relates to the concept of \"crucial considerations\" - factors that might substantially change our assessment of an intervention's feasibility or cost-effectiveness. The author's recognition of this challenge demonstrates good diligence in anticipating potential implementation barriers that could affect the intervention's ultimate success.",
          "highlight": {
            "startOffset": 11443,
            "endOffset": 11892,
            "quotedText": "While the new world screwworm is a single species, it has high genetic diversity across regions. Across the South American continent one can structure the fly into four regional groups of populations, with significant genetic variance. A gene drive released in one region might not spread to the other regions. For lasting and continent wide eradication, I suspect it will be necessary to release gene drives for screwworms in each of these regions."
          },
          "isValid": true
        },
        {
          "title": "Dual-benefit intervention alignment",
          "description": "This intervention presents a rare alignment between animal welfare interests and industrial agriculture incentives. Such dual-benefit interventions often have higher tractability because they can leverage existing economic motivations and institutional support. In the EA community, this relates to concepts of \"moral trade\" where parties with different value systems can cooperate on interventions that satisfy multiple sets of values. Similar alignments have been observed in other contexts like cage-free campaigns where both welfare advocates and certain market segments benefit. The economic angle (0.14% of Uruguay's GDP lost annually) provides both a compelling narrative and potential funding sources that wouldn't otherwise support pure animal welfare interventions.",
          "highlight": {
            "startOffset": 13164,
            "endOffset": 13281,
            "quotedText": "When you come across an animal welfare intervention that factory farmers are as excited about as you, you should act!"
          },
          "isValid": true
        },
        {
          "title": "Opposition from environmental groups",
          "description": "The author identifies opposition from environmental groups as a key challenge, contrasting with many EA policy campaigns that fight inertia rather than organized opponents. This highlights an important consideration in intervention selection - the presence of active opposition can significantly reduce tractability. In EA discussions of policy change, the alignment of stakeholder interests is often emphasized as crucial for success. The author's assessment that \"the livestock lobby is the more powerful voice\" represents a strategic calculation about the balance of power among stakeholders. This connects to broader EA discussions about how to navigate value conflicts in policy advocacy and when to pursue interventions that face organized opposition versus those with broader consensus.",
          "highlight": {
            "startOffset": 13660,
            "endOffset": 13975,
            "quotedText": "I’ve observed that successful EA policy campaigns often fight inertia rather than active and organised opponents. This is unfortunately not the case for this intervention. Environmentalist groups will push back to stop the use of gene drives. I suspect the livestock lobby is the more powerful voice, but who knows."
          },
          "isValid": true
        },
        {
          "title": "Speeding up inevitable progress",
          "description": "The author suggests that South America will likely eventually adopt this technology, but a campaign could accelerate the timeline by several years. This framing connects to an important concept in EA prioritization - the value of time and the importance of considering counterfactual timelines. Rather than claiming full credit for an intervention that might happen anyway, the author focuses on the value of acceleration. This relates to discussions in EA about differential progress and patient philanthropy - when is it valuable to accelerate certain developments versus waiting? For wild animal welfare interventions, where billions of animals experience suffering annually, even modest timeline acceleration can prevent enormous amounts of suffering.",
          "highlight": {
            "startOffset": 13977,
            "endOffset": 14358,
            "quotedText": "I believe the most likely outcome is that South America will eventually use gene drives or sterile insect releases to eradicate screwworm anyway, but a coordinated campaign can speed this up by several years.\n\nThe ideal founders to pull off this campaign would have familiarity with South American policy and politics. Fluency in Spanish and Portuguese is likely necessary as well."
          },
          "isValid": true
        },
        {
          "title": "Call to action with realistic expectations",
          "description": "The post concludes with a call to action that emphasizes feasibility for \"a group of motivated volunteers\" while acknowledging the need for specific expertise. This approach balances inspiring action with setting realistic expectations about what's needed. Within EA, there's ongoing discussion about the best ways to mobilize community talent toward promising projects. The author's acknowledgment that \"the best person was someone more qualified five years ago\" reflects the common EA struggle with the perfect being the enemy of the good. The Latin phrase \"Cochliomyia hominivorax delenda est\" (\"The New World Screwworm must be destroyed\") echoes Cato the Elder's famous phrase about Carthage, adding rhetorical weight to the urgency of the call to action.",
          "highlight": {
            "startOffset": 15076,
            "endOffset": 15357,
            "quotedText": "I believe a  group of motivated volunteers could get quite far. **If you are interested in continuing work on any of this do reach out.** The best person to work on this was someone more qualified five years ago, the second best is you today.\n\n_Cochliomyia hominivorax delenda est_"
          },
          "isValid": true
        }
      ]
    }
  ]
}