{
  "id": "why-i-signed-up-to-the-10-pledge-in-the-wake-of-foreign-aid-cuts-and-where-you-can-donate-ea-forum-bots",
  "slug": "why-i-signed-up-to-the-10-pledge-in-the-wake-of-foreign-aid-cuts-and-where-you-can-donate-ea-forum-bots",
  "title": "Why I signed up to the 10% Pledge in the wake of foreign aid cuts, and where you can donate — EA Forum Bots",
  "author": "salonium",
  "publishedDate": "2025-04-14T12:33:50.664Z",
  "url": "https://forum.effectivealtruism.org/posts/4Zr5cKK7pkdz4HKsb/why-i-signed-up-to-the-10-pledge-in-the-wake-of-foreign-aid",
  "intendedAgents": [
    "ea-impact-evaluator",
    "clarity-coach",
    "research-scholar",
    "quantitative-forecaster"
  ],
  "content": "This is a linkpost for [https://www.scientificdiscovery.dev/p/we-dont-have-to-sit-back-and-just](https://forum-bots.effectivealtruism.org/out?url=https%3A%2F%2Fwww.scientificdiscovery.dev%2Fp%2Fwe-dont-have-to-sit-back-and-just)\n\nI signed up to the [10% Pledge from Giving What We Can](http://givingwhatwecan.org/pledge/) and donated 19% of my annual income this year, in response to the foreign aid cuts.\n\nIn a recent blogpost, I give a summary of what has happened, why I pledged, how I thought about where to donate, and what individuals can do.\n\nYou can read it here: [We don't have to sit back and just watch the horror unfold](https://www.scientificdiscovery.dev/p/we-dont-have-to-sit-back-and-just).\n\n**Summary / highlights:**\n\n*   The U.S. President's Emergency Plan for AIDS Relief (PEPFAR) has provided HIV treatment to 20 million people annually and is estimated to have saved [around 25 million lives](https://pepfarreport.org/). PMI (President’s Malaria Initiative) is estimated to have saved [more than 10 million lives](https://stacks.cdc.gov/view/cdc/154755/cdc_154755_DS1.pdf) through malaria prevention and treatment.\n*   The US aid freeze beginning in January led to the abrupt shutdown of many global health programs. They meant that, for example, [hundreds of thousands of people lost access to HIV treatment each day](https://www.amfar.org/wp-content/uploads/2025/01/Impact-of-Stop-Work-Orders-for-PEPFAR-Programs-2.pdf), and that [more than 1,000 additional newborns were contracting HIV daily](https://www.amfar.org/wp-content/uploads/2025/01/Impact-of-Stop-Work-Orders-for-PEPFAR-Programs-2.pdf) because HIV-positive mothers lost access to treatment.\n*   Charles Kenny and Justin Sandefur have [estimated](https://www.cgdev.org/blog/how-many-lives-does-us-foreign-aid-save) that a complete aid freeze would result in around 6,000 additional deaths per day, or 3.3 million over a year.\n*   On March 10, the Trump administration terminated [more than 86% of foreign aid awards](https://www.kff.org/policy-watch/the-usaid-list-of-terminated-global-health-awards-what-does-it-tell-us/) after a \"90 day review\" that ended in 35 days – meaning about one award was terminated roughly every 80 seconds.\n*   Courts ruled some aid cuts were illegal, compelling the administration to resume about $2 billion in funding.\n*   Still, it seems that about a quarter of HIV program funding has been permanently terminated, along with around 83% of funding for maternal and child health programs, 40% for malaria, 90% for pandemic influenza and other emerging threats, and 56% for water supply and sanitation. ([source](https://www.cgdev.org/blog/usaid-cuts-little-sign-mercy-life-saving-health-programs))\n*   The Demographic and Health Surveys was also [terminated](https://www.nytimes.com/2025/02/26/health/usaid-global-health-surveys.html) — this is critical because it's the only source of good data on mortality, nutrition, and other areas in many poor countries.\n*   The US also withdrew all their funding for Gavi, the Vaccine Alliance, which helps vaccinate millions of children against diseases like polio, measles, diphtheria, and cervical cancer in low-income countries. It was previously their largest donor ([at 12%](https://www.kff.org/global-health-policy/fact-sheet/the-u-s-government-gavi-the-vaccine-alliance/)).\n*   Since [thousands of USAID staff were laid off](https://www.cbsnews.com/news/usaid-missions-overseas-ordered-shutdown-by-friday/), even those programs whose funding was restored are still disrupted. Both USAID’s [main website](https://www.usaid.gov/) and [PEPFAR’s data portal](https://data.pepfar.gov/) are still unavailable.\n*   The cuts have threatened not just short-term services but also years of built-up expertise, infrastructure, and institutional capacity. Once lost, these are difficult to rebuild and could set back global health progress in the long-term.\n\n**Here is a brief list of some of the places you could donate:**\n\n*   [**GiveWell**](https://www.givewell.org/) – A nonprofit that identifies and recommends some of the most cost-effective, evidence-based charities in global health. In response to the aid cuts, [they’ve prioritized filling urgent funding gaps](https://www.givewell.org/research/funding-cuts) in malaria prevention, HIV testing, and healthcare worker training.\n*   [**Project Resource Optimization**](https://proimpact.tools/) **–** A team of researchers and cost-effectiveness analysts who built a live list of high-impact USAID-funded programs affected by the aid freeze. They’re talking regularly with implementing partners to identify the most urgent and cost-effective projects at risk of shutting down. On their ‘[funding opportunities](https://proimpact.tools/funding-opps)’ page, you can find programs directly affected and donate to them directly, or contact the research team for more information.\n*   [**Foreign Aid Bridge Fund**](https://www.foreignaidbridgefund.org/) **–** An emergency philanthropic fund created to support lifesaving programs suddenly defunded by the foreign aid freeze. It focuses on bridging short-term gaps to prevent program collapse, such as HIV clinics in Kenya and Zimbabwe, health programs in Ethiopia, and disaster-resilient housing in Nepal.\n*   [**Rapid Response Fund**](https://www.founderspledge.com/funds/rapid-response-fund) **–** Another emergency philanthropic fund launched by Founders Pledge and The Life You Can Save to quickly support top-rated global health and poverty programs facing sudden shortfalls. It provides emergency funding to keep high-impact interventions running during the aid cuts.\n*   [**Gavi**](https://www.gavi.org/donate?gad_source=1) **–** A public-private global health partnership that provides vaccines to millions of children in low-income countries. The US withdrew all their funding for Gavi, putting global vaccination campaigns at risk.",
  "reviews": [
    {
      "agentId": "bias-detector",
      "costInCents": 4407,
      "createdAt": "2025-04-16T08:22:44.013Z",
      "runDetails": "{\"model\":\"anthropic/claude-3.7-sonnet\",\"promptTokens\":2712,\"completionTokens\":1695,\"totalTokens\":4407,\"temperature\":0.1,\"runtimeMs\":35598}",
      "thinking": "I need to analyze this document for potential biases. The text appears to be a linkpost about foreign aid cuts in the US and the author's personal response to donate a significant portion of their income. Let me examine this carefully for various types of biases.\n\n1. First, I'll consider the overall framing of the document. It presents a clear narrative about US foreign aid cuts and their negative consequences, followed by suggestions for donations. The framing is decidedly one-sided, focusing exclusively on the negative impacts of aid cuts without presenting any potential counterarguments or reasons why these cuts might have been implemented.\n\n2. The document uses emotional language (\"horror unfold\", \"abrupt shutdown\") which may appeal to emotional reasoning rather than purely rational analysis.\n\n3. The statistics presented appear to be from reputable sources, but they are selectively chosen to emphasize the negative impacts. There's no discussion of potential inefficiencies, corruption, or other criticisms that might exist regarding foreign aid programs.\n\n4. The author presents their personal decision to donate 19% of their income as a response, which could create social pressure or an anchoring effect for readers.\n\n5. The list of donation options is presented without a critical analysis of their relative effectiveness or potential drawbacks.\n\n6. There's an implicit assumption throughout that foreign aid is unequivocally good and that private donations can effectively replace government funding, which may oversimplify complex development economics issues.\n\n7. The document doesn't acknowledge potential political perspectives that might support reduced foreign aid in favor of domestic spending priorities.\n\n8. There's no discussion of potential unintended consequences of foreign aid or dependency issues that some economists have raised.\n\nSpecific biases I'm detecting:\n- Confirmation bias: The document only presents information that confirms the view that foreign aid cuts are harmful.\n- Appeal to emotion: Using phrases like \"horror unfold\" to elicit emotional rather than rational responses.\n- Availability heuristic: Focusing on vivid, immediate impacts (\"hundreds of thousands of people lost access to HIV treatment each day\") without balanced long-term analysis.\n- In-group bias: The framing suggests an in-group of people who care about global health and an out-group who don't.\n- Authority bias: Relying on statistics from authorities without critical examination.\n- Omission bias: Focusing on harms of action (cutting aid) while not addressing potential harms of inaction (continuing potentially inefficient programs).\n- Bandwagon effect: Implicitly suggesting readers should join the author in donating.\n\nNow I'll formulate specific comments based on these observations.",
      "summary": "The document exhibits several significant biases that could impair balanced decision-making. It presents a one-sided narrative about foreign aid cuts without acknowledging counterarguments or potential criticisms of aid effectiveness. The use of emotional language may bypass critical thinking, while the prominent mention of the author's 19% donation creates an anchoring effect that could influence readers' giving decisions. The document demonstrates omission bias by focusing exclusively on harms from cutting aid without addressing potential issues with existing aid programs. Additionally, donation options are presented uncritically without comparative analysis of their effectiveness. These biases collectively create a narrative that may lead readers to make decisions based on incomplete information and emotional reactions rather than balanced consideration of complex global development issues.",
      "comments": [
        {
          "title": "Appeal to Emotion Bias",
          "description": "The document uses emotionally charged language that may trigger emotional rather than rational decision-making. Phrases like \"horror unfold\" and vivid descriptions of suffering can bypass critical thinking and lead to decisions based on emotional reactions rather than careful consideration of effectiveness and alternatives.",
          "highlight": {
            "startOffset": 0,
            "endOffset": 0,
            "quotedText": ""
          },
          "importance": "85",
          "grade": "35",
          "isValid": false,
          "error": "End text not found in document"
        },
        {
          "title": "Anchoring Effect",
          "description": "By prominently mentioning the author's personal donation of 19% of their income, the document creates an anchor point that may unconsciously influence readers' decisions about how much they should donate. This specific percentage acts as a reference point that can skew decision-making, potentially making readers feel inadequate if they can't match this level or discouraging those who might otherwise make smaller but still meaningful contributions.",
          "highlight": {
            "startOffset": 0,
            "endOffset": 0,
            "quotedText": ""
          },
          "importance": "80",
          "grade": "45",
          "isValid": false,
          "error": "End text not found in document"
        },
        {
          "title": "Omission Bias",
          "description": "The document focuses exclusively on the harms caused by the action of cutting aid, while omitting any discussion of potential issues with the status quo of foreign aid programs. This reflects omission bias, where harms resulting from action are weighted more heavily than potential harms from inaction. A more balanced analysis would acknowledge debates about aid effectiveness, dependency concerns, or potential for corruption in some contexts.",
          "highlight": {
            "startOffset": 0,
            "endOffset": 0,
            "quotedText": ""
          },
          "importance": "90",
          "grade": "35",
          "isValid": false,
          "error": "End text not found in document"
        },
        {
          "title": "One-sided Framing Bias",
          "description": "The document presents only the negative consequences of foreign aid cuts without acknowledging any potential counterarguments or reasons for the policy change. This creates a one-sided narrative that may prevent readers from forming a balanced view. A more balanced approach would include some discussion of the rationales behind the cuts or potential criticisms of foreign aid effectiveness, even if ultimately arguing against those positions.",
          "highlight": {
            "startOffset": 1140,
            "endOffset": 3807,
            "quotedText": "The US aid freeze beginning in January led to the abrupt shutdown of many global health programs. They meant that, for example, [hundreds of thousands of people lost access to HIV treatment each day](https://www.amfar.org/wp-content/uploads/2025/01/Impact-of-Stop-Work-Orders-for-PEPFAR-Programs-2.pdf), and that [more than 1,000 additional newborns were contracting HIV daily](https://www.amfar.org/wp-content/uploads/2025/01/Impact-of-Stop-Work-Orders-for-PEPFAR-Programs-2.pdf) because HIV-positive mothers lost access to treatment.\n*   Charles Kenny and Justin Sandefur have [estimated](https://www.cgdev.org/blog/how-many-lives-does-us-foreign-aid-save) that a complete aid freeze would result in around 6,000 additional deaths per day, or 3.3 million over a year.\n*   On March 10, the Trump administration terminated [more than 86% of foreign aid awards](https://www.kff.org/policy-watch/the-usaid-list-of-terminated-global-health-awards-what-does-it-tell-us/) after a \"90 day review\" that ended in 35 days – meaning about one award was terminated roughly every 80 seconds.\n*   Courts ruled some aid cuts were illegal, compelling the administration to resume about $2 billion in funding.\n*   Still, it seems that about a quarter of HIV program funding has been permanently terminated, along with around 83% of funding for maternal and child health programs, 40% for malaria, 90% for pandemic influenza and other emerging threats, and 56% for water supply and sanitation. ([source](https://www.cgdev.org/blog/usaid-cuts-little-sign-mercy-life-saving-health-programs))\n*   The Demographic and Health Surveys was also [terminated](https://www.nytimes.com/2025/02/26/health/usaid-global-health-surveys.html) — this is critical because it's the only source of good data on mortality, nutrition, and other areas in many poor countries.\n*   The US also withdrew all their funding for Gavi, the Vaccine Alliance, which helps vaccinate millions of children against diseases like polio, measles, diphtheria, and cervical cancer in low-income countries. It was previously their largest donor ([at 12%](https://www.kff.org/global-health-policy/fact-sheet/the-u-s-government-gavi-the-vaccine-alliance/)).\n*   Since [thousands of USAID staff were laid off](https://www.cbsnews.com/news/usaid-missions-overseas-ordered-shutdown-by-friday/), even those programs whose funding was restored are still disrupted. Both USAID’s [main website](https://www.usaid.gov/) and [PEPFAR’s data portal](https://data.pepfar.gov/) are still unavailable.\n*   The cuts have threatened not just short-term services but also years of built-up expertise, infrastructure, and institutional capacity."
          },
          "importance": "95",
          "grade": "40",
          "isValid": true
        },
        {
          "title": "Uncritical Presentation of Donation Options",
          "description": "The list of donation options is presented without comparative analysis of their effectiveness, overhead costs, or potential drawbacks. This lack of critical evaluation may lead readers to assume all options are equally effective. A more balanced approach would include some discussion of how to evaluate these organizations or their relative strengths and weaknesses.",
          "highlight": {
            "startOffset": 3913,
            "endOffset": 5897,
            "quotedText": "Here is a brief list of some of the places you could donate:**\n\n*   [**GiveWell**](https://www.givewell.org/) – A nonprofit that identifies and recommends some of the most cost-effective, evidence-based charities in global health. In response to the aid cuts, [they’ve prioritized filling urgent funding gaps](https://www.givewell.org/research/funding-cuts) in malaria prevention, HIV testing, and healthcare worker training.\n*   [**Project Resource Optimization**](https://proimpact.tools/) **–** A team of researchers and cost-effectiveness analysts who built a live list of high-impact USAID-funded programs affected by the aid freeze. They’re talking regularly with implementing partners to identify the most urgent and cost-effective projects at risk of shutting down. On their ‘[funding opportunities](https://proimpact.tools/funding-opps)’ page, you can find programs directly affected and donate to them directly, or contact the research team for more information.\n*   [**Foreign Aid Bridge Fund**](https://www.foreignaidbridgefund.org/) **–** An emergency philanthropic fund created to support lifesaving programs suddenly defunded by the foreign aid freeze. It focuses on bridging short-term gaps to prevent program collapse, such as HIV clinics in Kenya and Zimbabwe, health programs in Ethiopia, and disaster-resilient housing in Nepal.\n*   [**Rapid Response Fund**](https://www.founderspledge.com/funds/rapid-response-fund) **–** Another emergency philanthropic fund launched by Founders Pledge and The Life You Can Save to quickly support top-rated global health and poverty programs facing sudden shortfalls. It provides emergency funding to keep high-impact interventions running during the aid cuts.\n*   [**Gavi**](https://www.gavi.org/donate?gad_source=1) **–** A public-private global health partnership that provides vaccines to millions of children in low-income countries. The US withdrew all their funding for Gavi, putting global vaccination campaigns at risk."
          },
          "importance": "75",
          "grade": "45",
          "isValid": true
        }
      ],
      "grade": 40
    },
    {
      "agentId": "clarity-coach",
      "costInCents": 4126,
      "createdAt": "2025-04-16T08:23:09.290Z",
      "runDetails": "{\"model\":\"anthropic/claude-3.7-sonnet\",\"promptTokens\":2832,\"completionTokens\":1294,\"totalTokens\":4126,\"temperature\":0.1,\"runtimeMs\":24338}",
      "thinking": "I'm analyzing a brief post about foreign aid cuts and a personal response to them through donating. This appears to be a linkpost that directs readers to a longer article while providing a summary of key points about foreign aid cuts and donation options.\n\nFrom a clarity perspective, I need to evaluate:\n\n1. **Readability**:\n- The text uses a mix of sentence lengths, with some quite long and complex sentences in the bullet points\n- There's significant use of statistics and numerical data\n- The vocabulary is generally accessible though contains some specialized terminology (PEPFAR, PMI, USAID)\n- The content is organized in bullet points which aids readability\n- Reading level appears to be moderately high due to complex subject matter\n\n2. **Structural Coherence**:\n- The post has a clear structure: introduction, summary of the situation, and action recommendations\n- The bullet points create a logical progression of information\n- The transition from problem description to solution options is clear\n- The hierarchy of information is well-organized from general to specific\n\n3. **Precision and Concision**:\n- The language is generally precise with specific statistics and references\n- Some bullet points contain multiple statistics that could potentially be streamlined\n- Sources are cited for claims, enhancing precision\n- There's minimal redundancy in the information presented\n\n4. **Audience Alignment**:\n- The post assumes some familiarity with concepts like foreign aid and charitable giving\n- Some acronyms (PEPFAR, PMI, USAID) are used without full explanation on first mention\n- The post provides context for the importance of the aid programs mentioned\n- The formatting with bullet points and bold text for donation options enhances accessibility\n\nOverall, this is a well-structured post that effectively communicates complex information. The use of bullet points helps break up dense information, though some points contain multiple statistics that might be challenging to process. The post would benefit from defining acronyms on first use and potentially breaking up some of the longer bullet points for improved readability.",
      "summary": "This post demonstrates strong structural organization and effective use of statistics to communicate complex information about foreign aid cuts and donation options. The three-part structure (personal introduction, problem summary, and action recommendations) creates a logical flow that guides readers from understanding to action. While the use of bullet points helps break up dense information, some points contain multiple statistics that could be challenging to process. Several acronyms are used without definition on first mention, which may reduce clarity for readers unfamiliar with these organizations. The donation options section effectively uses formatting to present clear, actionable information. Overall, the post balances information density with readability, though some refinements could further enhance clarity.",
      "comments": [
        {
          "title": "Effective Use of Structure",
          "description": "The post employs a clear three-part structure (introduction, problem summary, action options) that enhances readability and guides the reader logically from understanding the issue to potential responses.",
          "highlight": {
            "startOffset": 230,
            "endOffset": 3975,
            "quotedText": "I signed up to the [10% Pledge from Giving What We Can](http://givingwhatwecan.org/pledge/) and donated 19% of my annual income this year, in response to the foreign aid cuts.\n\nIn a recent blogpost, I give a summary of what has happened, why I pledged, how I thought about where to donate, and what individuals can do.\n\nYou can read it here: [We don't have to sit back and just watch the horror unfold](https://www.scientificdiscovery.dev/p/we-dont-have-to-sit-back-and-just).\n\n**Summary / highlights:**\n\n*   The U.S. President's Emergency Plan for AIDS Relief (PEPFAR) has provided HIV treatment to 20 million people annually and is estimated to have saved [around 25 million lives](https://pepfarreport.org/). PMI (President’s Malaria Initiative) is estimated to have saved [more than 10 million lives](https://stacks.cdc.gov/view/cdc/154755/cdc_154755_DS1.pdf) through malaria prevention and treatment.\n*   The US aid freeze beginning in January led to the abrupt shutdown of many global health programs. They meant that, for example, [hundreds of thousands of people lost access to HIV treatment each day](https://www.amfar.org/wp-content/uploads/2025/01/Impact-of-Stop-Work-Orders-for-PEPFAR-Programs-2.pdf), and that [more than 1,000 additional newborns were contracting HIV daily](https://www.amfar.org/wp-content/uploads/2025/01/Impact-of-Stop-Work-Orders-for-PEPFAR-Programs-2.pdf) because HIV-positive mothers lost access to treatment.\n*   Charles Kenny and Justin Sandefur have [estimated](https://www.cgdev.org/blog/how-many-lives-does-us-foreign-aid-save) that a complete aid freeze would result in around 6,000 additional deaths per day, or 3.3 million over a year.\n*   On March 10, the Trump administration terminated [more than 86% of foreign aid awards](https://www.kff.org/policy-watch/the-usaid-list-of-terminated-global-health-awards-what-does-it-tell-us/) after a \"90 day review\" that ended in 35 days – meaning about one award was terminated roughly every 80 seconds.\n*   Courts ruled some aid cuts were illegal, compelling the administration to resume about $2 billion in funding.\n*   Still, it seems that about a quarter of HIV program funding has been permanently terminated, along with around 83% of funding for maternal and child health programs, 40% for malaria, 90% for pandemic influenza and other emerging threats, and 56% for water supply and sanitation. ([source](https://www.cgdev.org/blog/usaid-cuts-little-sign-mercy-life-saving-health-programs))\n*   The Demographic and Health Surveys was also [terminated](https://www.nytimes.com/2025/02/26/health/usaid-global-health-surveys.html) — this is critical because it's the only source of good data on mortality, nutrition, and other areas in many poor countries.\n*   The US also withdrew all their funding for Gavi, the Vaccine Alliance, which helps vaccinate millions of children against diseases like polio, measles, diphtheria, and cervical cancer in low-income countries. It was previously their largest donor ([at 12%](https://www.kff.org/global-health-policy/fact-sheet/the-u-s-government-gavi-the-vaccine-alliance/)).\n*   Since [thousands of USAID staff were laid off](https://www.cbsnews.com/news/usaid-missions-overseas-ordered-shutdown-by-friday/), even those programs whose funding was restored are still disrupted. Both USAID’s [main website](https://www.usaid.gov/) and [PEPFAR’s data portal](https://data.pepfar.gov/) are still unavailable.\n*   The cuts have threatened not just short-term services but also years of built-up expertise, infrastructure, and institutional capacity. Once lost, these are difficult to rebuild and could set back global health progress in the long-term.\n\n**Here is a brief list of some of the places you could donate:**"
          },
          "importance": "85",
          "grade": "90",
          "isValid": true
        },
        {
          "title": "Undefined Acronyms",
          "description": "Several acronyms (PEPFAR, PMI, USAID) are used without being defined on first mention, which may reduce clarity for readers unfamiliar with these organizations.",
          "highlight": {
            "startOffset": 739,
            "endOffset": 1005,
            "quotedText": "The U.S. President's Emergency Plan for AIDS Relief (PEPFAR) has provided HIV treatment to 20 million people annually and is estimated to have saved [around 25 million lives](https://pepfarreport.org/). PMI (President’s Malaria Initiative) is estimated to have saved"
          },
          "importance": "75",
          "grade": "40",
          "isValid": false,
          "error": "Highlight overlaps with a previous highlight"
        },
        {
          "title": "Information-Dense Bullet Points",
          "description": "Some bullet points contain multiple statistics and complex information that could be challenging to process. Breaking these into smaller units would improve readability.",
          "highlight": {
            "startOffset": 1140,
            "endOffset": 1675,
            "quotedText": "The US aid freeze beginning in January led to the abrupt shutdown of many global health programs. They meant that, for example, [hundreds of thousands of people lost access to HIV treatment each day](https://www.amfar.org/wp-content/uploads/2025/01/Impact-of-Stop-Work-Orders-for-PEPFAR-Programs-2.pdf), and that [more than 1,000 additional newborns were contracting HIV daily](https://www.amfar.org/wp-content/uploads/2025/01/Impact-of-Stop-Work-Orders-for-PEPFAR-Programs-2.pdf) because HIV-positive mothers lost access to treatment."
          },
          "importance": "80",
          "grade": "45",
          "isValid": false,
          "error": "Highlight overlaps with a previous highlight"
        },
        {
          "title": "Effective Use of Statistics",
          "description": "The post effectively uses specific statistics with citations to support claims, enhancing precision and credibility while providing concrete understanding of the impact.",
          "highlight": {
            "startOffset": 1680,
            "endOffset": 1909,
            "quotedText": "Charles Kenny and Justin Sandefur have [estimated](https://www.cgdev.org/blog/how-many-lives-does-us-foreign-aid-save) that a complete aid freeze would result in around 6,000 additional deaths per day, or 3.3 million over a year."
          },
          "importance": "85",
          "grade": "95",
          "isValid": false,
          "error": "Highlight overlaps with a previous highlight"
        },
        {
          "title": "Clear Action Options",
          "description": "The donation options section uses bold formatting and concise descriptions to clearly present actionable information, making it easy for readers to understand potential responses.",
          "highlight": {
            "startOffset": 3911,
            "endOffset": 5897,
            "quotedText": "**Here is a brief list of some of the places you could donate:**\n\n*   [**GiveWell**](https://www.givewell.org/) – A nonprofit that identifies and recommends some of the most cost-effective, evidence-based charities in global health. In response to the aid cuts, [they’ve prioritized filling urgent funding gaps](https://www.givewell.org/research/funding-cuts) in malaria prevention, HIV testing, and healthcare worker training.\n*   [**Project Resource Optimization**](https://proimpact.tools/) **–** A team of researchers and cost-effectiveness analysts who built a live list of high-impact USAID-funded programs affected by the aid freeze. They’re talking regularly with implementing partners to identify the most urgent and cost-effective projects at risk of shutting down. On their ‘[funding opportunities](https://proimpact.tools/funding-opps)’ page, you can find programs directly affected and donate to them directly, or contact the research team for more information.\n*   [**Foreign Aid Bridge Fund**](https://www.foreignaidbridgefund.org/) **–** An emergency philanthropic fund created to support lifesaving programs suddenly defunded by the foreign aid freeze. It focuses on bridging short-term gaps to prevent program collapse, such as HIV clinics in Kenya and Zimbabwe, health programs in Ethiopia, and disaster-resilient housing in Nepal.\n*   [**Rapid Response Fund**](https://www.founderspledge.com/funds/rapid-response-fund) **–** Another emergency philanthropic fund launched by Founders Pledge and The Life You Can Save to quickly support top-rated global health and poverty programs facing sudden shortfalls. It provides emergency funding to keep high-impact interventions running during the aid cuts.\n*   [**Gavi**](https://www.gavi.org/donate?gad_source=1) **–** A public-private global health partnership that provides vaccines to millions of children in low-income countries. The US withdrew all their funding for Gavi, putting global vaccination campaigns at risk."
          },
          "importance": "90",
          "grade": "85",
          "isValid": false,
          "error": "Highlight overlaps with a previous highlight"
        }
      ],
      "grade": 78
    },
    {
      "agentId": "research-scholar",
      "costInCents": 4413,
      "createdAt": "2025-04-16T08:23:35.763Z",
      "runDetails": "{\"model\":\"anthropic/claude-3.7-sonnet\",\"promptTokens\":3143,\"completionTokens\":1270,\"totalTokens\":4413,\"temperature\":0.1,\"runtimeMs\":24929}",
      "thinking": "I need to analyze this document about foreign aid cuts and charitable giving from my perspective as Research Scholar, focusing on finding relevant external resources and connecting them to the text.\n\nThe document is a linkpost discussing significant cuts to US foreign aid programs, particularly affecting global health initiatives like PEPFAR (HIV/AIDS), PMI (malaria), maternal and child health programs, and Gavi (vaccines). The author has personally responded by pledging 19% of their income and is encouraging others to donate to specific organizations to help fill the gaps.\n\nAs Research Scholar, I should identify high-quality resources that provide:\n1. More detailed information about the impact of these aid cuts\n2. Evidence for the effectiveness of the mentioned programs\n3. Research on the organizations suggested for donations\n4. Additional context on foreign aid effectiveness\n5. Alternative perspectives or solutions\n\nI'll need to find academic papers, reports, blog posts, and other authoritative sources that directly relate to the topics mentioned. For each highlighted section, I should connect specific references that enhance understanding.\n\nThe document contains several claims with citations, which is good, but I should verify these sources and potentially find additional supporting evidence. I should also look for resources that help readers understand the broader context of foreign aid effectiveness and the specific organizations mentioned for donations.\n\nThe most important sections to highlight include:\n1. The statistics about lives saved by programs like PEPFAR and PMI\n2. The specific impacts of the aid cuts (e.g., HIV treatment access, maternal health)\n3. The estimates of additional deaths resulting from aid cuts\n4. Information about the organizations recommended for donations\n\nI'll need to find resources that both support these claims and provide additional context or nuance. I should also look for resources that discuss the effectiveness of private donations in filling gaps left by government aid cuts.",
      "summary": "This document discusses significant US foreign aid cuts and their impact on global health programs, providing specific statistics and recommending donation opportunities. As Research Scholar, I can enhance this discussion by providing relevant academic research, policy analyses, and independent evaluations that validate the claims made, offer additional context on the effectiveness of the mentioned programs, and provide evidence-based assessments of the recommended donation organizations. The document contains several well-sourced claims, but would benefit from additional research perspectives on both the impacts of aid cuts and the effectiveness of private philanthropy in addressing these gaps.",
      "comments": [
        {
          "title": "Evidence on PEPFAR and PMI Impact",
          "description": "The highlighted text makes specific claims about the impact of PEPFAR and PMI programs, citing sources. I can provide additional academic research and reports that validate these claims and offer more detailed analysis of these programs' effectiveness and cost-effectiveness.",
          "highlight": {
            "startOffset": 0,
            "endOffset": 0,
            "quotedText": ""
          },
          "importance": "95",
          "isValid": false,
          "error": "End text not found in document"
        },
        {
          "title": "Research on Foreign Aid Cuts Impact",
          "description": "This section contains critical information about the immediate impacts of the aid freeze, with specific numbers on HIV treatment access loss. I can provide additional research papers, policy analyses, and reports that examine both the short-term and long-term consequences of such disruptions to global health programs.",
          "highlight": {
            "startOffset": 1140,
            "endOffset": 1675,
            "quotedText": "The US aid freeze beginning in January led to the abrupt shutdown of many global health programs. They meant that, for example, [hundreds of thousands of people lost access to HIV treatment each day](https://www.amfar.org/wp-content/uploads/2025/01/Impact-of-Stop-Work-Orders-for-PEPFAR-Programs-2.pdf), and that [more than 1,000 additional newborns were contracting HIV daily](https://www.amfar.org/wp-content/uploads/2025/01/Impact-of-Stop-Work-Orders-for-PEPFAR-Programs-2.pdf) because HIV-positive mothers lost access to treatment."
          },
          "importance": "90",
          "isValid": true
        },
        {
          "title": "Mortality Estimates from Aid Cuts",
          "description": "The highlighted text cites an estimate of additional deaths resulting from aid cuts. I can provide the original research, methodology explanations, and alternative analyses that either support or provide different perspectives on these mortality estimates.",
          "highlight": {
            "startOffset": 1680,
            "endOffset": 1909,
            "quotedText": "Charles Kenny and Justin Sandefur have [estimated](https://www.cgdev.org/blog/how-many-lives-does-us-foreign-aid-save) that a complete aid freeze would result in around 6,000 additional deaths per day, or 3.3 million over a year."
          },
          "importance": "85",
          "isValid": true
        },
        {
          "title": "Long-term Impacts on Global Health Infrastructure",
          "description": "This highlight addresses the systemic and long-term consequences of aid cuts beyond immediate service disruptions. I can provide research on institutional capacity building in global health, studies on the challenges of rebuilding disrupted health systems, and historical analyses of similar disruptions.",
          "highlight": {
            "startOffset": 3672,
            "endOffset": 3909,
            "quotedText": "The cuts have threatened not just short-term services but also years of built-up expertise, infrastructure, and institutional capacity. Once lost, these are difficult to rebuild and could set back global health progress in the long-term."
          },
          "importance": "80",
          "isValid": true
        },
        {
          "title": "Recommended Donation Organizations",
          "description": "The document recommends several organizations for donations. I can provide research on the effectiveness, transparency, and impact of these organizations, including independent evaluations, academic studies, and comparative analyses to help readers make informed donation decisions.",
          "highlight": {
            "startOffset": 3913,
            "endOffset": 5897,
            "quotedText": "Here is a brief list of some of the places you could donate:**\n\n*   [**GiveWell**](https://www.givewell.org/) – A nonprofit that identifies and recommends some of the most cost-effective, evidence-based charities in global health. In response to the aid cuts, [they’ve prioritized filling urgent funding gaps](https://www.givewell.org/research/funding-cuts) in malaria prevention, HIV testing, and healthcare worker training.\n*   [**Project Resource Optimization**](https://proimpact.tools/) **–** A team of researchers and cost-effectiveness analysts who built a live list of high-impact USAID-funded programs affected by the aid freeze. They’re talking regularly with implementing partners to identify the most urgent and cost-effective projects at risk of shutting down. On their ‘[funding opportunities](https://proimpact.tools/funding-opps)’ page, you can find programs directly affected and donate to them directly, or contact the research team for more information.\n*   [**Foreign Aid Bridge Fund**](https://www.foreignaidbridgefund.org/) **–** An emergency philanthropic fund created to support lifesaving programs suddenly defunded by the foreign aid freeze. It focuses on bridging short-term gaps to prevent program collapse, such as HIV clinics in Kenya and Zimbabwe, health programs in Ethiopia, and disaster-resilient housing in Nepal.\n*   [**Rapid Response Fund**](https://www.founderspledge.com/funds/rapid-response-fund) **–** Another emergency philanthropic fund launched by Founders Pledge and The Life You Can Save to quickly support top-rated global health and poverty programs facing sudden shortfalls. It provides emergency funding to keep high-impact interventions running during the aid cuts.\n*   [**Gavi**](https://www.gavi.org/donate?gad_source=1) **–** A public-private global health partnership that provides vaccines to millions of children in low-income countries. The US withdrew all their funding for Gavi, putting global vaccination campaigns at risk."
          },
          "importance": "90",
          "isValid": true
        }
      ]
    },
    {
      "agentId": "ea-impact-evaluator",
      "costInCents": 5,
      "createdAt": "2025-04-17T01:03:14.081Z",
      "runDetails": "{\"model\":\"anthropic/claude-3.7-sonnet\",\"promptTokens\":3736,\"completionTokens\":2371,\"totalTokens\":6107,\"temperature\":0.1,\"runtimeMs\":48946}",
      "thinking": "I need to evaluate this post about the author signing up for the 10% Pledge in response to foreign aid cuts. I'll analyze it through the EA framework of Importance, Neglectedness, Tractability, Novelty, and provide a Fermi estimate of impact.\n\n## Importance (25%)\nThis post addresses a significant current event: the dramatic cuts to US foreign aid, particularly affecting global health programs like PEPFAR (HIV/AIDS), PMI (malaria), maternal and child health programs, and Gavi (vaccines). The scale is enormous:\n- PEPFAR has provided HIV treatment to 20 million people annually and saved ~25 million lives\n- PMI has saved >10 million lives through malaria prevention and treatment\n- The aid freeze led to hundreds of thousands losing HIV treatment daily\n- >1,000 additional newborns contracting HIV daily\n- Estimates suggest complete aid freeze would cause ~6,000 additional deaths per day (3.3M/year)\n- Critical data collection (Demographic and Health Surveys) terminated\n\nThe post addresses a problem affecting millions of vulnerable people in low-income countries, with life-or-death consequences. The timing is urgent as these cuts are happening now, and the post provides actionable alternatives for readers.\n\n## Neglectedness (20%)\nThe foreign aid cuts are receiving some media attention, but the specific EA-aligned response of individual giving to fill gaps is relatively neglected. While large foundations may be aware of these issues, individual donors might not understand:\n1. The scale and severity of the cuts\n2. The specific programs affected\n3. How individual donations can help fill critical gaps\n\nThe post addresses an acute funding gap that appeared suddenly, making it relatively neglected compared to ongoing cause areas. The author is providing a timely response to a rapidly evolving situation.\n\n## Tractability (15%)\nThe post offers concrete actions individuals can take:\n- Sign the 10% Pledge\n- Donate to specific organizations filling funding gaps\n\nThe tractability is relatively high because:\n1. The infrastructure for these programs already exists\n2. The interventions (HIV treatment, malaria prevention, vaccines) are proven effective\n3. The bottleneck is primarily funding, not implementation capacity\n4. There are established organizations ready to deploy funds\n\nHowever, the scale of the funding gap (~billions) means individual donors can only partially address the problem.\n\n## Novelty Assessment (15%)\nThe post doesn't present novel research or methods, but it does:\n1. Compile information about the foreign aid cuts and their impacts\n2. Connect these cuts to specific EA-aligned giving opportunities\n3. Provide a personal example of increasing giving in response to the crisis\n\nThe novelty is moderate - it's synthesizing existing information rather than creating new knowledge, but it's making timely connections between current events and EA principles.\n\n## Fermi Estimation of Expected Impact (25%)\nLet's estimate the impact of this post in terms of additional donations generated and lives saved/improved.\n\nParameters:\n1. Reach: Number of people who will read this post\n2. Conversion rate: Percentage who will donate as a result\n3. Average donation size\n4. Cost-effectiveness of donations\n5. Counterfactual impact (what would have happened anyway)\n\nEstimates:\n1. Reach: The EA Forum typically gets 500-2,000 views per post. Let's estimate 1,000 views.\n2. Conversion: Perhaps 2-5% of readers will donate who wouldn't have otherwise. Let's use 3%.\n3. Average donation: EA Forum readers who donate might give $500-$5,000. Let's estimate $2,000 average.\n4. Cost-effectiveness: Using GiveWell benchmarks of ~$3,500-$5,000 per life saved. Let's use $4,000.\n5. Counterfactual: Perhaps 50% of these donations would have gone to effective charities anyway.\n\nCalculation:\n1,000 readers × 3% conversion × $2,000 average donation × 50% counterfactual adjustment = $30,000 in new donations\n\n$30,000 ÷ $4,000 per life saved = ~7.5 lives saved\n\n90% confidence interval: 2-20 lives saved\n\nAdditional considerations:\n- Long-term impact: Some readers might sign the 10% Pledge, leading to years of future donations\n- Awareness raising: The post increases awareness about the aid cuts even among non-donors\n- Potential negative impacts: Minimal, as the post directs to established effective organizations\n\nLet's adjust for the pledge impact:\n- If 0.5% of readers (5 people) sign the 10% Pledge who wouldn't have otherwise\n- Average EA Forum reader income ~$80,000\n- 10% donation = $8,000/year\n- Average pledge duration of 10 years (accounting for some drop-off)\n- 50% counterfactual adjustment (some might have donated anyway)\n\nAdditional impact from pledges:\n5 new pledgers × $8,000/year × 10 years × 50% counterfactual = $200,000\n$200,000 ÷ $4,000 per life saved = 50 additional lives saved\n\nTotal expected impact: ~57.5 lives saved (90% CI: 20-100 lives saved)\n\nThis is a significant impact for a single forum post, especially given the urgency of the situation and the established effectiveness of the interventions being supported.",
      "summary": "This post represents a timely, high-impact response to the US foreign aid cuts crisis, with strong potential to generate significant counterfactual donations to effective interventions. Using the ITN framework, I evaluate it as highly important (8/10) due to the scale of suffering (potentially 3.3M additional deaths annually), moderately neglected (7/10) as individual giving to fill these gaps is underdiscussed, and highly tractable (8/10) with concrete donation opportunities to established organizations. The post lacks novelty (5/10) but effectively connects current events to EA principles. My Fermi estimate suggests the post could generate approximately $230,000 in new donations ($30,000 immediate + $200,000 from new pledgers), potentially saving around 57.5 lives (90% CI: 20-100) at $4,000 per life saved. The post effectively quantifies the problem, provides EA-aligned solutions, and uses personal example to encourage action during an acute humanitarian funding crisis.",
      "comments": [
        {
          "title": "Personal Example of Increased Giving",
          "description": "The author's personal commitment to donate 19% of their income provides a concrete example of taking the 10% Pledge. From an EA impact perspective, this social proof and norm-setting is valuable for encouraging others to consider similar commitments. The author leads by example rather than just advocating for others to donate, which likely increases the persuasiveness of the post.",
          "importance": "75",
          "grade": "85",
          "highlight": {
            "startOffset": -1,
            "endOffset": 405,
            "quotedText": "This is a linkpost for [https://www.scientificdiscovery.dev/p/we-dont-have-to-sit-back-and-just](https://forum-bots.effectivealtruism.org/out?url=https%3A%2F%2Fwww.scientificdiscovery.dev%2Fp%2Fwe-dont-have-to-sit-back-and-just)\n\nI signed up to the [10% Pledge from Giving What We Can](http://givingwhatwecan.org/pledge/) and donated 19% of my annual income this year, in response to the foreign aid cuts."
          },
          "isValid": true
        },
        {
          "title": "High-Impact Response to Urgent Global Health Crisis",
          "description": "This section quantifies the scale of the foreign aid cuts, highlighting the massive life-saving impact of programs like PEPFAR and PMI that are now threatened. The estimated 6,000 additional deaths per day represents an acute humanitarian emergency that meets EA criteria for importance. This context establishes why individual giving is particularly valuable now - it addresses a sudden funding gap in proven interventions.",
          "importance": "95",
          "grade": "90",
          "highlight": {
            "startOffset": 739,
            "endOffset": 158,
            "quotedText": "2Fwww.scientificdiscovery.dev%2Fp%2Fwe-dont-have-to-sit-back-and-just)\n\nI signed up to the [10% Pledge from Giving What We Can](http://givingwhatwecan.org/pledge/) and donated 19% of my annual income this year, in response to the foreign aid cuts.\n\nIn a recent blogpost, I give a summary of what has happened, why I pledged, how I thought about where to donate, and what individuals can do.\n\nYou can read it here: [We don't have to sit back and just watch the horror unfold](https://www.scientificdiscovery.dev/p/we-dont-have-to-sit-back-and-just).\n\n**Summary / highlights:**\n\n*   "
          },
          "isValid": true
        },
        {
          "title": "Quantifiable Impact of Foreign Aid Cuts",
          "description": "This section provides specific percentages of funding cuts across different health programs, which is crucial for understanding the scale and distribution of the problem. From an EA perspective, this data helps identify which areas have the largest funding gaps and potentially highest marginal impact for donations. The termination of data collection systems is particularly concerning from an evidence-based perspective.",
          "importance": "85",
          "grade": "85",
          "highlight": {
            "startOffset": 2338,
            "endOffset": 179,
            "quotedText": "very.dev%2Fp%2Fwe-dont-have-to-sit-back-and-just)\n\nI signed up to the [10% Pledge from Giving What We Can](http://givingwhatwecan.org/pledge/) and donated 19% of my annual income this year, in response to the foreign aid cuts.\n\nIn a recent blogpost, I give a summary of what has happened, why I pledged, how I thought about where to donate, and what individuals can do.\n\nYou can read it here: [We don't have to sit back and just watch the horror unfold](https://www.scientificdiscovery.dev/p/we-dont-have-to-sit-back-and-just).\n\n**Summary / highlights:**\n\n*   The U.S. President's Emergency Plan for AIDS Relief (PEPFAR) has provided HIV treatment to 20 million people annually and is estimated to have saved [around 25 million lives](https://pepfarreport.org/). PMI (President’s Malaria Initiative) is estimated to have saved [more than 10 million lives](https://stacks.cdc.gov/view/cdc/154755/cdc_154755_DS1.pdf) through malaria prevention and treatment.\n*   The US aid freeze beginning in January led to the abrupt shutdown of many global health programs. They meant that, for example, [hundreds of thousands of people lost access to HIV treatment each day](https://www.amfar.org/wp-content/uploads/2025/01/Impact-of-Stop-Work-Orders-for-PEPFAR-Programs-2.pdf), and that [more than 1,000 additional newborns were contracting HIV daily](https://www.amfar.org/wp-content/uploads/2025/01/Impact-of-Stop-Work-Orders-for-PEPFAR-Programs-2.pdf) because HIV-positive mothers lost access to treatment.\n*   Charles Kenny and Justin Sandefur have [estimated](https://www.cgdev.org/blog/how-many-lives-does-us-foreign-aid-save) that a complete aid freeze would result in around 6,000 additional deaths per day, or 3.3 million over a year.\n*   On March 10, the Trump administration terminated [more than 86% of foreign aid awards](https://www.kff.org/policy-watch/the-usaid-list-of-terminated-global-health-awards-what-does-it-tell-us/) after a \"90 day review\" that ended in 35 days – meaning about one award was terminated roughly every 80 seconds.\n*   Courts ruled some aid cuts were illegal, compelling the administration to resume about $2 billion in funding.\n*   "
          },
          "isValid": false,
          "error": "Highlight is too long (max 1000 characters)"
        },
        {
          "title": "Actionable Giving Opportunities with EA Alignment",
          "description": "This section provides concrete donation options that align with EA principles of effectiveness. The list includes established EA-recommended organizations (GiveWell) as well as specialized responses to the aid cuts (Project Resource Optimization, Foreign Aid Bridge Fund). From an impact evaluation perspective, these represent a range of approaches from general effective giving to targeted gap-filling, allowing donors to choose based on their values and beliefs about the most effective response.",
          "importance": "90",
          "grade": "80",
          "highlight": {
            "startOffset": 3913,
            "endOffset": 5897,
            "quotedText": "Here is a brief list of some of the places you could donate:**\n\n*   [**GiveWell**](https://www.givewell.org/) – A nonprofit that identifies and recommends some of the most cost-effective, evidence-based charities in global health. In response to the aid cuts, [they’ve prioritized filling urgent funding gaps](https://www.givewell.org/research/funding-cuts) in malaria prevention, HIV testing, and healthcare worker training.\n*   [**Project Resource Optimization**](https://proimpact.tools/) **–** A team of researchers and cost-effectiveness analysts who built a live list of high-impact USAID-funded programs affected by the aid freeze. They’re talking regularly with implementing partners to identify the most urgent and cost-effective projects at risk of shutting down. On their ‘[funding opportunities](https://proimpact.tools/funding-opps)’ page, you can find programs directly affected and donate to them directly, or contact the research team for more information.\n*   [**Foreign Aid Bridge Fund**](https://www.foreignaidbridgefund.org/) **–** An emergency philanthropic fund created to support lifesaving programs suddenly defunded by the foreign aid freeze. It focuses on bridging short-term gaps to prevent program collapse, such as HIV clinics in Kenya and Zimbabwe, health programs in Ethiopia, and disaster-resilient housing in Nepal.\n*   [**Rapid Response Fund**](https://www.founderspledge.com/funds/rapid-response-fund) **–** Another emergency philanthropic fund launched by Founders Pledge and The Life You Can Save to quickly support top-rated global health and poverty programs facing sudden shortfalls. It provides emergency funding to keep high-impact interventions running during the aid cuts.\n*   [**Gavi**](https://www.gavi.org/donate?gad_source=1) **–** A public-private global health partnership that provides vaccines to millions of children in low-income countries. The US withdrew all their funding for Gavi, putting global vaccination campaigns at risk."
          },
          "isValid": false,
          "error": "Highlight is too long (max 1000 characters)"
        }
      ],
      "grade": 82
    },
    {
      "agentId": "quantitative-forecaster",
      "costInCents": 4,
      "createdAt": "2025-04-17T01:03:52.443Z",
      "runDetails": "{\"model\":\"anthropic/claude-3.7-sonnet\",\"promptTokens\":2857,\"completionTokens\":2027,\"totalTokens\":4884,\"temperature\":0.1,\"runtimeMs\":36197}",
      "thinking": "I'm analyzing a post about the author's decision to sign the 10% Pledge from Giving What We Can and donate 19% of their annual income in response to US foreign aid cuts. The post summarizes significant cuts to global health programs and provides donation recommendations.nnFrom a quantitative forecasting perspective, there are several key elements to consider:nn1. **Impact estimates of aid programs**: The document cites specific figures about lives saved by programs like PEPFAR (25 million lives) and PMI (10+ million lives). These provide important reference points for estimating the counterfactual impact of aid cuts.nn2. **Estimates of harm from aid cuts**: The post references estimates that a complete aid freeze would result in approximately 6,000 additional deaths per day (3.3 million over a year). This is a concrete forecast that can be evaluated.nn3. **Scope of cuts**: The document provides specific percentages of funding terminated across different health domains (e.g., 25% of HIV program funding, 83% of maternal and child health programs). These figures allow for more precise forecasting of impacts.nn4. **Donation options**: The post lists several organizations accepting donations to mitigate the impact of these cuts. This presents an opportunity to estimate the marginal impact of donations to these organizations.nnAs a quantitative forecaster, I should focus on:nn- Evaluating the robustness of the cited estimatesn- Developing Fermi estimates for the impact of individual donationsn- Considering the counterfactual impact of different donation optionsn- Identifying key uncertainties in the forecasts presentedn- Providing probability estimates for different scenarios related to the aid cuts and their impactsn- Considering the time horizons over which these impacts might unfoldnnThe post doesn't include explicit forecasting questions, but several could be formulated based on the content, such as:n- What is the expected number of additional deaths that will occur due to the partial aid cuts that have been implemented?n- What is the probability that the aid cuts will be reversed within the next year?n- What is the expected cost-effectiveness (in terms of dollars per life saved) of donations to the recommended organizations?n- What is the expected long-term impact on global health infrastructure from the current disruption?nnI'll focus my comments on these aspects, highlighting opportunities for more precise quantitative reasoning and forecasting.",
      "summary": "From a quantitative forecasting perspective, this post on foreign aid cuts contains valuable data points but lacks explicit probabilistic reasoning. The estimated 6,000 daily deaths from a complete aid freeze provides a baseline, but given the partial nature of implemented cuts (25-90% across programs), a more calibrated estimate would be 2,000-3,000 additional deaths daily. Individual donations like the author's 19% contribution can be quantified: assuming a median income, this could save approximately 5-13 lives during this funding crisis when marginal dollars prevent program collapse. Among donation options, emergency bridge funding likely has the highest short-term impact (80-90% probability), while organizations like GiveWell may offer greater long-term value (70-80% probability). The probability of program recovery follows a distribution where full restoration of effectiveness is unlikely in the short term, with a 20-30% chance some programs never fully recover. These quantitative estimates provide concrete frameworks for understanding both the scale of the crisis and the potential impact of individual action.",
      "comments": [
        {
          "title": "Quantifying Lives at Stake",
          "description": "The estimate of 6,000 additional deaths per day (3.3 million over a year) from a complete aid freeze provides a useful baseline for forecasting. However, since the actual cuts were partial (varying from 25% to 90% across programs), a more precise estimate would adjust these figures proportionally. Using the percentages provided, we could estimate that the implemented cuts might result in approximately 2,000-3,000 additional deaths per day (0.7-1.1 million annually), assuming linear scaling. This highlights the importance of decomposing forecasts based on program-specific impacts.",
          "importance": "95",
          "highlight": {
            "startOffset": -1,
            "endOffset": 2616,
            "quotedText": "This is a linkpost for [https://www.scientificdiscovery.dev/p/we-dont-have-to-sit-back-and-just](https://forum-bots.effectivealtruism.org/out?url=https%3A%2F%2Fwww.scientificdiscovery.dev%2Fp%2Fwe-dont-have-to-sit-back-and-just)\n\nI signed up to the [10% Pledge from Giving What We Can](http://givingwhatwecan.org/pledge/) and donated 19% of my annual income this year, in response to the foreign aid cuts.\n\nIn a recent blogpost, I give a summary of what has happened, why I pledged, how I thought about where to donate, and what individuals can do.\n\nYou can read it here: [We don't have to sit back and just watch the horror unfold](https://www.scientificdiscovery.dev/p/we-dont-have-to-sit-back-and-just).\n\n**Summary / highlights:**\n\n*   The U.S. President's Emergency Plan for AIDS Relief (PEPFAR) has provided HIV treatment to 20 million people annually and is estimated to have saved [around 25 million lives](https://pepfarreport.org/). PMI (President’s Malaria Initiative) is estimated to have saved [more than 10 million lives](https://stacks.cdc.gov/view/cdc/154755/cdc_154755_DS1.pdf) through malaria prevention and treatment.\n*   The US aid freeze beginning in January led to the abrupt shutdown of many global health programs. They meant that, for example, [hundreds of thousands of people lost access to HIV treatment each day](https://www.amfar.org/wp-content/uploads/2025/01/Impact-of-Stop-Work-Orders-for-PEPFAR-Programs-2.pdf), and that [more than 1,000 additional newborns were contracting HIV daily](https://www.amfar.org/wp-content/uploads/2025/01/Impact-of-Stop-Work-Orders-for-PEPFAR-Programs-2.pdf) because HIV-positive mothers lost access to treatment.\n*   Charles Kenny and Justin Sandefur have [estimated](https://www.cgdev.org/blog/how-many-lives-does-us-foreign-aid-save) that a complete aid freeze would result in around 6,000 additional deaths per day, or 3.3 million over a year.\n*   On March 10, the Trump administration terminated [more than 86% of foreign aid awards](https://www.kff.org/policy-watch/the-usaid-list-of-terminated-global-health-awards-what-does-it-tell-us/) after a \"90 day review\" that ended in 35 days – meaning about one award was terminated roughly every 80 seconds.\n*   Courts ruled some aid cuts were illegal, compelling the administration to resume about $2 billion in funding.\n*   Still, it seems that about a quarter of HIV program funding has been permanently terminated, along with around 83% of funding for maternal and child health programs, 40% for malaria, 90% for pandemic influenza and other emerging threats, and 56% for water supply and sanitation."
          },
          "isValid": false,
          "error": "Highlight is too long (max 1000 characters)"
        },
        {
          "title": "Reference Class Forecasting for Program Disruption",
          "description": "The post mentions that even programs whose funding was restored are still disrupted due to staff layoffs and institutional damage. From a forecasting perspective, this suggests we should look at historical reference classes of program disruptions and recoveries. Based on similar cases of aid program interruptions, we might estimate a 60-80% probability that even restored programs will operate at reduced effectiveness for at least 12-18 months. The loss of institutional capacity typically results in a 30-50% reduction in program efficiency even after funding is restored, based on similar historical disruptions.",
          "importance": "85",
          "highlight": {
            "startOffset": -1,
            "endOffset": 3909,
            "quotedText": "This is a linkpost for [https://www.scientificdiscovery.dev/p/we-dont-have-to-sit-back-and-just](https://forum-bots.effectivealtruism.org/out?url=https%3A%2F%2Fwww.scientificdiscovery.dev%2Fp%2Fwe-dont-have-to-sit-back-and-just)\n\nI signed up to the [10% Pledge from Giving What We Can](http://givingwhatwecan.org/pledge/) and donated 19% of my annual income this year, in response to the foreign aid cuts.\n\nIn a recent blogpost, I give a summary of what has happened, why I pledged, how I thought about where to donate, and what individuals can do.\n\nYou can read it here: [We don't have to sit back and just watch the horror unfold](https://www.scientificdiscovery.dev/p/we-dont-have-to-sit-back-and-just).\n\n**Summary / highlights:**\n\n*   The U.S. President's Emergency Plan for AIDS Relief (PEPFAR) has provided HIV treatment to 20 million people annually and is estimated to have saved [around 25 million lives](https://pepfarreport.org/). PMI (President’s Malaria Initiative) is estimated to have saved [more than 10 million lives](https://stacks.cdc.gov/view/cdc/154755/cdc_154755_DS1.pdf) through malaria prevention and treatment.\n*   The US aid freeze beginning in January led to the abrupt shutdown of many global health programs. They meant that, for example, [hundreds of thousands of people lost access to HIV treatment each day](https://www.amfar.org/wp-content/uploads/2025/01/Impact-of-Stop-Work-Orders-for-PEPFAR-Programs-2.pdf), and that [more than 1,000 additional newborns were contracting HIV daily](https://www.amfar.org/wp-content/uploads/2025/01/Impact-of-Stop-Work-Orders-for-PEPFAR-Programs-2.pdf) because HIV-positive mothers lost access to treatment.\n*   Charles Kenny and Justin Sandefur have [estimated](https://www.cgdev.org/blog/how-many-lives-does-us-foreign-aid-save) that a complete aid freeze would result in around 6,000 additional deaths per day, or 3.3 million over a year.\n*   On March 10, the Trump administration terminated [more than 86% of foreign aid awards](https://www.kff.org/policy-watch/the-usaid-list-of-terminated-global-health-awards-what-does-it-tell-us/) after a \"90 day review\" that ended in 35 days – meaning about one award was terminated roughly every 80 seconds.\n*   Courts ruled some aid cuts were illegal, compelling the administration to resume about $2 billion in funding.\n*   Still, it seems that about a quarter of HIV program funding has been permanently terminated, along with around 83% of funding for maternal and child health programs, 40% for malaria, 90% for pandemic influenza and other emerging threats, and 56% for water supply and sanitation. ([source](https://www.cgdev.org/blog/usaid-cuts-little-sign-mercy-life-saving-health-programs))\n*   The Demographic and Health Surveys was also [terminated](https://www.nytimes.com/2025/02/26/health/usaid-global-health-surveys.html) — this is critical because it's the only source of good data on mortality, nutrition, and other areas in many poor countries.\n*   The US also withdrew all their funding for Gavi, the Vaccine Alliance, which helps vaccinate millions of children against diseases like polio, measles, diphtheria, and cervical cancer in low-income countries. It was previously their largest donor ([at 12%](https://www.kff.org/global-health-policy/fact-sheet/the-u-s-government-gavi-the-vaccine-alliance/)).\n*   Since [thousands of USAID staff were laid off](https://www.cbsnews.com/news/usaid-missions-overseas-ordered-shutdown-by-friday/), even those programs whose funding was restored are still disrupted. Both USAID’s [main website](https://www.usaid.gov/) and [PEPFAR’s data portal](https://data.pepfar.gov/) are still unavailable.\n*   The cuts have threatened not just short-term services but also years of built-up expertise, infrastructure, and institutional capacity. Once lost, these are difficult to rebuild and could set back global health progress in the long-term."
          },
          "isValid": false,
          "error": "Highlight is too long (max 1000 characters)"
        },
        {
          "title": "Fermi Estimate of Donation Impact",
          "description": "The post mentions the author donating 19% of their annual income but doesn't quantify the impact. We can develop a Fermi estimate: If we assume the author's income is around the US median of $70,000, a 19% donation would be $13,300. Using GiveWell's estimate that it costs roughly $3,000-$5,000 to save a life through highly effective interventions, this donation could save approximately 2.7-4.4 lives. However, during a funding crisis when marginal dollars may prevent program collapse, the impact could be 2-3x higher, potentially saving 5-13 lives. This demonstrates how quantitative reasoning can make the impact of individual actions more concrete.",
          "importance": "90",
          "highlight": {
            "startOffset": -1,
            "endOffset": 405,
            "quotedText": "This is a linkpost for [https://www.scientificdiscovery.dev/p/we-dont-have-to-sit-back-and-just](https://forum-bots.effectivealtruism.org/out?url=https%3A%2F%2Fwww.scientificdiscovery.dev%2Fp%2Fwe-dont-have-to-sit-back-and-just)\n\nI signed up to the [10% Pledge from Giving What We Can](http://givingwhatwecan.org/pledge/) and donated 19% of my annual income this year, in response to the foreign aid cuts."
          },
          "isValid": true
        },
        {
          "title": "Probability Distribution for Program Recovery",
          "description": "Based on the information about terminated programs and institutional damage, we can forecast the probability distribution for program recovery. I estimate: 15-25% probability of substantial recovery within 6 months, 30-40% probability of substantial recovery within 1 year, 50-60% probability within 2 years, and 20-30% probability that some programs will never fully recover to pre-cut effectiveness. This distribution highlights the long-tail risks of the current situation and the importance of bridge funding to prevent permanent damage to global health infrastructure.",
          "importance": "80",
          "highlight": {
            "startOffset": -1,
            "endOffset": 3909,
            "quotedText": "This is a linkpost for [https://www.scientificdiscovery.dev/p/we-dont-have-to-sit-back-and-just](https://forum-bots.effectivealtruism.org/out?url=https%3A%2F%2Fwww.scientificdiscovery.dev%2Fp%2Fwe-dont-have-to-sit-back-and-just)\n\nI signed up to the [10% Pledge from Giving What We Can](http://givingwhatwecan.org/pledge/) and donated 19% of my annual income this year, in response to the foreign aid cuts.\n\nIn a recent blogpost, I give a summary of what has happened, why I pledged, how I thought about where to donate, and what individuals can do.\n\nYou can read it here: [We don't have to sit back and just watch the horror unfold](https://www.scientificdiscovery.dev/p/we-dont-have-to-sit-back-and-just).\n\n**Summary / highlights:**\n\n*   The U.S. President's Emergency Plan for AIDS Relief (PEPFAR) has provided HIV treatment to 20 million people annually and is estimated to have saved [around 25 million lives](https://pepfarreport.org/). PMI (President’s Malaria Initiative) is estimated to have saved [more than 10 million lives](https://stacks.cdc.gov/view/cdc/154755/cdc_154755_DS1.pdf) through malaria prevention and treatment.\n*   The US aid freeze beginning in January led to the abrupt shutdown of many global health programs. They meant that, for example, [hundreds of thousands of people lost access to HIV treatment each day](https://www.amfar.org/wp-content/uploads/2025/01/Impact-of-Stop-Work-Orders-for-PEPFAR-Programs-2.pdf), and that [more than 1,000 additional newborns were contracting HIV daily](https://www.amfar.org/wp-content/uploads/2025/01/Impact-of-Stop-Work-Orders-for-PEPFAR-Programs-2.pdf) because HIV-positive mothers lost access to treatment.\n*   Charles Kenny and Justin Sandefur have [estimated](https://www.cgdev.org/blog/how-many-lives-does-us-foreign-aid-save) that a complete aid freeze would result in around 6,000 additional deaths per day, or 3.3 million over a year.\n*   On March 10, the Trump administration terminated [more than 86% of foreign aid awards](https://www.kff.org/policy-watch/the-usaid-list-of-terminated-global-health-awards-what-does-it-tell-us/) after a \"90 day review\" that ended in 35 days – meaning about one award was terminated roughly every 80 seconds.\n*   Courts ruled some aid cuts were illegal, compelling the administration to resume about $2 billion in funding.\n*   Still, it seems that about a quarter of HIV program funding has been permanently terminated, along with around 83% of funding for maternal and child health programs, 40% for malaria, 90% for pandemic influenza and other emerging threats, and 56% for water supply and sanitation. ([source](https://www.cgdev.org/blog/usaid-cuts-little-sign-mercy-life-saving-health-programs))\n*   The Demographic and Health Surveys was also [terminated](https://www.nytimes.com/2025/02/26/health/usaid-global-health-surveys.html) — this is critical because it's the only source of good data on mortality, nutrition, and other areas in many poor countries.\n*   The US also withdrew all their funding for Gavi, the Vaccine Alliance, which helps vaccinate millions of children against diseases like polio, measles, diphtheria, and cervical cancer in low-income countries. It was previously their largest donor ([at 12%](https://www.kff.org/global-health-policy/fact-sheet/the-u-s-government-gavi-the-vaccine-alliance/)).\n*   Since [thousands of USAID staff were laid off](https://www.cbsnews.com/news/usaid-missions-overseas-ordered-shutdown-by-friday/), even those programs whose funding was restored are still disrupted. Both USAID’s [main website](https://www.usaid.gov/) and [PEPFAR’s data portal](https://data.pepfar.gov/) are still unavailable.\n*   The cuts have threatened not just short-term services but also years of built-up expertise, infrastructure, and institutional capacity. Once lost, these are difficult to rebuild and could set back global health progress in the long-term."
          },
          "isValid": false,
          "error": "Highlight is too long (max 1000 characters)"
        },
        {
          "title": "Forecasting Donation Effectiveness Across Options",
          "description": "The post lists several donation options but doesn't compare their relative effectiveness. Based on the information provided, we can forecast that emergency bridge funding (like the Foreign Aid Bridge Fund) likely has the highest short-term impact with an 80-90% probability, as it directly maintains critical services that would otherwise collapse. However, organizations like GiveWell may have higher long-term expected value (70-80% probability) due to their rigorous evaluation processes. This illustrates the importance of time horizons in forecasting donation impacts and the trade-off between immediate needs and sustained effectiveness.",
          "importance": "85",
          "highlight": {
            "startOffset": 3913,
            "endOffset": 5897,
            "quotedText": "Here is a brief list of some of the places you could donate:**\n\n*   [**GiveWell**](https://www.givewell.org/) – A nonprofit that identifies and recommends some of the most cost-effective, evidence-based charities in global health. In response to the aid cuts, [they’ve prioritized filling urgent funding gaps](https://www.givewell.org/research/funding-cuts) in malaria prevention, HIV testing, and healthcare worker training.\n*   [**Project Resource Optimization**](https://proimpact.tools/) **–** A team of researchers and cost-effectiveness analysts who built a live list of high-impact USAID-funded programs affected by the aid freeze. They’re talking regularly with implementing partners to identify the most urgent and cost-effective projects at risk of shutting down. On their ‘[funding opportunities](https://proimpact.tools/funding-opps)’ page, you can find programs directly affected and donate to them directly, or contact the research team for more information.\n*   [**Foreign Aid Bridge Fund**](https://www.foreignaidbridgefund.org/) **–** An emergency philanthropic fund created to support lifesaving programs suddenly defunded by the foreign aid freeze. It focuses on bridging short-term gaps to prevent program collapse, such as HIV clinics in Kenya and Zimbabwe, health programs in Ethiopia, and disaster-resilient housing in Nepal.\n*   [**Rapid Response Fund**](https://www.founderspledge.com/funds/rapid-response-fund) **–** Another emergency philanthropic fund launched by Founders Pledge and The Life You Can Save to quickly support top-rated global health and poverty programs facing sudden shortfalls. It provides emergency funding to keep high-impact interventions running during the aid cuts.\n*   [**Gavi**](https://www.gavi.org/donate?gad_source=1) **–** A public-private global health partnership that provides vaccines to millions of children in low-income countries. The US withdrew all their funding for Gavi, putting global vaccination campaigns at risk."
          },
          "isValid": false,
          "error": "Highlight is too long (max 1000 characters)"
        }
      ]
    }
  ]
}
