{
  "id": "working-in-virtual-reality-a-review-lesswrong",
  "slug": "working-in-virtual-reality-a-review-lesswrong",
  "title": "Working in Virtual Reality: A Review — LessWrong",
  "author": "ozziegooen",
  "publishedDate": "2020-11-20T23:14:28.707Z",
  "url": "https://www.lesswrong.com/posts/7gsehrZnvXo2YGiT7/working-in-virtual-reality-a-review",
  "intendedAgents": [
    "bias-detector",
    "clarity-coach",
    "research-scholar",
    "fake-eliezer",
    "quantitative-forecaster",
    "ea-impact-evaluator"
  ],
  "content": "For the past three days, I started experimenting with working in Virtual Reality. I'm quite impressed. My guess is that it's not good for most people yet, but that 1 to 10% of people reading this would gain a 2 to 20% increase in computer productivity by using a VR working setup. The upper end is for people who get distracted easily or have a difficult time with SAD.\n\nThis feels like the most radical experiment I've made to my setup so far, so I'm quite happy with how it's worked out. I've used to dream of similar setups and it's really cool that the technology is basically there. I've given demos to a few people in my house who haven't been close to VR and their responses varied from fairly impressed to incredibly impressed. \n\nI'm fairly convinced that there's an extremely promising future for work in VR. The VR ecosystem seems to be improving much more quickly than the alternatives. It strikes me as surprisingly possible that within 2 to 5 years, VR work setups will be the generally recommended work setups, at least for \"people in the know.\"\\[1\\] This could both lead to direct improvements and lead the way for radical rethinkings of what work setups are possible.\n\n## My Setup\n\nMy specific setup is an [Oculus Quest 2](https://en.wikipedia.org/wiki/Oculus_Quest_2) ($300), a 2016 Macbook Pro, and the application [Immersed VR](https://immersedvr.com/). Immersed works using WiFi. My router is around 15 feet away from my headset, and my computer is connected directly to the router via Ethernet. In the app I use two \"monitors\"; I downscale a 4K monitor to 2048x1280 and use a side monitor of 1920x1080. It's suggested to keep resolutions rather low both because the Oculus Quest 2 doesn't itself have a high resolution (1832×1920 per eye), and because higher resolution means higher latency. You can have up to five \"virtual\" monitors with Immersed, but I prefer one or two big ones.\n\n![](https://web.archive.org/web/20201124081412im_/https://scontent-sjc3-1.xx.fbcdn.net/v/t1.0-9/p843x403/126958103_10164328584940363_4025454557304811407_o.jpg?_nc_cat=107&ccb=2&_nc_sid=8bfeb9&_nc_ohc=G4IcxI8hp1wAX_8SLJd&_nc_ht=scontent-sjc3-1.xx&tp=6&oh=9ecdb9391a013ba1911123269910215b&oe=5FDBFCEB)\n\nThis is me editing this post. My setup is pretty simple when writing. I have a second screen on the right, but I'm not using it at the moment. I typically have the main screen a bit closer to me, but zoomed it out to make this image more interesting.\n\n![](https://web.archive.org/web/20201124081412im_/https://scontent-sjc3-1.xx.fbcdn.net/v/t1.0-9/127192022_10164338023400363_7864580482307129664_o.jpg?_nc_cat=105&ccb=2&_nc_sid=8bfeb9&_nc_ohc=nen31Qt3-RUAX93kX0V&_nc_oc=AQmnY8mWj6RUFLC7RYf7Z9HBuwrUWzdzalVt52rYQegjQRcGloHyQJdc_O2gaxt_KTg&_nc_ht=scontent-sjc3-1.xx&oh=b576e8e2846def8f482bd16fc62b6e0c&oe=5FE00E9C)\n\nMe browsing LessWrong in the Spaceship area.\n\nI think I used this setup for around 5 working hours on Wednesday, 6 on Thursday, and maybe 2 so far today (but it's still early). It didn't seem to get particularly tiring over that time.  \n  \nI've been getting latency of around 5ms to 15ms, but every minute or so there are some frustrating 1-5 second hiccups. It's possible to watch videos but I have seen large decreases in frame rate from time to time. They have instructions about using [WiFi direct](https://blog.immersed.team/wi-fi-direct-8ec23c74fdab) to make things smoother. I've ordered the necessary module (it's around $25) and should be getting it shortly.\n\nI'm not sure how long I'm going to continue using it. I find the Quest a bit uncomfortable to wear for long periods and sometimes a bit tiring for my eyes. I'm going to continue tinkering to try to make it better.\n\n## Benefits\n\n**Focus**\n\nI have a roommate now and find visual stimuli distracting. I'm also in a room that's a bit of a mess. I like having a lot of things (a lot of small experiments), and that makes it difficult to have a clean workspace.\n\nVR setups can isolate away everything that's not the monitors. There's an option to see a keyboard, but I don't use it (I recommend spending effort to not need to). There's a handful of decent virtual room options. On Immersed there seems to be a few that prominently feature space and space travel.\n\n**Light / SAD**\n\nLessWrong now has a full tag on [lighting](https://www.lesswrong.com/tag/lighting), with 6 popular posts on the topic. I've been considering setting up a system myself. \n\nI'm not sure how to best measure the amount of light experienced in VR vs. the sun, but things seem relatively bright to me with the Quest. VR glasses use curved lenses and a dark environment to focus the LCD light on your eyes, unlike regular monitors that are meant to be visible at any angle. So even a relatively VR small screen can produce more eye-lumens than something much larger. I recently purchased a 350nit 4k monitor and found that that hasn't been quite enough for some parts of the day. With the VR headset, I often turn the monitor brightness _down_. \n\nThe only thread I could find on the topic was [this one](https://www.reddit.com/r/Vive/comments/55gcxh/using_vr_to_treat_seasonal_affective_disorder_sad/) on Reddit, but it doesn't seem that great to me. I found this beginning of a scientific study on \"VR for Seasonal Affective Disorder\", but no completed version. I'd hypothesize that living mostly in VR would have some significant benefits for some people with significant SAD (if you're in VR, how does it even matter what the season is?), though I could imagine that it has some downsides too.\n\n**Ergonomics**\n\nVR headsets can be a bit heavy, but besides that can be highly ergonomic. In virtual environments you can configure screens to be anywhere you want them. I have a decent monitor arm that I find decently suboptimal. I often have a hard time bringing my monitor just where I want, so move my neck to compensate (a bad idea!). It can also be fairly shaky when my desk is in standing mode. In VR I can easily position and reposition my monitors exactly where I want them in the sizes I want them, it's great.\n\nI've previously thought about trying to work while laying down, when my back was particularly sore. There are some intense [$6k++ setups](https://www.youtube.com/watch?v=0eJXc82-duI) for this, and gerry-rigging solutions can be quite awkward. With a VR headset you still would need some solution to position the keyboard, but the monitor issue is of course dramatically simplified. I tried reading a bit while lying down and it worked fine.\n\n**Portability**\n\nOne of the worst things about monitors is that they are a pain to transport. They're quite large and heavy, and I've had a sequence of bad luck moving them without causing at least some considerable damage. The way things are going, with a VR headset, you could have a stellar setup anywhere at all, which is unheard of. Maybe outdoor setups on warm days would be possible, though of course, you'd have to replace the visuals with some similar or superior theme on your device (You'd still get the sounds, sent, and breeze.) Perhaps at some point laptops will forgo the screens, or maybe all the hardware will be in the headset and you'd carry a separate mouse keyboard combo.\n\n**Coworking**\n\nI haven't tried this yet, but apparently, you can cowork with Immersed. I believe you get the benefit(?) of being able to see the screens of other coworkers. The options are quite configurable depending on the program.\n\nCoworking in VR has the obvious benefit of allowing people to live anywhere, but also the obvious cost of not being able to see people's faces. In Immersed there is one feature where you can have a \"digital webcam\" that uses an avatar of you in a format that's accessible for online video chats in Google Meet and similar. It's neat but faily basic. \n\nFacebook has an impressive demo of [Photorealistic Face Tracked Avatars,](https://www.youtube.com/watch?v=86-tHA8F-zU) but I imagine it won't be released for a while.\n\n![](https://39669.cdn.cke-cs.com/rQvD3VnunXZu34m86e5f/images/0abd72565ab4f28e537afb6e6367bb863698f828c0f9ba54.png)\n\n## Negatives\n\n**Resolution & Latency**\n\nAs mentioned, the resolution is rather poor compared to modern monitors. The latency is significantly worse, though Wifi direct should help, and Windows setups with direct connections should be fine. This seems quite bad for high-bandwidth tasks like video editing or video games, but useable for typing and a lot of coding.\n\n**Discomfort**\n\nVR headsets are still a bit uncomfortable to wear for long periods. I imagine this will improve a lot over time. I think that future prototypes look a lot like sunglasses. Apple apparently is [getting into the space,](https://www.macrumors.com/roundup/apple-glasses/) so I imagine their take will be particularly lightweight. \n\n**Facebook (Quest only)**\n\nThe Quest 2 requires Facebook login and the operating system is heavily integrated with Facebook. To share a screenshot of my in-game setup I actually had to post it to my Facebook wall, then copy and paste that image. In general the on-system OS is useable but quite basic.\n\n## Other Discussions\n\nThere are a few neat videos of people showing off their VR office setups:\n\n*   [This one](https://www.youtube.com/watch?v=y2mwPLbwYgA) is a nice overview of Immersed, though it's about a year old.\n*   [This video](https://www.reddit.com/r/OculusQuest/comments/gx607s/zoomhangoutsskype_from_vr_in_immersed_need_mac/) shows off the Immersed webcam feature.\n*   [This one](https://www.youtube.com/watch?v=ttrHWZVMugo&t=105s) shows off Virtual Desktop with a wired connection.\n*   Facebook is working on \"[Infinite Office](https://www.youtube.com/watch?v=9zYOnHi66Vo)\" which seems interesting but isn't yet available. It at least demonstrates their optimism and dedication to the area. It's pretty easy for me to imagine it being better than Immersed after it launches.\n\n[Here's](https://www.youtube.com/watch?v=6dHBC-tOnh4) a discussion of someone who didn't find working in VR particularly usable, in part because they needed to see the keyboard and apparently had a lot of in-person distractions. \n\nThe [Immersed Blog](https://blog.immersed.team/) is interesting, though short and biased. [They claim](https://blog.immersed.team/working-in-vr-8-hrs-day-e8308b6791f0) that their team works for 8+ hours a day in VR, and point out that apparently, some users reported using VR to effectively live in different time zones. \n\nThere's an Immersed Discord and it has most of the discussion I've seen from actual users. The setup is highly biased to favor positive messages, but there is a long list of very enthusiastic users. Generally, people are most positive about the focus benefits and the use of extra monitors. There seems to be almost no discussion from users who have used it for collaboration; most have used it solo.  \n \n\n## Conclusion\n\nWorking in VR is clearly in its \"early days\", but it's definitely happening. There seem to be at least dozens of people working full-time in VR at this point, most have started in the last ~2 years.  The technology is already quite inexpensive and useable. The advantages going forward are numerous and significant.   \n  \nI'd expect the VR headsets coming out this next year to continue to get better, so waiting a while is a safe option. But I suggest keeping an eye out and planning accordingly. If you've been thinking about buying a fancy monitor setup or SAD light setup, you might want to reevaluate.  \n \n\n\\[1\\] By this, I mean what I and many smart startups would recommend. Often very good ideas take a long time to become popular. Popularity seems harder to predict than quality.",
  "reviews": []
}
